{
    "total": 250,
    "time": 162.69761776924133,
    "EDUC.1000": {
        "name": "EDUC.1000 Teaching in the Inclusive Classroom, Part I",
        "url": "https://www.uml.edu/catalog/courses/EDUC/1000/",
        "id": "040437",
        "description": "This course introduces students to what it means to teach in an inclusive elementary classroom. Students will be introduced to designing standards-based lesson plans and measurable learning outcomes. Additionally, they will begin to learn the importance of both formative and summative assessment. Students will learn and practice classroom management techniques to create a safe and effective learning community. Students will also be introduced to effective strategies for differentiation of instruction to make learning accessible to all students.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.1100": {
        "name": "EDUC.1100 Introduction to teaching in Inclusive Classrooms",
        "url": "https://www.uml.edu/catalog/courses/EDUC/1100/",
        "id": "041213",
        "description": "The course provides teachers candidates with an introduction to planning lessons and the opportunity to teach small groups of students in a partner elementary school. Additionally, teacher candidates will begin to use technology that will assist them in managing their own classroom. Teacher candidates will be expected to demonstrate commitment, professionalism and appropriate dispositions for working with diverse learners.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.1500": {
        "name": "EDUC.1500 Teaching in the Inclusive Classroom, Part 2",
        "url": "https://www.uml.edu/catalog/courses/EDUC/1500/",
        "id": "040439",
        "description": "This course is a continuation of the Part I course. Students will continue to explore and practice teaching in an inclusive elementary classroom. They will work on refining curriculum development skills including designing a unit and standards-based lesson plans with clearly-aligned assessments and measurable learning outcomes. Students will refine and practice classroom management techniques to create a safe and effective learning community that promotes democratic practices and is an example of a culturally responsive classroom. Students will also be practice and refine effective strategies for differentiation of instruction to make learning accessible to all students.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "EDUC.1000 Teaching in the Inclusive Classroom, Part I.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.1000"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.1600": {
        "name": "EDUC.1600 Technology and Digital Literacy in the Classroom",
        "url": "https://www.uml.edu/catalog/courses/EDUC/1600/",
        "id": "041418",
        "description": "This course allows students to explore the wide-range of educational technologies, including technology for teaching, as well as technology of learning. Students will explore educational technology standards for teaching and learning, have a chance to try out many types of technologies, and see how these technologies are being used in classroom.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2000": {
        "name": "EDUC.2000 Foundations of Reading",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2000/",
        "id": "040457",
        "description": "This course focuses on the psychological bases of reading process, stages in development of reading ability and the sequence of reading skill acquisition. Topics covered will include the nature of oral language development, the reading process, and the relationship between reading, writing speaking, listening, visualizing and visually representing. Students will study models of literacy instruction, and the theoretical and practical reasons undergirding those models. The use of diagnostic strategies for knowing the learners' literacy performance and strategies for remediation will be examined. The format of the course will be primarily lecture, discussion, small group activities and presentations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2030": {
        "name": "EDUC.2030 Multicultural Children's Literature in the Classroom",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2030/",
        "id": "041159",
        "description": "This course can be applied to the education minor. The purpose of this course focuses on the development of a critical lens that examines the cultural authenticity of multicultural children's literature and the impact of cultural, ethnic, linguistic, gender, (dis)ability, social class, and religious diversity in children's literature on the teaching and learning of young children with diverse backgrounds. Students in this course will also learn about the notion of \"culturally sustaining pedagogy\" through the use of multicultural children's literature to understand and support children who have been traditionally underrepresented in elementary classrooms.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2040": {
        "name": "EDUC.2040 Coaching Young Adolescents",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2040/",
        "id": "041299",
        "description": "This course is designed to better prepare future coaches who will be coaching young adolescents in schools, clubs, communities and other sporting environments.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2050": {
        "name": "EDUC.2050 Connecting Local and Global Issues in Education",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2050/",
        "id": "041022",
        "description": "This educational minor course explores how we prepare students to thrive in a world of volatility, uncertainty, and complexity. Does the traditional view of what students need to know and be able to do by graduation provide the competencies needed to navigate that world? What to graduates need to be successful in a world we cannot even envision, in jobs that have yet to be created? This hybrid course is an elective.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2060": {
        "name": "EDUC.2060 Inclusion in Education and Society",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2060/",
        "id": "041160",
        "description": "This course focuses on the how students with disabilities are included in education and society The course offers multiple perspectives, strategies and readings to consider how inclusive schools and societies that provide supportive, context-appropriate conditions for learning can lead to more positive outcomes for all students and community members. Within the context of special education, students will be introduced to different types of disabilities and services that can be provided in schools, communities and in society to ensure effective inclusion of people with disabilities. This course ma be taken for the education minor.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2100": {
        "name": "EDUC.2100 Introduction to Moderate Disabilities",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2100/",
        "id": "040447",
        "description": "This foundational course consists of two major components. The first provides candidates with a comprehensive examination of special education laws and legislation and the characteristics of students with moderate disabilities. The second component provides and overview of instructional models that have empirical support for their effectiveness in teaching students with moderate disabilities. Candidates also gain exposure to IEP writing and lesson planning.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2200": {
        "name": "EDUC.2200 Education Assessment of Students with Moderate D",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2200/",
        "id": "040449",
        "description": "This course is designed to provide candidates with a framework for understanding the process of assessing students with moderate, high-incidence disabilities. Candidates focus on all aspects of the evaluation process from the point of pre-referral to identification and re-evaluation, with an emphasis on administering, scoring, interpreting, and reporting on formal and informal educational assessments. Emphasis is on the interpretation of assessment data for the purposes of making eligibility decisions and establishing individualized Education Program annual goals, objectives, instructional strategies, and placement decisions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.2100 Introduction to Moderate Disabilities.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.2100"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.2500": {
        "name": "EDUC.2500 Teaching Elementary Social Studies in the Inclusive",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2500/",
        "id": "040452",
        "description": "Teaching Elementary Social Studies prepares teacher candidates to help the younger learner gain knowledge about past and present human experiences as well as to develop the skills necessary to process and apply information. It also prepares the younger learner to develop democratic values and attitudes by providing opportunities for social participation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.2990": {
        "name": "EDUC.2990 Education 2000 level elective (Formerly 01.299)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/2990/",
        "id": "034818",
        "description": "Education 2000 level elective.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3000": {
        "name": "EDUC.3000 Understanding Family and Community Engagement",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3000/",
        "id": "040455",
        "description": "This course is designed to introduce undergraduate students to key concepts of family and community engagement. Students will utilize readings, discussions, and hands-on activities to examine their understanding of the role that families and communities play in the educational lives of students. They will learn community-based relational approaches and design on family or community engagement strategy to utilize in their classrooms. The course will also explore how social networks and school structures impact the development of meaningful relationship between teachers, families, and community members.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.2000 Foundations of Reading, and EDUC.2100 Introduction to Moderate Disabilities.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.2000"
                ],
                [
                    "EDUC.2100"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.3010": {
        "name": "EDUC.3010 Early Literacy Community Experience I (Formerly 02.301)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3010/",
        "id": "037208",
        "description": "This is Part One of a two semester course that focuses on experiential learning associated with the Jumpstart Program.  The course provides students in the education minor with the necessary skills for working with children in early childhood community agencies.  Topics based on the National Association for the Education of Young Children (NAEYC) Standards which include child development, family and community, assessment, teaching and learning, literacy development, and professionalism will be the focus of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3020": {
        "name": "EDUC.3020 Early Literacy Community Experience II (Formerly 02.302)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3020/",
        "id": "037209",
        "description": "This is Part Two of a two semester course that enhances the experiential learning of students in the education minor participating in the Jumpstart Program.  Building on the knowledge base of the first semester, the course allows students to deepen their understanding of the social, emotional and behavioral needs of children in early childhood settings and reflect on how they have integrated what they learned during the experience.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3050": {
        "name": "EDUC.3050 Directed Study",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3050/",
        "id": "041179",
        "description": "This directed study option is available for UG students who are interested in exploring an educational topic that is not in the educational minor and/or furthering their knowledge and skills about a topic that has been introduced in the educational minor. Students in the directed study will work extensively with one instructor who has a depth of knowledge and experience in this specific topic. With the guidance of the instructor, they will develop and submit a study plan with a final project (concrete deliverable that meet the rigor of a --credit course).",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3200": {
        "name": "EDUC.3200 Methods of Teaching Students with Moderate Disabilities",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3200/",
        "id": "040458",
        "description": "This course focuses on practices to support teaching and learning of students with persistent academic and behavior difficulties. Consisting of four interrelated components, core topics addressed in the course include: (1) Effective classroom management to enhance appropriate behavior, prevent problem behavior, and support students at-risk for and with behavior difficulties; (2) Evidence-based instructional design principles, explicit teaching procedures, and interventions for improving access to the general curriculum and specifically for promoting student capacity for decoding, vocabulary use, fluency, and comprehension; (3) Assistive technology use to support instruction and accessibility; and (4) Collaboration with colleagues and families.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.2100 Introduction to Moderate Disabilities.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.2100"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.3400": {
        "name": "EDUC.3400 Mathematics and Problem Solving in the Inclusive E",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3400/",
        "id": "040446",
        "description": "There is a renewed focus in creating math learning environments in the elementary classroom where students are continuously involved in problem solving. In fact, one of the main goals in elementary math is to provide children with the experiences and support to use a variety of strategies to solve real-world problems. This course will help preservice teachers understand how children with different strengths learn math so the can develop, create, implement, and assess lessons and units that align with the Massachusetts Math Common Core State Standards.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3500": {
        "name": "EDUC.3500 Language and Writing Development",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3500/",
        "id": "040448",
        "description": "This course focuses on the theories of language development and the relationship of language learning to the development of writing. Major themes of the course include theoretical frameworks, instructional, and curricular issues underpinning of language and writing development of young children and the need of designing language and writing instruction sensitive to the diverse backgrounds of children. Students will examine the major aspects of language and writing development such as cognition, texts, context, culture, and gender, etc. Specifically, students will examine important issues related to assessment and instruction in the teaching of writing.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3600": {
        "name": "EDUC.3600 Teaching Science through Inquiry in the inclusive",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3600/",
        "id": "040450",
        "description": "In this course, students will do what scientist do: have a chance to ask and answer questions about the world around us, collect data in a variety of ways and use data to help investigate the world. Students will explore how carefully coaching children to learn the skills that scientists use can build their developing science literacy. Students will work in pairs and, with a mentor teacher in a local school, plan, implement, and assess a science unit. Using high-quality science kits, teaching pairs will focus on a different set of science teaching skills each week. The course instructor and mentor teacher will observe and provide verbal and written-feedback each week. Must take 1 undergraduate laboratory science course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Only students enrolled in BA Ed. degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3710": {
        "name": "EDUC.3710 Educational Psychology (Formerly 01.371)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3710/",
        "id": "002310",
        "description": "An introduction to the study of human learning, this course covers topics such as efficiency in learning, testing, the psychology of learning, and theories of learning. For undergraduates only.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: PSYC 1010 General Psychology or SOCI 1010 Intro to Sociology; and Sophomores, Juniors, or Seniors.",
        "requirements": {
            "prerequisites": [
                [
                    "PSYC.1010",
                    "SOCI.1010"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.3730": {
        "name": "EDUC.3730 Teaching and Learning with Technology (Formerly 01.373)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3730/",
        "id": "002311",
        "description": "Explore the wide-range of educational technologies, including technology for teaching, as well as technology of learning. We'll examine educational technology standards for teaching and learning, try out and apply many types of technologies and see how these technologies are being used in educational settings. Finally, you'll be trained and tested as a Google Level 1 Educator.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3840": {
        "name": "EDUC.3840 Language, Literacy and Culture (Formerly 01.384)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3840/",
        "id": "002312",
        "description": "The course examines the role that socio-cultural and socio-political contexts play in children's literacy development, with particular focus on English Language Learners (ELLs).  The course is designed to help students understand the complex and dynamic worlds of diverse learners represented in twenty-first century classrooms.  Students will learn new and effective approaches to teaching and learning that provides struggling learners, especially English Language Learners a fair and equitable chance to succeed in the learning contexts.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3910": {
        "name": "EDUC.3910 Understanding Education (Formerly 01.391)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3910/",
        "id": "002313",
        "description": "The aim of the course is to assist students to build knowledge about educational structures and roles in diverse settings as they consider how education could figure as a calling.  Using a broad range of inquiry methodologies and technologies, students will explore areas of self-selected interest in formal educational settings (K-12 or higher education) or informal educational settings (community or health settings, policy, etc.).  These explorations will culminate in case presentations in the form of digital stories, in which students will share their findings and discuss future goals in the area of education.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.3950": {
        "name": "EDUC.3950 Special Topics in Education",
        "url": "https://www.uml.edu/catalog/courses/EDUC/3950/",
        "id": "041454",
        "description": "This course focuses on the exploration of thematic or issue-oriented or timely topics of interest in education and society.  The precise topics and methods of each section will vary.  Barring duplication of topic, the course may be repeated for credit.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.4000": {
        "name": "EDUC.4000 Sheltered English Instruction",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4000/",
        "id": "040453",
        "description": "This course will prepare students with the knowledge and skills to effectively shelter content instruction to ensure that English Learners (ELs) can access grade level curricula, succeed academically and \"contribute their multilingual and multicultural resources as participants and future leaders in the 21st century global economy\" (MA DESE, 2016). This is a service-learning course. Students will be required to spend 15 hours in schools supporting the instruction of ELs and incorporating the skills and strategies that they learn in this course. This course has three overarching goals that are directly aligned with the MA DESE approved course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-req or Co-req: EDUC.4100 Pre-practicum.",
        "requirements": {
            "prerequisites": [],
            "corequisites": [
                [
                    "EDUC.4100"
                ]
            ]
        }
    },
    "EDUC.4010": {
        "name": "EDUC.4010 Exploring Teaching (Formerly 01.401)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4010/",
        "id": "031976",
        "description": "This course is for third and fourth year undergraduates who are considering teaching as a career. Focusing on students, teachers, classrooms and schools, the course will provide an overview of the historical, philosophical, legal and societal influences that shape education today.  Field work in an elementary, middle or high school will be an integral component of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.4030": {
        "name": "EDUC.4030 Understanding Child Development in a Diverse Society (Formerly 01.503)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4030/",
        "id": "036642",
        "description": "Examines the major theoretical frameworks of child development and how cultural differences affect development and learning.  Focus is on helping students make responsive and culturally relevant pedagogical decisions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.4050": {
        "name": "EDUC.4050 Children with Disabilities in the Classroom (Formerly 01.505)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4050/",
        "id": "033095",
        "description": "This course examines the nature of cognitive emotional, developmental, sensory, and physical disabilities that compromise student capacity to make adequate academic progress without special intervention.  Legal and ethical responsibilities of the educator in inclusive classroom settings and as an active member of a multidisciplinary learning team are emphasized.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.4100": {
        "name": "EDUC.4100 Pre-practicum",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4100/",
        "id": "040456",
        "description": "The pre-practicum focuses on what it means to be a teacher, as well as the content, dispositions and skills necessary to succeed in the teaching profession. Throughout the pre-practicum, learning about the teaching comes through a variety of opportunities: (1) Structured and focused observations in schools of different demographics; (2) Teaching experiences; (3) Participation in professional seminars on diverse educational topics; (4) Engagement with different types of school professionals around educational topics; (5) Reflection on coursework with a field experience component that bridges the gap between academic knowledge and practitioner knowledge.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "EDUC. 2000 Foundations of Reading, and EDUC.2100 Intro to Moderate Disabilities, and EDUC.2500 Tchg.Elem.Soc.Stud.Inclusive, and EDUC.3200 Methods Tchng.Stu.Mod.Disab., and Co-req: EDUC.3400 Math.Prob.Solv.Inclusive E.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.2100"
                ],
                [
                    "EDUC.2500"
                ],
                [
                    "EDUC.3200"
                ]
            ],
            "corequisites": [
                [
                    "EDUC.3400",
                    "MATH.PROB"
                ]
            ]
        }
    },
    "EDUC.4110": {
        "name": "EDUC.4110 Elementary Education Practicum and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4110/",
        "id": "042084",
        "description": "The Elementary Education Practicum is a culminating supervised field experience for Teacher Candidates. During this experience, the Teacher Candidates, with guidance and support from the Supervising Practitioner and the Program Supervisor, gradually work towards full-time teaching responsibility in the Supervising Practitioner's classroom in a general education classroom. Beginning on the first day of classes and continuing through the last day of classes for the semester, Teacher Candidates will attend their practicum site all day, every day, following the calendar of the practicum site. They will mirror the expectations of their Supervising Practitioner. Successful completion of the Elementary Practicum includes meeting all expectations as described by the Department of Elementary and Secondary Education (DESE). The field experience is accompanied by a weekly seminar.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "EDUC.4100 Pre-practicum, and BAEd Elementary and Moderate Disabilities Majors only.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.4100"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.4120": {
        "name": "EDUC.4120 Special Education Practicum and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4120/",
        "id": "042085",
        "description": "The Special Education Practicum is a culminating supervised field experience for Teacher Candidates. During this experience, the Teacher Candidates, with guidance and support from the Supervising Practitioner and the Program Supervisor, gradually work towards full-time teaching responsibility by mirroring the responsibilities of the Supervising Practitioner. Beginning on the first day of classes and continuing through the last day of classes for the semester, Teacher Candidates will attend their practicum site all day, every day, following the calendar of the practicum site. They will mirror the expectations of their Supervising Practitioner. Successful completion of the Special Education Practicum includes meeting all expectations as described by the Department of Elementary and Secondary Education (DESE). The field experience is accompanied by a weekly seminar.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "EDUC.4100 Pre-practicum, and BAEd Elementary and Moderate Disabilities Majors only.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.4100"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.4200": {
        "name": "EDUC.4200 Elementary Education Practicum I",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4200/",
        "id": "002374",
        "description": "This is the first practicum undertaken by teacher candidates and represents the first 100 hours of their required 300 hour practicum Teacher candidates will spend on day each week for a full semester, working in a regular classroom setting. During the 100 hours, they will be supervised by a Supervising Practitioner and Program Supervisor.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.4000 Sheltered English Instruction, and EDUC.4100 Pre-practicum.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.4000"
                ],
                [
                    "EDUC.4100"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.4300": {
        "name": "EDUC.4300 Elementary Education Practicum II",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4300/",
        "id": "040461",
        "description": "Elementary Education Practicum II is a continuation of practicum I in the same setting and requires completion of 200 hours of teaching in a Massachusetts Public School under the supervision of a school-based Supervising Practitioner and a university Program Supervisor. The teacher candidate must assume responsibility for teaching for a minimum of 100 hours during the practicum. Candidates are required to attend a bi-weekly seminar at the Graduate School of Education throughout the practicum and successfully complete the Candidate Assessment of Performance (CAP).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "Pre-req; EDUC.4200 Elementary Education Practicum I.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.4200"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.4400": {
        "name": "EDUC.4400 Special Education Practicum",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4400/",
        "id": "040451",
        "description": "The Special Education Practicum is required for a teaching license in special education at the PreK-8 level. The practicum requires 300 hours working, under the direction of the special education teacher (supervising practitioner) and a university program supervisor. The teacher candidate must assume responsibility for teaching for a minimum of 100 hours during the practicum. Candidates are required to attend a bi-weekly seminar at the Graduate School of Education throughout the practicum and successfully complete the Candidate Assessment of Performance (CAP).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "EDUC.4000 Sheltered English Instruction, and EDUC.4100 Pre-practicum, and EDUC.4200 Elementary Education Practicum I, and EDUC.4300 Elementary Education Practicum II.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.4000"
                ],
                [
                    "EDUC.4100"
                ],
                [
                    "EDUC.4200"
                ],
                [
                    "EDUC.4300"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.4410": {
        "name": "EDUC.4410 Teach Reading/English Bilingual Student (Formerly 02.441)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4410/",
        "id": "002378",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.4430": {
        "name": "EDUC.4430 Methods of Teaching (Formerly 02.443)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4430/",
        "id": "033179",
        "description": "Examines the methods of teaching students with moderate disabilities.  Topics include curriculum (including the Massachusetts frameworks), IEPs, and instructional modifications appropriate for students with special needs.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.4500": {
        "name": "EDUC.4500 Clinical Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/4500/",
        "id": "040454",
        "description": "\t\nThe clinical seminar occurs in conjunction with the elementary and special education practicum. Each seminar session addresses a different section of the Candidate Assessment of Performance (CAP) required for teacher licensure in the Commonwealth of Massachusetts. The seminar also provides the opportunity for teacher candidates to share experiences with peers and faculty. The seminar prepares candidates for their first teaching interviews by providing the services of the University¿s career services who will focus on resume and cover letter writing and by creating opportunities for mock interviews with partner district principals, assistant principals and special education directors",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "EDUC.4000 Sheltered English Instruction, and EDUC.4200 Elementary Education Practicum I, and Co-req: EDUC.4300 Elementary Education Practicum II, and EDUC.4400 Special Education Practicum.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.4000"
                ],
                [
                    "EDUC.4200"
                ]
            ],
            "corequisites": [
                [
                    "EDUC.4300"
                ],
                [
                    "EDUC.4400"
                ]
            ]
        }
    },
    "EDUC.5010": {
        "name": "EDUC.5010 Teaching Diverse Populations (Formerly 01.501)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5010/",
        "id": "002314",
        "description": "Students examine, confront and learn to manage the challenge of successfully educating all children, regardless of racial, cultural, linguistic, gender or physical differences.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5012": {
        "name": "EDUC.5012 Mathematics for Elementary Teachers III: Basic Principles of Euclidean Geometry (Formerly 04.501)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5012/",
        "id": "002529",
        "description": "This course integrates the study of geometry and measurement and includes lines, angles, investigations of triangles, quadrilaterals, polygons, arca and perimeter; congruency, similarity, and Pythagoras' Theorem.  The students will explore mathematical explanation, argument, justification and how these processes connect to geometric proof.  Also systems of units and concepts related to measurement will be investigated.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5013": {
        "name": "EDUC.5013 Introduction to Leading Professional Learning Communities (Formerly 05.501)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5013/",
        "id": "036996",
        "description": "This course introduces participants to strategies that will enable them to cultivate and lead school-based professional learning communities.  During a week-long summer institute, students develop an action plan.  In the fall, students will keep in contact (electronically) with peers and the instructor and will attend a final face-to-face session to support their efforts.  The grade for the one credit course is awarded at the end of the fall semester.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5020": {
        "name": "EDUC.5020 Adolescent Development and Behavior (Formerly 01.502)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5020/",
        "id": "002315",
        "description": "This course provides an overview of adolescent development issues and classroom management practices.  Adolescent development is examined through research into major theorists in developmental psychology: Piaget, Vygotsky, and Erikson etc. Classroom management strategies are explicitly taught through case study analyses, and examination of core beliefs, focusing on interpersonal relationships between students, teachers, parents, mentors and supervisors.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5021": {
        "name": "EDUC.5021 Issues, Mandates and Ethics in Special Education (Formerly 05.502)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5021/",
        "id": "002671",
        "description": "This course will examine special education laws and ethical practices in K-12 settings.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5024": {
        "name": "EDUC.5024 Student Development and Engagement",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5024/",
        "id": "041271",
        "description": "This course will provide an understanding of theories of adolescent development, including both traditional and culturally relevant ways of learning. Participants will learn ways to engage students based on multiple theories of adolescent development.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5030": {
        "name": "EDUC.5030 Understanding Child Development in a Diverse Society (Formerly 01.503)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5030/",
        "id": "036642",
        "description": "Examines the major theoretical frameworks of child development and how cultural differences affect development and learning.  Focus is on helping students make responsive and culturally relevant pedagogical decisions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5035": {
        "name": "EDUC.5035 Directed Study",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5035/",
        "id": "042011",
        "description": "Directed Study",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5040": {
        "name": "EDUC.5040 Methods of Teaching Students with Moderate Disabilities (Formerly 01.504)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5040/",
        "id": "002316",
        "description": "Examines the methods of teaching students with moderate disabilities.  Topics include curriculum (including the Massachusetts frameworks), IEPs, and instructional modifications appropriate for students with special needs.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5043": {
        "name": "EDUC.5043 Methods of Teaching Students with Moderate Disabilities-Secondary",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5043/",
        "id": "039679",
        "description": "Examines the methods of teaching students with moderate disabilities at the secondary level. Topics include curriculum (including the Massachusetts frameworks), IEPs, and instructional modifications appropriate for students with special needs.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5050": {
        "name": "EDUC.5050 Children with Disabilities in the Classroom (Formerly 01.505)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5050/",
        "id": "033095",
        "description": "This course examines the nature of cognitive emotional, developmental, sensory, and physical disabilities that compromise student capacity to make adequate academic progress without special intervention.  Legal and ethical responsibilities of the educator in inclusive classroom settings and as an active member of a multidisciplinary learning team are emphasized.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5060": {
        "name": "EDUC.5060 Oral Comm.for English Lang.Users I: Pronunciation for List. & Speaking (Formerly 02.506)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5060/",
        "id": "002396",
        "description": "This course offers graduate students the opportunity to increase and refine their understanding and ability to produce discrete sounds, sound combinations and the rhythm of spoken English to add in their comprehension of spoken English and to aid in their personal communication skills. Class activities include pronunciation drills, short extended listening, short presentations;speaking tasks and group discussion. This is not a conversation class but student participants will be required to actively speak in each class. Priority given to TA's/RA's an later semester graduate students, but available to all graduate students.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5062": {
        "name": "EDUC.5062 Oral Communications for English Language Users II: Academic Oral English",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5062/",
        "id": "039582",
        "description": "This course offers graduate students the opportunity to increase awareness of and to practice features of advanced spoken communication typical of academic environments: academic discussion/debate, conference/classroom/informal presentation, and question/answer sessions. Targeted skills include structure/organization, body language, intonation, dealing with nervousness, and awareness of cross-cultural communication patterns. As a workshop, this course requires active participation in a variety of speaking tasks, presentation preparation outside of class and feedback/discussion of peer communication. Priority given to and required for all TA's. Some students may be required ot successfully complete 02.506/EDUC.5060 prior to enrollment in",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "EDUC.5060 Oral Communications for English Language Users I: Pronunciation for Listening and Speaking.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.5060"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.5070": {
        "name": "EDUC.5070 Introduction to Academic Writing for English Second Language Users (Formerly 02.507)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5070/",
        "id": "002397",
        "description": "This course offers an introduction to the complex nature of academic language and academic writing, focusing on effective sentence, paragraph and text structures, purposeful and appropriate word choice, the writing process in writing contexts appropriate for graduate students early in their studies. Through attentive, details and critical reading of various materials, students will enhance their writing skills by applying effective planning, drafting, rewriting and editing strategies. As a workshop class, students are required to write (and write often), participate in a variety of oral/written tasks in class, and engage in constructive peer review. Recommended for graduate students early in their studies.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5101": {
        "name": "EDUC.5101 Foundations of Social Justice Education (Formerly 02.510)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5101/",
        "id": "002400",
        "description": "This course provides an introduction to the principles of social justice education, by examining and applying theories and methods of curriculum design, classroom teaching, and social emotional learning and development. This course will prepare educators to foster equity in classroom practice and pedagogy for racially, culturally, socioeconomically, and linguistically diverse learners.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5102": {
        "name": "EDUC.5102 Critical Literacies (Formerly 03.510)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5102/",
        "id": "002495",
        "description": "This course will address thinking, writing and talking about texts. It will examine the range of literacies including critical, print, technology, visual, media and informational. A special focus will be on anti-racist literature and texts of social justice.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5110": {
        "name": "EDUC.5110 Reading Theory & Instr. in Young Adult Literature (Formerly 06.511)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5110/",
        "id": "002746",
        "description": "The purpose of this course is to introduce graduate students who are preparing to teach to the reading theory and instruction appropriate for the teaching of young adult literature. There is an overview of theoretical views, a general study of what constitutes young adult literature, approaches to using the books, and finally developing the ability for critical analysis of this body of work. The course emphasizes the theme of identity in the development of young adults and the books that they read.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5120": {
        "name": "EDUC.5120 History for Teachers (Formerly 04.512)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5120/",
        "id": "002540",
        "description": "This course examines the major concepts, people and events of US and World history using the ten themes outlined by the NCSS ( National Council for the Social Studies).  These standards are grouped under the four strands for teaching social  studies in the state of Massachusetts (history, economics, geography and civics) and guide the focus for teacher preparation and instruction.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5130": {
        "name": "EDUC.5130 Teaching World History (Formerly 04.513)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5130/",
        "id": "002541",
        "description": "In an increasingly globalized and diverse age, courses in world history have become a growing teaching field at the secondary level in the United States.  The overarching purpose of this class is to help students prepare to teach classes in world history.  This course will introduce the field and concepts of world history.  It will familiarize students with available materials such as textbooks, readers, primary documents, academic books and articles, novels, films, websites, and podcasts.  The class will introduce and align with the state, national, and AP standards in world history.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5150": {
        "name": "EDUC.5150 Practicum in English as a Second Language PreK-6 (Formerly 02.515)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5150/",
        "id": "002405",
        "description": "On-site field experience in an ESL classroom, under the supervision of a qualified ESL teacher and faculty of the Graduate School of Education.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5160": {
        "name": "EDUC.5160 Practicum in English as a Second Language 5-12 (Formerly 02.516)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5160/",
        "id": "002406",
        "description": "On-site field experience in an ESL classroom, under the supervision of a qualified ISL teacher and faculty of the Graduate School of Education.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5170": {
        "name": "EDUC.5170 Community Organization and  Parental Partnership (Formerly 02.517)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5170/",
        "id": "002407",
        "description": "The aim is to prepare school personnel to work effectively with community groups and bilingual parent organization.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5200": {
        "name": "EDUC.5200 Teaching Reading and Writing in English (Formerly 02.520)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5200/",
        "id": "002410",
        "description": "This course examines the development of reading and writing necessary for the ESL child to learn to read and write in English.  Students gain familiarity with the various perspectives and practices that have been found to be effective in the teaching of reading and writing to students whose first language is not English.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5201": {
        "name": "EDUC.5201 Curriculum Planning Perspectives (Formerly 01.520)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5201/",
        "id": "002322",
        "description": "This course introduces students to historical and contemporary curriculum perspectives and assists students in developing their own curriculum perspective, situated within the scholarship. The course also helps students develop skill in curriculum planning, grounded in relevant scholarship.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5220": {
        "name": "EDUC.5220 Young Adult Literature (06.522)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5220/",
        "id": "002747",
        "description": "The major emphasis of the course will be discussion and analysis of the goals of a literature curriculum and the exploration of various methods for achieving these goals. The characteristics of the different genres of literature will be discussed in detail",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5240": {
        "name": "EDUC.5240 Educational Assessments of Students with Moderate Disabilities (Formerly 02.524)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5240/",
        "id": "002414",
        "description": "A review of the various assessments and standardized tests that are used to identify students with moderate disabilities.   The interpretation of assessment results and how to communicate them effectively to parents and school personnel will be examined.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5250": {
        "name": "EDUC.5250 Science for Secondary Science Teachers (Formerly 04.525)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5250/",
        "id": "002547",
        "description": "This course emphasizes content knowledge which includes the facts, concepts, laws, theories and organizing frameworks of science and syntactic knowledge which includes values, beliefs and assumptions that the science teacher has about the generation of scientific knowledge.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5270": {
        "name": "EDUC.5270 Language Acquisition (Formerly 06.527)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5270/",
        "id": "030802",
        "description": "This course will focus on the study of the acquisition of language and the relationship of language  learning to the development of literacy.  Students will examine both first and second language acquisition.  Students will be expected to apply their knowledge of language acquisition to best teaching practices for enhancing first and second language development in the classroom and to the development of literacy.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5280": {
        "name": "EDUC.5280 Assessment of  Reading and Language Disabilities (Formerly 06.528)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5280/",
        "id": "002749",
        "description": "This course examines the selection and use of procedures to make an adequate clinical and educational diagnosis. Includes the assessment of function and dysfunction in factors associated with language development; receptive, expressive, writing, reading; and the administration and interpretation of individual and group tests of perceptual, motor, and conceptual functioning in reading and language.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5290": {
        "name": "EDUC.5290 Treatment Reading and Language Disabilities (Formerly 06.529)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5290/",
        "id": "002750",
        "description": "This course will explore the specific practices in remedial teaching in grades K-12, using published materials, and developing new materials for small group, whole class, and tutoring settings. Students will develop and implement realistic corrective programs based on the interpretation of literacy assessments. These programs will include selecting strategies of instruction and materials, and establishing a framework of time and evaluation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.5280 Assessment of Reading and Language Disabilities with a C or better, or Spring 2020 grade of \"P\".",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.5280"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.5300": {
        "name": "EDUC.5300 Interactions and Assessment in Science (Formerly 04.530)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5300/",
        "id": "002549",
        "description": "This course examines the ways in which students interact and learn in the science classroom.  Construction of a Science, Technology, and Society (STS) unit plan, as well as the development of assessment tools that align to lesson and unit goals are key features of this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5301": {
        "name": "EDUC.5301 Reading and Thinking:  Secondary School (Formerly 06.530)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5301/",
        "id": "002751",
        "description": "This course examines the relationships among reading, writing, and thinking in high school, particularly in diverse populations and with second language learners.  Emphasis will be placed upon practical work in classrooms and the development and assessment of new teaching practices.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5320": {
        "name": "EDUC.5320 Inquiry and Interactions Seminar (Formerly 04.532)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5320/",
        "id": "002551",
        "description": "This course focuses on the PLTW approach to STEM teaching, utilizing a problem solving learning opportunities for students to investigate and participate in discourse about scientific ideas. The course will utilize the activity, project, problem-based (APB) instructional design that provides hands-on, real-world activities, projects, and problems. Activities help students build specific knowledge and skills. Projects provide students the opportunity to apply those skills and problems gibe student the change to develop their own solutions to real world problems. Successful completion of the applicable STEM focused PLTW core training course is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5330": {
        "name": "EDUC.5330 Mathematics for Elementary Teachers I: Basic Principles of Arithmetic (Formerly 04.533)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5330/",
        "id": "002552",
        "description": "Participants will be engaged in constructing solid conceptual understanding of the language and operations of arithmetic; topics include place value and the history of counting, inverse processes, a large repertoire of  interpretations of operations with numbers, concepts of integers and rational numbers, multi-digit calculations, including standard algorithms and non-standard methods the reasoning behind the procedures.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5340": {
        "name": "EDUC.5340 Mathematics for Teachers I (Formerly 04.534)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5340/",
        "id": "002553",
        "description": "This course revisits the content related to the development of number and operation, proportions, ratios and percent; modeling operations with fractions, beginning algebra and geometry.  The course emphasizes the meanings of operations and relationships  among those operations; multiple representations of concepts and connections across different representations.  It also examines basic Number Theory concepts, such as factors and multiples, as well as divisibility tests, at both concrete and abstract levels.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5350": {
        "name": "EDUC.5350 Mathematics for Teachers II (Formerly 04.535)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5350/",
        "id": "002554",
        "description": "This course revisits the mathematics content related to the grades 8-12.  It examines in depth elementary functions, and different mathematical models such as linear, quadratic, exponential, logarithmic and trigonometric, to describe real life situations.  The course includes some topics from Euclidean geometry.  The course emphasizes multiple representations of concepts, connections across different representations, as well as different levels of representations form concrete to abstract.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5390": {
        "name": "EDUC.5390 Pre-Practicum: Alternate Route (Formerly 02.539)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5390/",
        "id": "037202",
        "description": "The pre-practicum occurs in the semester before the practicum.  The course focuses on what it means to be a teacher by examining the content, dispositions and skills necessary to succeed in the profession.  Students observe other teachers in their school and must spend one day observing in a district with different demographics.  While there is no credit assigned to the pre-practicum, it is a required component of the program.  Students complete a pre-practicum binder based on their observances.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5400": {
        "name": "EDUC.5400 Pre-Practicum (Formerly 02.540)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5400/",
        "id": "037201",
        "description": "The pre-practicum occurs in the semester before the practicum.  The course focuses on what it means to be a teacher by examining the content, dispositions and skills necessary to succeed in the profession.  Through a combination of site observations in schools of different demographics, personal/professional teaching opportunities and participation in professional seminars, elementary and secondary preservice teachers gain additional information and skills to prepare them for their practicum.  While there is no credit assigned to the pre-practicum, it is a required component of the program.  A fee is assessed.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5402": {
        "name": "EDUC.5402 Pre-Practicum",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5402/",
        "id": "041361",
        "description": "the pre-practicum is a combination of coursework and field experiences and is a state requirement for both teachers of record and preservice teachers. It takes place in the semester before the practicum. Preservice teachers participate in either a full-day professional seminar, diverse field-based observations and experiences. The pre-practicum helps bridge theory into practice and provide opportunities for discussion and feedback in all coursework in the program. A portfolio addressing Massachusetts' professional teacher standards (PSTs) and SMKs (Subject Matter Knowledge) is required at the end of the pre-practicum. After successful completion of the pre-practicum and with the approval of the graduate coordinator, students request a practicum placement.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5410": {
        "name": "EDUC.5410 Teaching Emergent Bilingual Students (Formerly 02.541 & UTL.441)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5410/",
        "id": "033080",
        "description": "The purpose of this course is to prepare new secondary teacher candidates with the knowledge and skills to effectively shelter their content instruction, so that the growing population of English learners (ELs) in PK-12 schools can achieve academic success, and contribute their multilingual and multicultural resources. The course will provide aspiring teachers with practical research-based methods, strategies, and protocols to integrate subject area content, language, and literacy. Successful completion of this course provides SEI (Sheltered English Immersion) endorsement, which is required for teaching in the Commonwealth of Massachusetts. This is a service learning course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5413": {
        "name": "EDUC.5413 Practitioner Action Research (Formerly 07.541)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5413/",
        "id": "002823",
        "description": "This course examines how action research helps educators to learn to explore pressing classroom and school issues in systematic ways. Action research provide educators with opportunities to deepen their knowledge and skills as reflective practitioners, allowing them to contribute to the achievement of students and the improvement of schools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5414": {
        "name": "EDUC.5414 Teaching English Learners-Elementary",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5414/",
        "id": "039680",
        "description": "This course will prepare elementary teacher candidates with the knowledge and skills to effectively shelter content instruction to ensure that the growing population of Massachusetts' English Language Learners (ELLs) can access the curricula, \"achieve academic success and contribute their multilingual and multicultural resources as participants and future leaders in the 21st century global economy\" (MA DESE, 2013). Successful completion of this course provides SEI (Sheltered English Immersion) endorsement, which is required for teaching in the Commonwealth of Massachusetts.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5430": {
        "name": "EDUC.5430 Classroom Management and Integrative Techniques (Formerly 02.543)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5430/",
        "id": "002367",
        "description": "This course prepares participants to create and maintain a safe and collaborative learning environment through the development of effective rituals, routines, and appropriate responses in the classroom. With attention to the development of Positive Behavioral Supports, participants will examine and apply basic behavioral theories, evidence-based principles, and relevant policies. Based in the Three Tiered Philosophy, the course learning progresses for Universal Design concepts to more prescriptive individualized interventions and incorporates the practices of personal reflection, professional collaboration and effective communication.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5490": {
        "name": "EDUC.5490 Theory and Research: Reading and Language (Formerly 06.549)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5490/",
        "id": "002755",
        "description": "A final course on the national and international research in reading and language and the pertinence and proposed implementation of research findings to instruction and the various roles of the reading supervisor or director.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5500": {
        "name": "EDUC.5500 Reading Specialist: Practicum I(Formerly 06.550)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5500/",
        "id": "033548",
        "description": "The Reading Specialist Practicum requires students to use the knowledge gained in their coursework to design, implement, and analyze a program for struggling readers in a clinical experience.  The practicum meets the Massachusetts licensure standards for Reading Specialist.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5510": {
        "name": "EDUC.5510 Elementary Math Methods (Formerly 02.551)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5510/",
        "id": "002422",
        "description": "New approaches in the curriculum and teaching of mathematics in the elementary school;  analysis and use of current materials, national and state standards, multimedia approaches, and inductive and problem-solving techniques.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5511": {
        "name": "EDUC.5511 Literacy Coach: Practicum II (Formerly 06.551)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5511/",
        "id": "033715",
        "description": "This is the second of two clinical practicum experiences in the Reading and Language program. Candidates will design a professional development project in their school setting which will allow them to model lessons, observe and co-teach with peers, and provide feedback to teachers and paraprofessionals. The online seminar provides support for implementing the program. The practicum meets the guidelines for the International Reading Association",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: 06.550 Reading Specialist: Practicum I.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5530": {
        "name": "EDUC.5530 Language Arts and Childrens Literature (Formerly 02.553)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5530/",
        "id": "002424",
        "description": "Approaches in the teaching and assessment of the language arts in the elementary school will be analyzed.  Assorted genres of literature and the development of literature programs for children in multicultural environments will be studied.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5531": {
        "name": "EDUC.5531 Lowell and  Industrial Revolution (Formerly 04 553)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5531/",
        "id": "002569",
        "description": "Participants in this National Endowment for the Humanities-sponsored Landmarks Workshop, offered through the Tsongas Industrial History Center, examine the causes and consequences of America's Industrial Revolution, using Lowell as a case study.  The course covers the nineteenth-century shift from an agrarian to an industrial society, with a focus on water-powered factory systems, textile production and corporations, the issue of slavery in a cotton textile city, labor and women's history, environmental impacts, immigration, globalization, and literary responses.  Limited to NEH participants only.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5560": {
        "name": "EDUC.5560 Reading and Reading Disabilities (Formerly 02.556)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5560/",
        "id": "002427",
        "description": "A critical analysis of fundamental issues and principles in the teaching of reading, including all phases of the elementary reading program.  Analysis and remediation of reading disabilities which explores the use of critical diagnostic tools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5590": {
        "name": "EDUC.5590 Introduction to Education Statistics",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5590/",
        "id": "041269",
        "description": "This course provides students with a foundational understanding of educational statistics. From variables, means, variance,distribution and measuring the central tendency to correlations, statistical/practical significance and group mean difference tests, students will explore the meaning and use of these essential social science tools. In tandem with technique, students will also explore the statistical issues behind topical concerns in education and become familiar with statistical sources of importance to educational researchers.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5592": {
        "name": "EDUC.5592 Teaching Founding Documents (Formerly 04.559)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5592/",
        "id": "002572",
        "description": "This course examines the founding documents and how these documents are relevant in the lives of middle school children.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5593": {
        "name": "EDUC.5593 Research and Evaluation Special Topics",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5593/",
        "id": "041268",
        "description": "This course provides an opportunity to investigate emerging topics in the fields of research methodology or program evaluation education. Topics will vary by semester and the interest and expertise of the faulty member. Discussion of theoretical and practical considerations of the topic under consideration will be integrated across the semester.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5620": {
        "name": "EDUC.5620 Elementary Social Studies  (Formerly 02.562)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5620/",
        "id": "002433",
        "description": "Examines teaching strategies and materials appropriate for the teaching of K-8 social studies.  Examines national and state standards for the discipline.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5630": {
        "name": "EDUC.5630 Elementary Science Methods (Formerly 02.563)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5630/",
        "id": "002434",
        "description": "Models the teaching of science as guided discovery while exploring developmentally appropriate concepts in science.  Examines national and state standards as well as nationally developed curriculum kit-based materials.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5680": {
        "name": "EDUC.5680 Internship in Moderate Disabilities 5-12 (Formerly 02.568)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5680/",
        "id": "038462",
        "description": "Practicum in a special education setting under the supervision of qualified teachers, principal, and university faculty.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5720": {
        "name": "EDUC.5720 Curriculum and Teaching: English (Formerly 02.572)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5720/",
        "id": "002442",
        "description": "The purpose of this course is to prepare teacher candidates for the content-specific dimensions of their practicum. The course is designed to develop pedagogical skills, curriculum writing and also to encourage prospective English teachers to examine their own beliefs, expectations, and dispositions about the nature of the discipline, the practice of teaching, the process of learning, and the nature of the learners.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5730": {
        "name": "EDUC.5730 Curriculum and Teaching History (Formerly 02.573)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5730/",
        "id": "002443",
        "description": "Students analyze the content, methods, materials, and management techniques used in teaching History. Examination of national and state standards for the discipline. The course will include micro-teaching and self-evaluation, as well as school-based observation and participation in schools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5750": {
        "name": "EDUC.5750 Curriculum and Teaching Math (Formerly 02.575)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5750/",
        "id": "002445",
        "description": "Students analyze the content, methods, materials, and management techniques used in teaching mathematics, and examine national and state standards for the discipline. The course includes micro-teaching, self-evaluation, school-based observation, and participation in schools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5760": {
        "name": "EDUC.5760 Curriculum and Teaching Science (Formerly 02.576)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5760/",
        "id": "002446",
        "description": "Students analyze the content, methods, materials, and management techniques used in teaching science. Examination of national and state standards for the discipline. The course will include micro-teaching and self-evaluation, as well as school-based observation and participation in schools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5761": {
        "name": "EDUC.5761 Promoting Healthy Lifestyles Among Students (Formerly 04.576)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5761/",
        "id": "030298",
        "description": "The focus of this course is on applying nutrition concepts relevant to elementary and middle school children and how these concepts can be integrated into the classroom at an age appropriate level.  This course will address a broad range of issues including eating habits, disordered eating, sports nutrition, food allergies and school wellness policies.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5780": {
        "name": "EDUC.5780 Teaching Elementary Education and Seminar (Formerly 02.578)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5780/",
        "id": "002448",
        "description": "This full time practicum in the elementary school covers 12 weeks under the supervision of qualified teachers, principals, and faculty of the Graduate School  of Education. Weekly seminar and portfolio development address the Massachusetts professional teaching standards. Matriculated students only. All coursework must be completed with a minimum 3.25 GPA. Before beginning the practicum.",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5790": {
        "name": "EDUC.5790 Internship in Moderate Disabilities PreK - 8 (Formerly 02.579)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5790/",
        "id": "002449",
        "description": "Practicum in a special education setting under the supervision of qualified teachers, principal, and university faculty.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5830": {
        "name": "EDUC.5830 Teaching English and Seminar (Formerly 02.583)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5830/",
        "id": "002453",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5832": {
        "name": "EDUC.5832 Teaching English and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5832/",
        "id": "041362",
        "description": "The practicum is a minimum of 12-weeks in a school setting and takes place after all coursework is completed. Practicum can take place in a middle or high school depending on the subject area of licensure. Massachusetts' Department of Elementary and Secondary Education requires that a preservice teacher complete 300 hours of student teaching with 100 hours of full teaching responsibility in an approved school setting. Students are matched with experienced and licensed teachers who alongside a university supervisor evaluate the student's performance, provide feedback, support and mentoring. Students return to campus biweekly to attend a practicum seminar that focuses on CAP (Candidate Assessment of Performance).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5840": {
        "name": "EDUC.5840 Teaching History and Seminar (Formerly 02.584)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5840/",
        "id": "002454",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5842": {
        "name": "EDUC.5842 Teaching History and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5842/",
        "id": "041356",
        "description": "The practicum is a minimum of 12-weeks in a school setting and takes place after all coursework is completed. Practicum can take place in a middle of high school depending on the subject area of licensure. Massachusetts' Department of Elementary and Secondary Education requires that a preservice teacher complete 300 hours of student teaching with 100 hours of full teaching responsibility in an approved school setting. Students are matched with experienced and licensed teachers who alongside a university supervisor evaluate the student's performance, provide feedback, support and mentoring. Students return to campus biweekly to attend a practicum seminar that focuses on CAP (Candidate Assessment of Performance).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5890": {
        "name": "EDUC.5890 Teaching Mathematics and Seminar (Formerly 02.589)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5890/",
        "id": "002459",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5892": {
        "name": "EDUC.5892 Teaching Mathematics and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5892/",
        "id": "041359",
        "description": "The practicum is a minimum of 12-weeks in a school setting and takes place after all coursework is completed. Practicum can take place in a middle or high school depending on the subject area of licensure. Massachusetts' Department of Elementary and Secondary Education requires that a preservice teacher complete 300 hours of student teaching with 100 hours of full teaching responsibility in an approved school setting. Students are matched with experienced and licensed teachers who, alongside a university supervisor, evaluate the student's performance, provide feedback, support and mentoring. Students return to campus biweekly to attend a practicum seminar that focuses on CAP (Candidate Assessment of Performance).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5900": {
        "name": "EDUC.5900 Teaching Biology and Seminar (Formerly 02.590)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5900/",
        "id": "002460",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5903": {
        "name": "EDUC.5903 Teaching Biology and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5903/",
        "id": "041358",
        "description": "The practicum is a minimum of 12-weeks in a school setting and takes place after all coursework is completed. Practicum can take place in the middle or high school depending on the subject area of licensure. Massachusetts' Department of Elementary and Secondary Education requires that a preservice teacher complete 300 hours of student teaching with 100 hours of full teaching responsibility in an approved school setting. Students are matched with experienced and licensed teachers who alongside a university supervisor evaluate the students performance, provide feedback, support and mentoring. Students return to campus biweekly to attend a practicum seminar that focuses on CAP (Candidate Assessment of Performance).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5910": {
        "name": "EDUC.5910 Teaching Chemistry and Seminar (Formerly 02.591)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5910/",
        "id": "002461",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5913": {
        "name": "EDUC.5913 Teaching Chemistry and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5913/",
        "id": "041357",
        "description": "The practicum is a minimum of 12-weeks in a school setting and takes place after all coursework is completed. Practicum can take place in a middle or high school depending on the subject area of licensure. Massachusetts' Department of elementary and Secondary Education requires that a preservice teacher complete 300 hours of student teaching with 100 hours of full teaching responsibility in an approved school setting. Students are matched with experienced and licensed teachers who alongside a university supervisor evaluate the student's performance, provide feedback, support and mentoring. Students return to campus biweekly to attend a practicum seminar that focuses on CAP (Candidate Assessment of Performance).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5920": {
        "name": "EDUC.5920 Teaching Earth Science and Seminar (Formerly 02.592)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5920/",
        "id": "002462",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5922": {
        "name": "EDUC.5922 Principalship: Practicum I (Formerly 05.592)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5922/",
        "id": "030303",
        "description": "The first of two practicum experiences in which students assume a broad range of the responsibilities of a principal in order to demonstrate proficiency in meeting the Massachusetts Professional Standards and Indicators for Administrative Leadership. To enroll in the course, students must be employed in a Massachusetts Public School and have identified an administrator (principal or assistant principal) in the school who holds the appropriate Massachusetts Principal License and is willing to act as a mentor. Students must participate in the online course which accompanies the practicum, complete a practicum log, and meet periodically with the program supervisor to discuss their progress.",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5930": {
        "name": "EDUC.5930 Teaching Physics and Seminar (Formerly 02.593)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5930/",
        "id": "002463",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5932": {
        "name": "EDUC.5932 Principalship: Practicum II (Formerly 05.593)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5932/",
        "id": "030304",
        "description": "In order to enroll in Practicum 2, the student must have made satisfactory progress toward meeting the Massachusetts Professional Standards and indicators for Administrative Leadership in Practicum 1 and have logged sufficient hours as established by the program supervisor. In addition to the work required in the accompanying online course, students must complete the responsibilities identified with the mentor and program supervisor. The student's work in Practicum 1 and 2 must meet the total of 500 hours of leadership activities required by the Massachusetts Department of Elementary and Secondary Education.",
        "credits": {
            "min": "2",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5933": {
        "name": "EDUC.5933 Teaching Physics and Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5933/",
        "id": "041360",
        "description": "The practicum is a minimum of 12-weeks in a school setting and takes place after all coursework is completed. Practicum can take place in a middle or high school depending on the subject area of licensure. Massachusetts' Department of Elementary and Secondary Education requires that a preservice teacher complete 300 hours of student teaching with 100 hours of full teaching responsibility in an approved school setting. Students are matched with experienced and licensed teachers who alongside a university supervisor evaluate the student's performance, provide feedback, support and mentoring. Students return to campus biweekly to attend a practicum seminar that focuses on CAP (Candidate Assessment of Performance).",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5940": {
        "name": "EDUC.5940 Teaching General Science and Seminar (Formerly 02.594)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5940/",
        "id": "002464",
        "description": "Full time practicum in the elementary, middle or secondary schools under the supervision of qualified classroom teachers and faculty of the Graduate School of Education.  Weekly seminar and performance assessment addressing the Massachusetts Professional Standards for Teachers.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5942": {
        "name": "EDUC.5942 Practicum I, Middle School Principal 5-8 (Formerly 05.594)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5942/",
        "id": "030305",
        "description": "The practicum is a two-semester (1+2=3credits) field-based experience in which the student engages in administrative responsibilities at the level of a school principal.  These responsibilities are supervised by an on-site supervisor/mentor who holds certification in the appropriate area.  A minimum of 300 hours must be completed during the course of the year.  The responsibilities must be real and varied enough to allow the student to actively apply their knowledge and skills, thus demonstrating competence in the 'Standards for Advanced Programs in Educational Administration' of the ELCC (Educational Leadership Constituent Council).' In addition to the field-based activities, candidates participate regularly in an on-line seminar with the university supervisor/instructor and meet for 3-4 face-to-face seminar sessions at the university.  Students develop a practicum action plan, document their activities in a journal, participate in regular on-line discussions, complete several reflection assignments, and compile a final Practicum Portfolio.  The basis of all work in the online seminar relates directly to the issues, experiences, and questions form the candidate's field-based activities.  The Practicum aims to help all students achieve a fuller realization of their professional and personal resources as leaders and learners and strengthen their effectiveness as educational administrators now and into the future.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5950": {
        "name": "EDUC.5950 Practicum II, Middle School Principal (5-8) (Formerly 05.595)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5950/",
        "id": "030306",
        "description": "The practicum is a two-semester (1+2=3credits) field-based experience in which the student engages in administrative responsibilities at the level of a school principal.  These responsibilities are supervised by an on-site supervisor/mentor who holds certification in the appropriate area.  A minimum of 300 hours must be completed during the course of the year.  The responsibilities must be real and varied enough to allow the student to actively apply their knowledge and skills, thus demonstrating competence in the 'Standards for Advanced Programs in Educational Administration' of the ELCC (Educational Leadership Constituent Council).' In addition to the field-based activities, candidates participate regularly in an on-line seminar with the university supervisor/instructor and meet for 3-4 face-to-face seminar sessions at the university.  Students develop a practicum action plan, document their activities in a journal, participate in regular on-line discussions, complete several reflection assignments, and compile a final Practicum Portfolio.  The basis of all work in the online seminar relates directly to the issues, experiences, and questions form the candidate's field-based activities.  The Practicum aims to help all students achieve a fuller realization of their professional and personal resources as leaders and learners and strengthen their effectiveness as educational administrators now and into the future.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5960": {
        "name": "EDUC.5960 Practicum I, High School Principal 9-12 (Formerly 05.596)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5960/",
        "id": "030307",
        "description": "The practicum is a two-semester (1+2=3credits) field-based experience in which the student engages in administrative responsibilities at the level of a school principal.  These responsibilities are supervised by an on-site supervisor/mentor who holds certification in the appropriate area.  A minimum of 300 hours must be completed during the course of the year.  The responsibilities must be real and varied enough to allow the student to actively apply their knowledge and skills, thus demonstrating competence in the 'Standards for Advanced Programs in Educational Administration' of the ELCC (Educational Leadership Constituent Council).' In addition to the field-based activities, candidates participate regularly in an on-line seminar with the university supervisor/instructor and meet for 3-4 face-to-face seminar sessions at the university.  Students develop a practicum action plan, document their activities in a journal, participate in regular on-line discussions, complete several reflection assignments, and compile a final Practicum Portfolio.  The basis of all work in the online seminar relates directly to the issues, experiences, and questions form the candidate's field-based activities.  The Practicum aims to help all students achieve a fuller realization of their professional and personal resources as leaders and learners and strengthen their effectiveness as educational administrators now and into the future.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.5970": {
        "name": "EDUC.5970 Practicum II, High School Principal (9-12) (Formerly 05.597)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/5970/",
        "id": "030308",
        "description": "The practicum is a two-semester (1+2=3credits) field-based experience in which the student engages in administrative responsibilities at the level of a school principal.  These responsibilities are supervised by an on-site supervisor/mentor who holds certification in the appropriate area.  A minimum of 300 hours must be completed during the course of the year.  The responsibilities must be real and varied enough to allow the student to actively apply their knowledge and skills, thus demonstrating competence in the 'Standards for Advanced Programs in Educational Administration' of the ELCC (Educational Leadership Constituent Council).' In addition to the field-based activities, candidates participate regularly in an on-line seminar with the university supervisor/instructor and meet for 3-4 face-to-face seminar sessions at the university.  Students develop a practicum action plan, document their activities in a journal, participate in regular on-line discussions, complete several reflection assignments, and compile a final Practicum Portfolio.  The basis of all work in the online seminar relates directly to the issues, experiences, and questions form the candidate's field-based activities.  The Practicum aims to help all students achieve a fuller realization of their professional and personal resources as leaders and learners and strengthen their effectiveness as educational administrators now and into the future.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6003": {
        "name": "EDUC.6003 Leadership in Schooling: Residency",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6003/",
        "id": "039779",
        "description": "The residency is a required on-campus component of the Ed.D. in Leadership in Schooling. Held during the summer, students spend several full days working with their student cohort and selected faculty on program outcomes. Students establish study groups, conduct preliminary work for the portfolio (for comprehensive exam I) and qualifying paper (for comprehensive exam II), and participate in daily seminars. There is a fee associated with the residency.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6010": {
        "name": "EDUC.6010 Leadership, Law & Policy in Higher Education (Formerly 08.601)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6010/",
        "id": "002847",
        "description": "This course examines theory, research and practice that inform us about the problem of scholarship, teaching, change and innovation in higher education. Students study academic life in the larger context of the institutional structure.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6011": {
        "name": "EDUC.6011 Pilot Study Proposal (Formerly 05.601)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6011/",
        "id": "036760",
        "description": "Pilot Study Proposal one credit provides the student with a seminar experience for the development of a pilot study proposal. This course is intended for the student who anticipates taking one or two additional semesters to complete the pilot study proposal. Successful completion of a written pilot study proposal and oral defense are required for continued progress in the degree program.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6012": {
        "name": "EDUC.6012 Introduction to Linguistics (Formerly 02.601)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6012/",
        "id": "037783",
        "description": "All language teachers benefit from understanding of how language in general works.  This course is designed to help students to understand and use in their language teaching the basic concepts, methods and approaches of linguistics.  The following topics are covered in the course; phonetics (sounds/sound inventory of a language), phonology (how we understand and organize the sounds and patterns), morphology (word structure, morphernes; how smaller units of meaning make up words), syntax (sentence structure, how words make up sentences), semantics (how we understand and parse sentences, structural ambiguity, context within sentences), pragmatics (how context impacts meaning on a textual level), social aspects of language(dialects, sociolects, language change, etc.).  Although most of the examples will involve English, for comparative and contrastive purposes other languages will be used (no need to understand them).  Students will be encouraged to come up with as many of their own examples as possible.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6020": {
        "name": "EDUC.6020 Pilot Study Proposal (Formerly 05.602)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6020/",
        "id": "036761",
        "description": "Pilot Study Proposal two Credits provides the student with a seminar experience for the development of a pilot study proposal. This course is intended for the student who was previously enrolled in EDUC.6011 and anticipates completing the pilot study proposal by the end of the semester. Successful completion of a written pilot study proposal and oral defense are required for continued progress in the degree program.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6030": {
        "name": "EDUC.6030 Pilot Study Proposal (Formerly 05.603)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6030/",
        "id": "036762",
        "description": "Pilot Study Proposal Three Credits provides the student with a seminar experience for the completion of a pilot study proposal. This course is intended for the student who anticipates completing the pilot study proposal by the end of the semester, and who has not previously taken EDUC.6011 or 6020. Successful completion of a written pilot study proposal and oral defense are required for continued progress in the degree program.",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6040": {
        "name": "EDUC.6040 Leadership of Community Engagement I (Formerly 05.604)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6040/",
        "id": "037685",
        "description": "The purpose of Leadership of Community Engagement I is to expose teacher leaders to the variety of issues associated with family and community engagement.  Through critical examinations of theory, personal experiences and collective knowledge, teacher leaders will learn how to engage families and community members (i.e., business, health and service agencies and community-based organizations) and recognize the different forms of engagement.  This course will highlight collaborative strategies that \"shares power\" with parents, families, and community organizations in schools.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6070": {
        "name": "EDUC.6070 The Adult Learner (Formerly 01.607)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6070/",
        "id": "002335",
        "description": "This course will focus on the learning and development of adolescent young adults, adults and older adults in both school-based and non-school based settings.  Cognitive, emotional, social and professional learning will be addressed as well as differing and changing learning styles across the lifespan and different learning settings.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6071": {
        "name": "EDUC.6071 Advanced Academic Writing I (Formerly 02.607)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6071/",
        "id": "036918",
        "description": "This course will enable graduate level English language learners to become competent academic writers who can critically and creatively evaluate, analyze, construct and present their ideas and arguments.  This is a student oriented, pro-active course where writing skills are connected to reading skills.  Through attentive, detailed and critical reading of various materials students will further enhance their writing skills by applying effective planning, drafting, rewriting and editing strategies.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EDUC.5070 Academic Writing/Engl Language,or satisfactory score on English language placement test.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.5070"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6074": {
        "name": "EDUC.6074 Methods of Sheltered Language Instruction (Formerly 06.607)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6074/",
        "id": "032101",
        "description": "Different approaches and teaching procedures in Second Language instruction will be discussed as well as the methodological models of English as a Second Language instruction.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6075": {
        "name": "EDUC.6075 Academic Writing for English Second Language Users",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6075/",
        "id": "039603",
        "description": "This course engages students in forms of academic writing, particularly relevant to scientific areas of study, from proposal and responses to research articles. Topics include (but not limited to)) the language necessary to convey specialized/technical content to a variety of audiences, information structure, extensive use of sources, analysis of and feedback on writing (published and in progress) and resources (corpora)available and their usage. Priority given to graduate students later in their studies.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "EDUC.5070 Intro to Academic Writing for English Second Language Users.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.5070"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6076": {
        "name": "EDUC.6076 Data Management and Visualization",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6076/",
        "id": "041270",
        "description": "The use and analysis of data in all forms requires that educational researchers understand how to manage and visualize data, making creative use of this knowledge as they build robust findings well supported by evidence. In this class, students will be introduced to the underlying principles of data management and the ways different kinds of data and information can be visualized to support analysis and representation to curious audiences.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6080": {
        "name": "EDUC.6080 Student Development Theory (Formerly 01.608)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6080/",
        "id": "002336",
        "description": "the Student Development Theory course will provide students with a theoretical background in the developmental processes of college students.  The course will cover pertinent models of student development pertaining to cognitive, moral, psycho/social, environmental, and identity development.  Students will gain an understanding of each theory, and understand their practical application.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6100": {
        "name": "EDUC.6100 Teaching Reading in Content Area (Formerly 06.610)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6100/",
        "id": "038725",
        "description": "This course presents the theoretical foundation and current best practices for content area reading, writing, and study skills. The focus is on motivation, cognition, memory, and verbal processing theories as they apply to methodology. Students learn to develop lessons and units that integrate reading and writing while covering concepts in the content areas.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6101": {
        "name": "EDUC.6101 Theories of Learning (Formerly 01.610)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6101/",
        "id": "002338",
        "description": "This course offers a detailed analysis of the major contemporary learning theories, both behavioral and cognitive.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6104": {
        "name": "EDUC.6104 Reading and writing Instruction for Middle and Secondary Teachers",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6104/",
        "id": "041272",
        "description": "This course presents the theoretical foundation and current best practices for content area reading, writing, and study skills. The focus is on motivation, cognition, memory, and verbal processing theories as they apply to methodology. Students learn to develop lessons and units that integrate reading and writing while covering concepts in the content areas.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6110": {
        "name": "EDUC.6110 Introduction to Higher Education  (Formerly 05.611)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6110/",
        "id": "002677",
        "description": "This course provides an overview of the post secondary education system in the United States. It offers an interdisciplinary examination of contemporary colleges and universities with special attention to purposes, institutions, governance, and stakeholders.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6120": {
        "name": "EDUC.6120 Topics in Language Arts and Literacy (Formerly 06.612)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6120/",
        "id": "031958",
        "description": "This is an elective course in the doctoral program that covers a range of topics in language arts and literacy.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6125": {
        "name": "EDUC.6125 Global Perspectives on Higher Education",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6125/",
        "id": "040127",
        "description": "This course explores why higher education today is in the midst of a global revolution. We will examine trends in our current age of globalization and how these trends have impacted the college campus. We will also ask hard questions about why students, faculty, universities, and entire nations seek international exchanges, what they get out of all this movement, and how it relates to the expanding significance of global citizenship. Our goal is to move beyond the \"food, flags, and festivals\" view of global learning and toward meaningful research agendas about the role of higher education in an age of global opportunities and global challenges.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6130": {
        "name": "EDUC.6130 Leading the Professional Learning Community (Formerly 05.613)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6130/",
        "id": "037814",
        "description": "it is well documented that teachers who habitually examine their shared work based on inquiry, observation, analysis of data, dialogue, and experimentation tend to be more effective than those who are not reflective and work in isolation. How do we help all teachers become highly effective: How do we spread reflective practice from isolated pockets to all teachers in a school? The answer lies in the transformation of a school's professional staff from isolated practitioners into a professional learning community. A professional learning community is a work culture in which educators regularly learn with and from each other through collaborative inquiry. This course provides the practical know-how and deep understanding need for educators to introduce and lead collaborative inquiry within their school or district and transform the teaching staff into a professional learning community. Furthermore, this course introduces the idea of collaborative inquiry by transforming participants into a professional learning community during the course. Thus, participants focus collaborative inquiry on their shared practice, read and reflect on selected authors, and develop action plans to help them introduce or advance collaborative inquiry in their own work settings.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6220": {
        "name": "EDUC.6220 Managing Resources and Finances (Formerly 05.622)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6220/",
        "id": "002684",
        "description": "This course will provide students with an understanding of the financial principles and budget management in the operation of our public schools. We will analyze economic and demographic data, review local/state and federal education budgets,examine the legal principles of school finance,review local, state and federal laws and policies on public education and evaluate case studies in the operation of public schools. Students will prepare budget documents, develop financial forecasts and prepare policy briefs on various topics related to school finance.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6221": {
        "name": "EDUC.6221 Science, Mathematics and the Educated Mind (Formerly 04.622)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6221/",
        "id": "002619",
        "description": "Examination of interaction of Science and Mathematics in the growth of knowledge, and current considerations of literacy.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6225": {
        "name": "EDUC.6225 Education Reform in Science, Technology, Engineering, & Mathematics",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6225/",
        "id": "039579",
        "description": "This blended course explores the ongoing efforts to improve the equity and quality of Science, Technology, Engineering, and Mathematics (STEM) education. By examining a series of STEM education reform efforts form the local, state, and national levels, students will gain a practical and theoretical understanding of both the historical role policy plays in education and its chronic shortcomings. Students will investigate an example of a local example of STEM reform and report on it to the class from a reform perspective. Finally, the educator's role in implementing effective reform in is considered.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6226": {
        "name": "EDUC.6226 Leadership and Research in STEM Education",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6226/",
        "id": "039576",
        "description": "Educators in this course will explore and analyze current research in STEM education, investigate how student performance data informs school and district program decision making, learn how to lead and empower teachers in the mapping of STEM curriculum across grade levels, and develop strategies to develop effective district-wide STEM professional development for K-12 educators.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6227": {
        "name": "EDUC.6227 Foundations of Student Learning in STEM fields",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6227/",
        "id": "039578",
        "description": "This course examines key crosscutting issues that enable STEM teachers to understand how knowledge is obtained and verified. During the course you will explore the theoretical foundations and research that would help you to better understand the nature of cognitive processes, the development of STEM reasoning abilities, and applications for teaching.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6230": {
        "name": "EDUC.6230 School Policy and Law (Formerly 05.623)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6230/",
        "id": "002685",
        "description": "This course will provide students with an understanding of the law and legal basis for making decisions in our public schools. We will analyze court decisions, state and federal constitutional provisions and laws and public policies and regulations as they pertain to the operation of the public schools in the United States. With a solid understanding of the legal framework of governance at the federal, state and local level and the decisions derived though court cases, educators will be better equipped to respond to the numerous challenges and decisions they face throughout the school year.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6231": {
        "name": "EDUC.6231 Policy & Practice in Sci.,Tech.,Eng., & Mathematics  Education (Formerly 04.623)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6231/",
        "id": "002620",
        "description": "This course explores the dynamic relationship between educational policy and classroom teaching.  By comparing the similarities and differences for this relationship within each of these fields, students will gain a practical and theoretical understanding of both the historical role policy plays in education and its chronic shortcomings.  Finally, the educator's role in implementing effective change in these fields is considered.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6240": {
        "name": "EDUC.6240 Assessment of Learning (Formerly 04.624)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6240/",
        "id": "002621",
        "description": "Students examine various approaches to the formative and summative assessment of learning.  This course examines the importance of assessment in planning curricula and individual lessons.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6251": {
        "name": "EDUC.6251 Teaching of Writing (Formerly 06.625)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6251/",
        "id": "002769",
        "description": "The Teaching of Writing examines theories and research in writing instruction at all levels. The course focuses, particularly, on teaching/learning strategies and activities that improve students' writing.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6260": {
        "name": "EDUC.6260 Developments of concepts in Science (Formerly 04.626)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6260/",
        "id": "002622",
        "description": "Students explore the historical development of selected science concepts and the emergence of the philosophy of science. Progress in science is examined together with views of the nature of science.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6270": {
        "name": "EDUC.6270 Second Language Acquisition and Assessment (Formerly 06.627)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6270/",
        "id": "002771",
        "description": "A Study of the general schools of thought that have formed the basis of teaching English as a Second Language.  This course is designed to assist students in conceptualizing the foundations of second language acquisition.  The course will also inform students about appropriate procedures for assessing the skill development of second language learners.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6271": {
        "name": "EDUC.6271 Development of Mathematics Concepts (Formerly 04.627)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6271/",
        "id": "002623",
        "description": "Participants will analyze the nature of mathematics content knowledge and the nature of mathematics process knowledge, as well as the nature and process of knowledge acquisition. A conceptual framework will emerge from the synthesis of existing information.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6280": {
        "name": "EDUC.6280 Reasoning and Problem Solving in Science (Formerly 04.628)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6280/",
        "id": "002624",
        "description": "An analysis of the development of procedural knowledge, with particular emphasis on reasoning and problem solving, as they are currently conceptualized in educational and psychological literature.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6300": {
        "name": "EDUC.6300 Educating Diverse Populations (Formerly 01.630)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6300/",
        "id": "002353",
        "description": "As the world becomes increasingly diverse, educators must be prepared to examine, confront, and manage the factors that affect the education of all children. This course addresses several central issues focusing on how teachers address the problems that confront students who differ from the majority population in language, ethnicity, culture, gender, and sexual orientation. Ensuring that their families and communities are actively involved in the educational process is also an important component of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6301": {
        "name": "EDUC.6301 Reasoning and Problem Solving (Formerly 04.630)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6301/",
        "id": "002626",
        "description": "The course is designed to direct and encourage critical examination of the theory of problem solving.  Students analyze current research literature relating to reasoning, problem solving and critical thinking.  Synthesis of this literature serves as a foundation for examining curriculum decisions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6302": {
        "name": "EDUC.6302 Education Policy and Law (Formerly 05.630)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6302/",
        "id": "002691",
        "description": "The course provides students in the Ph.D. in Leadership in Education the opportunity for in-depth consideration of fundamental questions, seminal research, and theoretical perspectives related to education policy at all levels. Students who successfully complete this course will be able to explain major theoretical and legal perspectives in education policy research; discuss contemporary trends in education policy and law at state and federal levels; and identify key social, political, and economic factor that influence education policy and law.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6320": {
        "name": "EDUC.6320 The Inclusive School (Formerly 01.632)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6320/",
        "id": "037813",
        "description": "School leaders must create environments that are welcoming to all students and their families and that capitalize on the strengths students bring to the learning environment as well as address the needs of students.  As the population of students in our schools has continued to become more diverse, building an inclusive environment in which all are valued and in which all student can succeed has become increasingly complex.  Participants in this course will explore their values and beliefs as well as the dominant culture and prevailing belief systems present in the majority of today's public schools.  Participants will learn about ways in which many students, their families, and their communities may differ from this dominant culture, and the possible effects of this mismatch.  Through readings and interactive discussions, participants will examine ways to build a school culture that is inclusive for all students and their families.  Participants will develop detailed plans of action to actively and meaningfully involve parents and community members in all aspects of the school.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6350": {
        "name": "EDUC.6350 Dynamics of Curricular Change (Formerly 04.635)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6350/",
        "id": "002631",
        "description": "This course considers alternative perspectives of curriculum and explores issues and strategies involved in the process of changing the curricular visions and practices of schools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6360": {
        "name": "EDUC.6360 Sociocultural Contexts of Educational Communities (Formerly 01.636)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6360/",
        "id": "002356",
        "description": "Examines the social, cultural and political forces that shape the educational environment and provide context for teaching and learning. The existing and desired relationships among schools, families, and communities will be discussed.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6370": {
        "name": "EDUC.6370 Historical and Contemporary Perspectives on Curriculum",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6370/",
        "id": "002633",
        "description": "This course focuses on developing a knowledge base of historical and contemporary perspectives on curriculum and schooling as they evolved in American society.  The first part of the course addresses three concepts as they relate to curriculum.  They are: 1.) School, literacy and society. 2.) Movements in schooling and 3.) Dimensions of diversity.  The second part of the course addresses an examination of conflicting views on selected issues, identifying related underlying problems, and then developing feasible resolutions.  The assignments consist of textbook and library readings as well as the writing of 5 reflection papers during the 10 week course.  Students' final work will be submitted in a portfolio at the end of the semester for faculty evaluation and grading.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6380": {
        "name": "EDUC.6380 Curriculum Design K-12 (Formerly 04.638)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6380/",
        "id": "002634",
        "description": "A review of state mandates which, by law, shape the curriculum of the school.  Examination of \"new\" curricula and their sources, as well as the development of a rationale for curriculum design and an evaluation of the personnel and techniques by which these curricula can be developed.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6381": {
        "name": "EDUC.6381 Planning, Technology and School Improvement (Formerly 05.638)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6381/",
        "id": "002699",
        "description": "This course helps educators develop a broad grasp of the educational possibilities and concerns the Internet raises, for K-12 educators as well as those in higher education.  Through the course, students develop in-depth knowledge of Internet resources and problems related to a specific issue of professional interest.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6410": {
        "name": "EDUC.6410 Issues in Staff Development (Formerly 05.641)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6410/",
        "id": "002702",
        "description": "Includes understanding of how to work with adult learners who are peers, as well as techniques for assessing staff needs, design of programs to improve staff performance and strategies to ensure productive in-service education.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6411": {
        "name": "EDUC.6411 Fostering a Learning Organization in Higher Education (Formerly 01.641)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6411/",
        "id": "002360",
        "description": "This course will explore approaches to employee engagement and professional development. Organizational learning and adult learning theories will be introduced as mechanisms for delivering effective practices in the planning, design, and implementation of (1) employee knowledge, competency, and capacity-building practices and programs and (2) strategies for fostering a learning organization.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6421": {
        "name": "EDUC.6421 Principles of Supervision (Formerly 05.642)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6421/",
        "id": "002703",
        "description": "This course is designed to help current and aspiring supervisors explore the skills,knowledge and personal attributes central to instructional leadership and supervision. A paradigm shift away from an historical/traditional view of supervision towards a more collegial model is emphasized. Students will complete field work including two observations of a colleague and pre and post-lesson conferences.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6423": {
        "name": "EDUC.6423 Program Evaluation (Formerly 07.642)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6423/",
        "id": "002829",
        "description": "Evaluation tasks will be identified and the policy issues attendant to evaluation will be examined. Students will identify and discuss several models of program evaluation, understand what needs to be considered and addressed in needs assessment, and learn to identify an appropriate design for a new evaluation. Students will be expected to conduct program evaluation, present their ideas and illustrate how evaluation results can be useful for program decision making.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6430": {
        "name": "EDUC.6430 The Skillful Teacher (Formerly 04.643)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6430/",
        "id": "002639",
        "description": "This course is designed to help teachers and educational leaders view teaching from a reflective stance.  Video material of teaching situations will be examined for the application of skills discussed in the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6431": {
        "name": "EDUC.6431 Principalship PK - 12 (Formerly 05.643)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6431/",
        "id": "002704",
        "description": "This course is designed to help aspiring principals explore the skills,knowledge and personal attributes central to effective leadership. The course aims to acquaint students with research, theories,and frameworks from the knowledge base on school leadership; explore the issues,daily experiences, and decisions of the principal within the action context of the school; assist students to think critically and systematically about leadership; help students become more conscious of their own values,assumptions and purposes as school leaders; further develop leadership skills,insight,and vision for schooling; assist students to think of themselves as educators for transformation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6440": {
        "name": "EDUC.6440 Foundations for Practitioner Scholars (Formerly 01.644)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6440/",
        "id": "039453",
        "description": "This course will introduce students to seminal and recent work in the fields of philosophy, history, and psychology as they relate to education. Students will critically examine research and scholarly theory in these fields and their relationship to PK-12 Practice.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6441": {
        "name": "EDUC.6441 Models of Teaching (Formerly 04.644)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6441/",
        "id": "002640",
        "description": "This course will investigate researched-based instructional models that have been proven to facilitate learning in any academic content area. Each model addresses academic content as well as attainment of instructional goals and objectives. All models support the 21st learner by focusing on the needed skills for school, life and work. This course will benefit teachers who teach at any grade level.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6450": {
        "name": "EDUC.6450 Perspectives and Visions in Education I (Formerly 01.645)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6450/",
        "id": "002363",
        "description": "Open to matriculated doctoral candidates only.  This foundational course provides new doctoral students with an understanding of differing perspectives on the purpose of public education in the United States during the last 150 years.  The philosophical and political perspectives which influenced educational reform during this period will be examined.  The course will culminate in reading and discussion of contemporary visions for schooling.  This course must be taken before 01.646.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6451": {
        "name": "EDUC.6451 Directed Study Curriculum and Instruction (Formerly 04.645)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6451/",
        "id": "002641",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6460": {
        "name": "EDUC.6460 Perspectives and Visions in Education II (Formerly 01.646)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6460/",
        "id": "002364",
        "description": "This course examines how psychology and education have been intertwined throughout the history of American education.  Various psychological perspectives for educational practice will be considered.  The role of research in education, including the use of psychological research methods will be considered as you begin preparing to conduct educational research.  Visions of educational psychologists for utilizing psychological research findings in creating future educational practice and policies will also be explored.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EDUC.6450 Persp & Visions of Schooling I.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6450"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6490": {
        "name": "EDUC.6490 Directed Study: Administration (Formerly 05.649)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6490/",
        "id": "002710",
        "description": "Through frequent consultation with the instructor, the student will investigate and define a problem for research and will present the findings in a significant paper.  The directed study may not be substituted for a required course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6501": {
        "name": "EDUC.6501 Capstone Project: Advanced Programs (Formerly 04.650)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6501/",
        "id": "002645",
        "description": "Students will have the opportunity to develop a teacher work sample consisting of work in six major areas:  (1) contextual factors, (2) learning goals, (3) assessment plan, (4) design for instruction, (5) analysis of student learning, and (6) reflection.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req:  M.Ed. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6502": {
        "name": "EDUC.6502 Educational Reform (Formerly 05.650)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6502/",
        "id": "002711",
        "description": "Addresses the way in which an instructional leader initiates changes in organizations-whether curricular or in the systems which make organizations function.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6510": {
        "name": "EDUC.6510 Web-based Tech. in the Learning Environment:Teaching and Learning (Formerly 03.651)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6510/",
        "id": "002512",
        "description": "Students will research, discuss and examine web-based educational technologies and the pedagogical practices associated them. We will also interrogate the way that these technologies and their requisite literacies have changed, are changing and will change the nature of institutional instruction. In addition, we will investigate the policy implications that arise from the existence of these technologies. This course is taught online. It is suitable for students at the Masters, Ed.S or Doctoral level.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6511": {
        "name": "EDUC.6511 Transformative Leadership in Education (Formerly 05.651)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6511/",
        "id": "002712",
        "description": "This course considers ways in which school leaders can facilitate transformative change in all aspects of education. Focusing on theory, research, and pragmatic strategies, the course examines approaches to educational design and redesign for educational institutions undergoing significant change.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6520": {
        "name": "EDUC.6520 Change and Conflict in Higher Education (Formerly 05.652)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6520/",
        "id": "002713",
        "description": "Examines theories in the changing process, strategies for effective adoption and implementation of innovations and conflict resolution.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.6110 Introduction to Higher Education Administration.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6110"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6530": {
        "name": "EDUC.6530 Capstone Alternative (Formerly 04.653)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6530/",
        "id": "039338",
        "description": "This Capstone Alternative is the culminating course for students who are not in regular PK-12 classroom settings, particularly those who are in the Autism Studies program. Candidates in this course will apply information that they have learned during their coursework to an action research project in a classroom or small group setting. In addition, candidates will develop a professional portfolio with products developed during coursework.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6540": {
        "name": "EDUC.6540 Student Development & Leadership in Higher Education (Formerly 08.654)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6540/",
        "id": "002852",
        "description": "This course will examine the role of higher education in creating leaders for a diverse and democratic society Grounded in student development theory and practice, this course will engage participants in reflective and critical exploration of leadership theories, frameworks, concepts and skills that focus on social justice and purposeful change.  The course is designed to provide foundational grounding in the study of leadership theory and research, with a focus on the leadership paradigms emphasizing transformation, collaboration and empowering group members in an effort to improve the world in which we live.  During this course you will read current ideas about student development and the nature of leadership, you will engage in class activities and assignments which challenge you to think critically with multiple perspectives and frameworks and you will undertake a self-examination about who you are and what you believe as someone who will facilitate student development and leadership in student affairs and within higher education.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6550": {
        "name": "EDUC.6550 Directed Study Curriculum and Instruction (Formerly 04.655)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6550/",
        "id": "002649",
        "description": "Through frequent consultation with the instructor, the student will investigate and define a problem for research and will present the findings in a significant paper. The directed study may not be substituted for a required course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6560": {
        "name": "EDUC.6560 Ed.S Seminar (Formerly 04.656)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6560/",
        "id": "002650",
        "description": "Candidates undertake an in-depth study of issues pertinent to PK-12 education and develop a product to address these issues.  Candidates must complete 24 credits prior to registering for the Ed.S Seminar.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.S. Matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6571": {
        "name": "EDUC.6571 Readers Responses to Literature (Last Term 2009 Spring)(Formerly 06.657)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6571/",
        "id": "002792",
        "description": "An in-depth study of theory and research on the work in readers' responses to literature.  Attention is given to past findings and methodologies as well as to future research in this area.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6580": {
        "name": "EDUC.6580 Role of the Curriculum and Instructional Leader (Formerly 05.658)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6580/",
        "id": "002715",
        "description": "This course provides prospective leaders with the theoretical and empirical bases for understanding the instructional core and how to create the conditions needed for high quality teaching and learning to occur in their schools. Course participants will explore how to (i) establish a vision that promotes high standards for learning and is shared by all stakeholders; (ii) promote a positive school culture that is anchored in professional behavior and trusting relationships; (iii) promote effective instructional programs and the application of best practices to student learning; (iv) make decisions grounded in reliable data integrity, fairness, and ethical conduct.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Requisite: M.ED and Ed.S matriculated only, or Permission of the Instructor.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6590": {
        "name": "EDUC.6590 Strategies for Instruction in Higher Education (Formerly 08.659)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6590/",
        "id": "002855",
        "description": "A variety of theories, methods and multi-media techniques of teaching will be explored in order to familiarize students with the many options available to facilitate learning by adults",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6600": {
        "name": "EDUC.6600 Ethnographic Inquiry (Formerly 07.660)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6600/",
        "id": "002835",
        "description": "This course provides the theoretical underpinnings of the nature, principles and processes of ethnographic research which focuses on the understanding of human cultures.  Students will study how an ethnographic research project is developed and will conduct an aspect of a study during the semester.  There will be particular emphasis on collecting and analyzing data in ethnographic research.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6601": {
        "name": "EDUC.6601 Diversity in Higher Education 08.660)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6601/",
        "id": "002856",
        "description": "Focuses on the preparation, admission, retention, and achievements of minorities in higher education, both past and present.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6701": {
        "name": "EDUC.6701 Practicum I: Higher Education Option (Formerly 08.670)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6701/",
        "id": "038127",
        "description": "The Practicum I: Higher Education is the first of two culminating requirements for those students striving to earn the M.Ed. in Education Administration: Higher Education Option.  Practicum I and II require students to engage in a project that demonstrates the practical application of their knowledge and skills in real-life higher education leadership activities and responsibilities over the course of two semesters; both semesters involve significant leadership work in partnership with a supervisor/mentor in an appropriate higher education site.  Selection of the focus and scope of the project will be tailored to students area of focus in the Higher Education Option and their current work responsibilities.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req:  M.Ed. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6710": {
        "name": "EDUC.6710 Practicum II: Higher Education (Formerly 08.671)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6710/",
        "id": "038343",
        "description": "Practicum II: Higher Education is the second in the series of two culminating requirements for those students striving to earn the M.Ed. in Education Administration: Higher Education Option. Similar to Practicum I (08.670), Practicum II (08.671) requires students to engage in the continuation of the project form Capstone I that demonstrates the practical application of their knowledge and skills in real-life higher education leadership activities and responsibilities over the course of the semester. Both Practicum semesters involve significant leadership work in partnership with a supervisor/mentor in an appropriate higher education site. Practicum II content will be tailored to students' area of focus in the Higher Education Option and their current work responsibilities.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.6701 Practicum I: Higher Ed.Option",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6701"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6733": {
        "name": "EDUC.6733 Ethics and Decision-Making in Higher Education",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6733/",
        "id": "040359",
        "description": "This course will explore ethical theories and their application to higher education. The course will rely heavily on in class discussion and learning from all participants: faculty and students. A case study approach will be used in order for students to gain hands-on experience dealing with ethical issues that arise in the Higher Education setting.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6740": {
        "name": "EDUC.6740 Research into Learning in Science (Formerly 04.674)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6740/",
        "id": "030756",
        "description": "In this course, we shall be reading research articles and examining how the research was carried out. You will conduct an \"action research\" project. Those who engage in action research have a commitment to bring about change. In this case, you will be investigating something in your own classroom or school that concerns you and therefore the results of your research will help you to think about what might be done to change the situation. Through the collection and sorting of data we can gain insights into situations that were previously muddy. Teachers often have to make judgments based on experience, but this is not persuasive to outsiders. With data we can convince others that the course of action we choose is justified.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6750": {
        "name": "EDUC.6750 Leadership in Science Education (Formerly 04.675)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6750/",
        "id": "030757",
        "description": "There are many issues in science education that can be clarified as a result of reading current literature and engaging in discussion with other teachers. In this course, we will examine some of the most pressing issues that face us as science teachers e.g. What is science literacy?  What role should inquiry play in a science curriculum?  What is the role of technology in science education? Is ability grouping appropriate for learning in science?  Each week we will examine a different issue and share our expertise, as we explore what it means to be a leader in science education.  You will share your own science teaching expertise by developing an article to be submitted to an NSTA publication via a peer review process.  Additionally, you will put your program learning into practice and will be assessed through written evidence captured in a professional portfolio.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6751": {
        "name": "EDUC.6751 History, Theory, & Contemporary Issues in Lang, Literacy & Culture (Formerly 06.675)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6751/",
        "id": "031880",
        "description": "The purpose of this course is to engage students in the complexities and debates regarding theoretical perspectives and research on language, literacy, and culture that have affected language and literacy learning.  This course will begin with introduction to the history of research done on concepts of language, literacy and culture.  Students then look at the evolution of sociolinguistic and stenographic research language, literacy and culture as well as other modes of inquiry on language and literacies.  Most of the course is spent closely examining studies for how they conceptualize the mutual construction of language, literacy, and culture, and for what they can tell use about the nature of literacy learning.  In addition, students will explore the questions those studies raise such as cultural diversity,identity, learning, curriculum and instruction school-community relationships and social justice in literacy and language learning.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6760": {
        "name": "EDUC.6760 Exploring the Nature of Science (Formerly 06.676)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6760/",
        "id": "030758",
        "description": "If you were asked to describe the characteristics of science what would you say and would you know whether professional scientists agree with you?  National professional societies such as the NSTA and the AAAS, believe that if middle and high school students understand how science has been and is practiced, they will be more likely to question their own thinking, recognize the power of scientific theories and understand that there are no absolute truths.  This course will take you on an exploration of some fascinating discoveries in the history of science, engage you in debate about controversial issues in science, and involve you in raising your own scientific questions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6761": {
        "name": "EDUC.6761 History, Theory, and Research in the Teaching of Writing (Formerly 06.676)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6761/",
        "id": "032981",
        "description": "This course covers the history of the teaching of composition from the ancient Greeks to the present day, the development of both theory and pedagogy, and the current research into how writers learn, which teaching methods work best, and which issues continue to be of concern.  Students will learn to critique writing pedagogy, to place programs and issues into historical perspective, and to analyze and design research into the teaching of writing.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6770": {
        "name": "EDUC.6770 Theories of Verbal Communication (Formerly 06.677)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6770/",
        "id": "033001",
        "description": "The course will examine various theories and models of verbal communication appropriate for study in the Language Arts and Literacy.  The specific theories and models will be determined each semester.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6780": {
        "name": "EDUC.6780 History, Research and Contemporary Issues in Reading Instruction (Formerly 06.678)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6780/",
        "id": "033002",
        "description": "Students will trace the history of reading instruction in the United States from The New England Primer in the 1600s to the present with special attention to the ways in which those milestones may have impacted reading instruction today.  Each of the key philosophical orientations to reading instruction will be explored from the point of view of the research that informs that instruction.   Contemporary issues in reading instruction will be examined with ties to both the research and the history. Contemporary issues will be drawn from, but not limited to, politics, curriculum design, instructional materials, and instructional design.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6900": {
        "name": "EDUC.6900 Action Research",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6900/",
        "id": "002524",
        "description": "Action Research is the culminating course for all students who are in the M.Ed program in Curriculum and Instruction, including those in PK-12 classroom settings, those who are in the Autism Studies program, educators who are not currently in a classroom, and those who are in informal educational settings. Educators in this course will apply knowledge that they have learned during their coursework to an action research project plan for a classroom or small group setting.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Matriculated in M.Ed. Curriculum and Instruction degree program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6910": {
        "name": "EDUC.6910 Developing Inclusive School Contexts (Formerly 05.691)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6910/",
        "id": "039448",
        "description": "This course will introduce students to theory and research about structural inequities, barriers to education, and promising practices for addressing these barriers. Students will examine theory and research and implications for practice in PK-12 Leadership.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6911": {
        "name": "EDUC.6911 Applied Research Design (Formerly 07.691)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6911/",
        "id": "039451",
        "description": "This course is designed to provide PK-12 practitioners with an understanding of the principles of research design and the ethical responsibilities of conducting a research study. Participants will learn a broad range of research methodology approaches that can be applied to problems of practice. Participants will become skilled at reading, evaluating, and judging the trustworthiness of studies using different methodology approaches. They will design a practitioner-oriented research study.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6920": {
        "name": "EDUC.6920 Law, Policy, and Finance (Formerly 05.692)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6920/",
        "id": "039447",
        "description": "In this course students will examine scholarship and research in the areas of law, policy and finance as these affect educational practice. They will analyze law, policy and finance and its implications for leaders in PK-12 schools and school systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6921": {
        "name": "EDUC.6921 Quantitative Data Analysis for Practitioner Leaders (Formerly 07.692)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6921/",
        "id": "039530",
        "description": "The primary focus of this course is to prepare practitioner leaders to understand, interpret, and analyze quantitative data as it relates to their identified problem of practice.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6922": {
        "name": "EDUC.6922 Qualitative Research Methods Practitioner Leaders",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6922/",
        "id": "041817",
        "description": "This is the first in a two-part sequence of courses that will introduce students to the scope of issues, techniques, and perspectives that compose qualitative research methodology. In this first course students will be introduced to historical, philosophical, and theoretical issues undergirding the approach, principles of research design, data collection techniques, and approaches for preliminary organization of the data. Students will also be introduced to literature and technologies of the field.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.6910 Developing Inclusive School Co, and EDUC.6911 Applied Research Design: Intro, and EDUC.6940 Systems Leadership, and EDUC.6440 Foundations for Practitioner S, or EDUC.6227 Foundations of Student Learning in STEM Fields for STEM Option.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6910"
                ],
                [
                    "EDUC.6911"
                ],
                [
                    "EDUC.6940"
                ],
                [
                    "EDUC.6440",
                    "EDUC.6227"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6930": {
        "name": "EDUC.6930 Organizational Learning (Formerly 05.693)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6930/",
        "id": "039446",
        "description": "This course will introduce students to research and theory in the field of organizational learning and its application to PK-12 practice. Students will study the origins, evolution and contemporary findings of research in this field. Students will explore the practical implications of organizational learning for PK-12 leadership.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6931": {
        "name": "EDUC.6931 Data Analysis for Practitioner Leaders (Formerly 07.693)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6931/",
        "id": "039449",
        "description": "This course is designed to provide second year EdD students opportunities to learn how experts in the field are applying principles of improvement science to address educational problems--particularly those related to equity. At the end of the course, students are expected to demonstrate how they will apply improvement science methods to address a persistent educational problem in their own school or system contexts.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.6922 Qualitative Research Methods Practitioner Leaders.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6922"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.6940": {
        "name": "EDUC.6940 Systems Leadership I (Formerly 05.694)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6940/",
        "id": "039445",
        "description": "Drawing on organizational, management, and educational scholarship, this course introduces students to concepts and practices associated with strategic systems leadership. Students will apply their understandings of how to leverage both formal and informal sources of influence in their analysis of relevant teaching cases and the data they collect in an extensive field study project.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6950": {
        "name": "EDUC.6950 Systems Leadership II (Formerly 05.695)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6950/",
        "id": "039443",
        "description": "building on the core concepts and practices introduced in Systems Leadership I, this course focuses specifically on how effective leaders use data to understand and address the challenges of their operation environment. Importantly, the course focuses on not only the technical knowledge and skills leaders need to use data as a lever for improvement at scale, but on the adaptive leadership skills required for meaningful systems change.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6960": {
        "name": "EDUC.6960 Strategic Partnering with Families and Communities (Formerly 05.696)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6960/",
        "id": "039444",
        "description": "This course will critically examine the variety of issues associated with partnering with parents, families and community organizations. Through analysis of theory, research and collective knowledge, doctoral students will learn how to strategically engage parents, families and community organizations and recognize the different forms of engagement. This course will emphasize collaborative strategies that \"shares power\" with key stakeholders in U.S. schools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6980": {
        "name": "EDUC.6980 Research Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6980/",
        "id": "041717",
        "description": "The goal of the Research and Program Evaluation program's Research Seminar is to provide advisement, develop a sense of professional community among Ph.D. students and faculty in the program, and assist students to develop the \"soft skills\" of academia-including how to make professional presentations and deliver academic critique.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "Must be matriculated in the Ph.D Education, and Research and Evaluation Option program.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6990": {
        "name": "EDUC.6990 Doctoral Research Seminar (Formerly 07.699)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6990/",
        "id": "039455",
        "description": "This seminar, for all doctoral students and faculty in the Research and Program Evaluation Ph.D. program gives students the opportunity to learn about research and evaluation practice directly from faculty and other students speaking about their research and evaluation experiences. Students will learn how to: understand research and evaluation presentations; ask educated questions and make substantive suggestions and comments about research; and create and deliver a presentation of their research evaluation projects.",
        "credits": {
            "min": "0",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6991": {
        "name": "EDUC.6991 Reading and Applying Educational Research",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6991/",
        "id": "041899",
        "description": "This course is designed to build student capacity for evidence-based decision making in K-12 schools. Specifically, it will advance student ability to locate educational research, evaluate it for quality, extract findings, and apply those findings to practice. Critically, the process of applying research to practice will consider local context and draw on stakeholder experiences, weaving them together with scholarship to develop school improvement plans.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: Ed.D. matriculated only",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.6999": {
        "name": "EDUC.6999 Reading and Critiquing Educational Research",
        "url": "https://www.uml.edu/catalog/courses/EDUC/6999/",
        "id": "041241",
        "description": "This course, with its focus on educational leadership research, will help you locate different kinds of educational research, understand the basic format of various genres of research, read educational research, and efficiently extract findings and results. It will also help you critique educational research. This course will also prepare you to interpret methodological approaches, to examine the coherence of those approaches, to identify potential threats to validity, and to distinguish high-quality work from that which is merely competent.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.6460 Perspectives and Visions of Schooling II.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6460"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7000": {
        "name": "EDUC.7000 Introduction to Research Design and Methods (Formerly 07.700)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7000/",
        "id": "037812",
        "description": "In this course students will be introduced to: Principles of research design in social sciences; Understanding how to plan for research using quantitative and/or qualitative data collection methods; Ethics of research conduct; Understanding and preparing for the Institutional Review board (IRB) process; Evaluating the trustworthiness of research; How to critically review research; The historical and philosophical issues undergirding qualitative research; Paradigms; Sampling procedures; Types of measurement error; Methodologies appropriate for educational research; Recent developments in education research.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7002": {
        "name": "EDUC.7002 Conducting Research in Literacy Studies l",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7002/",
        "id": "039974",
        "description": "This course provides doctoral students prior to their dissertation research with an opportunity to develop a research proposal through an intensive literature review, writing and discussions. Based on a solid understanding of current research trends on literacy, culture and communication students will identify research questions and articulate theoretical perspectives that frame their research. Developing research design and analysis tools will also be a core element of this course as a part of the students; research proposals. Students will go through IRB application using the proposal developed in this course to actually conduct their research in the next semester.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7010": {
        "name": "EDUC.7010 Cognitive & Info Processing Theories of Learning, Dev & Inst (Formerly 01.701)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7010/",
        "id": "002369",
        "description": "This course covers the fundamentals of human memory and cognition. In addition to modern memory theory, imagination, problem solving, invention, complex learning and complex skills performance will be explored.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7011": {
        "name": "EDUC.7011 Pilot Study (Formerly 05.701)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7011/",
        "id": "036763",
        "description": "Pilot Study One Credit provides the student with a seminar experience for the development of a pilot study. This course is intended for the student who anticipates taking one or two additional semesters to complete the pilot study. Successful completion of a written pilot study is required for continued progress in the degree program.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7012": {
        "name": "EDUC.7012 Data Analysis (Formerly 07.701)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7012/",
        "id": "002836",
        "description": "Prereqisite: A descriptive statistics or research methods course satisfactory to the Program Faculty.  This course covers basic statistics used in the analysis of educational research.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.7000 Introduction to Research Design and Methods",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.7000"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7014": {
        "name": "EDUC.7014 Conducting Research in Literacy Studies ll",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7014/",
        "id": "039905",
        "description": "This course will focus on the actual conduct of a research project. It may not be possible to complete a research project (data collection and analysis) in a single semester; however, some important aspects of a research project are expected, such as sample data collection using the research instruments developed in the previous semester, ongoing analysis and preliminary findings. Students are expected to receive approval from the IRB prior to the course and will begin data collection as soon as the semester begins.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7020": {
        "name": "EDUC.7020 Research Methods and Design (Formerly 07.702)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7020/",
        "id": "002837",
        "description": "Methods of data collection suitable for answering a variety of educational research questions.  Considers both qualitative and quantitative strategies for research and evaluation needs. Prerequisite: 07.701 or acceptable substitute.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req:  07.701Data Analysis.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7021": {
        "name": "EDUC.7021 Pilot Study (Formerly 05.702)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7021/",
        "id": "036764",
        "description": "Pilot Study Two Credits provides the student with a seminar experience for the development of a pilot study. This course in intended for the student who was previously enrolled in EDUC.7011 and anticipates completing the pilot study by the en of the semester. Successful completion of a written pilot study is required for continued progress in the degree program",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7030": {
        "name": "EDUC.7030 Pilot Study (Formerly 05.703)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7030/",
        "id": "036765",
        "description": "Pilot Study Three Credits provides the student with a seminar experience for the completion of a pilot study. This course is intended for the student who anticipates completing the pilot study by the end of the semester and who has not previously enrolled in EDUC.7011 or 7021. Successful completion of a written pilot study is required for continued progress in the degree program.",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7040": {
        "name": "EDUC.7040 Qualitative Research Methods (Formerly 07.704)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7040/",
        "id": "002839",
        "description": "This course concentrates on the use of qualitative methods for educational research.  Strategies for conducting qualitative studies are described and techniques for analyzing and reporting findings are emphasized. Students will also examine strategies for the ethical conduct of qualitative research.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7050": {
        "name": "EDUC.7050 Survey Research (Formerly 07.705)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7050/",
        "id": "002840",
        "description": "Focusing on survey research methods, this course will familiarize students with the strategies, techniques, tactics, and issues in developing and administering questionnaires and interviews.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC 7000 Intro.Research Design and Meth., EDUC 7012 Data Analysis and Academic. Ed.D. and Ph.D. Education Matriculated Only.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.7000"
                ],
                [
                    "EDUC.7012"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7054": {
        "name": "EDUC.7054 Introduction to Higher Education Research",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7054/",
        "id": "040679",
        "description": "This course offers a critical examination of the research designs, paradigms, and methods used by scholars in the field of higher education. Students will be introduced to classic and contemporary research questions, traditional and alternative research methods, and frequently used resources in higher education scholarship.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7060": {
        "name": "EDUC.7060 Intermediate/Advanced Data Analysis (Formerly 07.706)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7060/",
        "id": "002841",
        "description": "Mixed methods research and evaluation uses both quantitative and qualitative data and information to answer research and evaluation questions.  Mixed methods research and evaluation integrates these two general methodologies to design more complete and powerful scholarship and produce more informative answers to research,  instructional, and educational questions of both the formative and the summative kind.  These questions may be research hypotheses, instructional program effects, or educational program and policy evaluations.  This course is designed to meet the needs and goals of the students who enroll in it and is conducted by a learning contract model.  Advanced univariate and multivariate design and statistical techniques will be selectively covered, including: meta-analysis, instrument design and development.  It includes various qualitative techniques and analytical models, such as development and use of protocols, interviewing, content and discourse as well as text analysis, analytic and observational scoring procedures and systems, document analysis, policy analysis.  Scholarly text development such as histories, white papers, or professional literature reviews will be included.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7070": {
        "name": "EDUC.7070 Writing for Professional Publication (Formerly 07.707)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7070/",
        "id": "002842",
        "description": "In this course students will learn about the processes and the resources relevant to writing, publishing and presenting manuscripts for professional journals and conferences. There will be an emphasis on student-developed work based upon relevant topics in the students field of study.  Instructor permission required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7082": {
        "name": "EDUC.7082 Introduction to Discourse Analysis",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7082/",
        "id": "040415",
        "description": "Discourse analysis has been increasingly used as a basic analytic tool of qualitative research. This research methods course focuses on the use of language in society at the level of multiple interlocutors and contexts. This course is by nature interdisciplinary, and the goal is to provide graduate level students in all disciplines with practical guidelines to doing discourse analysis in qualitative research and mixed methods research.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7090": {
        "name": "EDUC.7090 Measurement & Evaluation (Formerly 07.709)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7090/",
        "id": "002844",
        "description": "Basic measurement and evaluation theories and techniques are surveyed, including achievement, attitudes, opinions, abilities, personality, skills and trait variables. Emphasis is given to methods of establishing reliability and validity of various measures.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7101": {
        "name": "EDUC.7101 Qualitative Research: Advanced Topics in Analysis",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7101/",
        "id": "039828",
        "description": "Students will examine selected cutting-edge topics in the field of qualitative research. They will become familiar with key journals in the field of qualitative research. Students are expected to research and write about a self-selected topic in the field of qualitative research methodology. The course stresses the skills of methodological literature review and professional academic writing.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.7040 Qualitative Research Methods.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.7040"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7110": {
        "name": "EDUC.7110 Research Experience \nResearch Experience",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7110/",
        "id": "039916",
        "description": "The goals of Research Experience are to provide students in the Research and Evaluation in Education Program with mentored experience in a hands-on research project. Appropriate research experiences are those that allow the students opportunities to increase their skills, Knowledge, and experiences in the program goal areas. Students will work approximately 10 hours a week on the designated research project, meeting a minimum of 1 hour per week with the research mentor.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.7000 Intro to Research Methods, and EDUC.7012 Data Analysis, and EDUC.7040 Qualitative Research Methods, EDUC.6423 Program Evaluation, or EDUC.7420 Foundations of Program Evaluation. Permission of Instructor Required.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.7000"
                ],
                [
                    "EDUC.7012"
                ],
                [
                    "EDUC.7040"
                ],
                [
                    "EDUC.6423",
                    "EDUC.7420"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7130": {
        "name": "EDUC.7130 Research Writing Seminar",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7130/",
        "id": "039917",
        "description": "this course provides participants with an opportunity to hone their writing skills in the humanities and social sciences, learn more about the process of academic publishing, and become familiar with the requirements of journals most relevant to their work. Students will develop a manuscript for publication, building general skills for academic writing across genres. In addition to being fully online, this course is individualized and flexible to meet students' needs and goals. It is required for Research and Evaluation in Education students and open to all other doctoral students at UMass Lowell.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7290": {
        "name": "EDUC.7290 Directed Study-Doctoral Education (Formerly 05.729)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7290/",
        "id": "002729",
        "description": "Participants will develop a focused line of investigation with the supervision of a faculty member in the college.  Approval of advisor is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7291": {
        "name": "EDUC.7291 Directed Study: Language and Literature (Formerly 06.729)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7291/",
        "id": "002806",
        "description": "Students will work on individually designed projects in language arts and literacy in close cooperation with a faculty member.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7292": {
        "name": "EDUC.7292 Directed Study: Mathematics and Science Education (Formerly 04.729)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7292/",
        "id": "002662",
        "description": "Participants will develop a focused line of investigation with the supervision of a faculty member in the college. Approval of advisor is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7420": {
        "name": "EDUC.7420 Foundations of Program Evaluation",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7420/",
        "id": "039915",
        "description": "In this course the following topics will be considered: Fundamentals of Evaluation Theory; Evaluating Evaluation Approaches and Models: Explication and Application of Specific Models; Evaluation Design; Evaluation Ethics; Evaluation Procedures; Meta-evaluation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7430": {
        "name": "EDUC.7430 Program Evaluation: Advanced Topics",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7430/",
        "id": "039829",
        "description": "This course will further your knowledge of program evaluation by focusing on such topics as: Assessing the need for program evaluation; Working with stakeholders; Identifying, measuring and monitoring outcomes; Assessing impact; Social context of evaluation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.6423 Program Evaluation.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.6423"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7440": {
        "name": "EDUC.7440 Program Evaluation and Public Policy",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7440/",
        "id": "039914",
        "description": "The focus of this course includes: The relationship between evaluation and educational policies; Standards-Based evaluation; Responsice Evaluation; Evidence Based Evaluation; cost Benefits Analysis Evaluation; Large Scale Evaluations: Issues in Planning; Large Scale Evaluations:Analyses; Evaluation of Public Programs and Related Policy; Utilization of Findings in Policy.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.7430 Program Evaluation in Practice.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.7430"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7501": {
        "name": "EDUC.7501 Dissertation in Practice",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7501/",
        "id": "040891",
        "description": "Ed.D. students will design their study, complete their proposal, conduct their study and defend their dissertation in practice, while enrolled in dissertation credit. This course is for ED.D. cohort students only.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7502": {
        "name": "EDUC.7502 Dissertation in Practice: Data Collection and Analysis",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7502/",
        "id": "041108",
        "description": "In this second course of the EdD dissertation course series, students will collect and analyze data with the support of the course instructor.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EDUC.7501 Dissertation in Practice.",
        "requirements": {
            "prerequisites": [
                [
                    "EDUC.7501"
                ]
            ],
            "corequisites": []
        }
    },
    "EDUC.7503": {
        "name": "EDUC.7503 Dissertation in Practice: Dissertation Completion",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7503/",
        "id": "041109",
        "description": "In this final course of the EdD program students formally report on their data in a written dissertation that they defend at the end of the semester.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7530": {
        "name": "EDUC.7530 Doctoral Dissertation/Education (Formerly 05.753)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7530/",
        "id": "002736",
        "description": "Doctoral candidates who have passed both the Pilot Study Proposal/Defense and the Pilot Study may register for this course. Candidates work with their chair and/or a committee member to advance their research. Permission of instructor is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7531": {
        "name": "EDUC.7531 Doctoral Dissertation/Education (Formerly 06.753)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7531/",
        "id": "002812",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7532": {
        "name": "EDUC.7532 Doctoral Dissertation/Education (Formerly 04.753)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7532/",
        "id": "002665",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7560": {
        "name": "EDUC.7560 Doctoral Dissertation/Education (Formerly 05.756)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7560/",
        "id": "002737",
        "description": "doctoral candidates who have passed both required doctoral examinations (Comprehensive/Qualifying examinations) may register for dissertation credit. Candidates work with their chair and/or a committee member to advance their research. Part time candidates who wish to register for 6 credits of dissertation study in one semester must gain the permission of the instructor.",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7590": {
        "name": "EDUC.7590 Doctoral Dissertation/Education (Formerly 05.759)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7590/",
        "id": "002738",
        "description": "Doctoral candidates who have passed both required doctoral examinations (comprehensive/Qualifying examinations) may register for dissertation credit. Candidates work with their chair of a committee member to advance their research. Only, full-time candidates, including TAs and RAs, and international students may register for 9 credits of dissertation study. Permission of Instructor is required.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7600": {
        "name": "EDUC.7600 Dissertation Research (Formerly 05.760)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7600/",
        "id": "035285",
        "description": "Doctoral candidates must be  enrolled in this course if they have completed their required dissertation research and wish to defend their dissertation.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EDUC.7660": {
        "name": "EDUC.7660 Continued Graduate Research (Formerly 05.766)",
        "url": "https://www.uml.edu/catalog/courses/EDUC/7660/",
        "id": "002740",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    }
}