{
    "total": 197,
    "time": 130.98121905326843,
    "EECE.1070": {
        "name": "EECE.1070 Introduction to Electrical and Computer Engineering  (Formerly 25/16.107)",
        "url": "https://www.uml.edu/catalog/courses/EECE/1070/",
        "id": "039471",
        "description": "This course is divided into two parts in which students focus on core skills to help them thrive in electrical and computer engineering. The first half of the course focuses on application programming in Matlab where students learn basics of Programming, Digital Signal Processing, and Data Analysis. In the second part of the course students program a micro-controller and learn about the function of basic electronic components. Students learn to use basic test equipment such as an Oscilloscope, Function Generator, Volt Meter. This course is project and lab based.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.1CO-OP": {
        "name": "EECE.1CO-OP Curricula Practical Training",
        "url": "https://www.uml.edu/catalog/courses/EECE/1CO-OP/",
        "id": "039782",
        "description": "Curricula Practical Training. \"Variable credit course, student chooses appropriate amount of credits when registering.\"",
        "credits": {
            "min": "0",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.2010": {
        "name": "EECE.2010 Circuit Theory I (Formerly 16.201)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2010/",
        "id": "003159",
        "description": "This course covers ideal elements, active and passive. It introduces and applies Ohm's Law and Kirchoff's Laws. Introduces concepts of network topology, independent and dependent variables, mesh and nodal analysis, the definition and consequences of linearity, source transformation, the superposition principle, Thevenin's and Norton's theorems, and maximum power transfer. Also covers ideal inductance and capacitance in simple circuits with the study of transient response and behavior under DC conditions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "MATH.1320 Calculus II, and Co-req: EECE.2070 Basic Electrical Engineering Lab I, and a 'C' or higher in MATH.1320.",
        "requirements": {
            "prerequisites": [
                [
                    "MATH.1320"
                ]
            ],
            "corequisites": [
                [
                    "EECE.2070"
                ],
                [
                    "MATH.1320"
                ]
            ]
        }
    },
    "EECE.2020": {
        "name": "EECE.2020 Circuit Theory II (Formerly 16.202)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2020/",
        "id": "003160",
        "description": "This course covers AC circuits under sinusoidal steady-state conditions using the concept of the frequency domain. Introduces the use of complex numbers, phasors, impedance and admittance for the application of circuit laws introduced in Circuit Theory I: Thevenin and Norton's theorems, source transformation, superposition, maximum power transfer, nodal and mesh analysis. Covers power in the frequency domain, including RMS values, average power, reactive power, and apparent power. Introduction to magnetic coupling, mutual inductance, and the ideal transformer. Introduction to transfer functions, poles and zeroes in the s-plane.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: C- or better in EECE 2010 Circuit Theory I, or Spring 2020 grade of \"P\" and Co-Req: EECE 2080 Basic EE Lab II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2010"
                ]
            ],
            "corequisites": [
                [
                    "EECE.2080"
                ]
            ]
        }
    },
    "EECE.2070": {
        "name": "EECE.2070 Basic Electrical Engineering Laboratory I (Formerly 16.207)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2070/",
        "id": "003161",
        "description": "Experimental work designed to verify theory and to acquaint students with electrical measurement techniques: experiments on meters, bridges, and oscilloscopes. Experiments are correlated with Circuit Theory I and concern: resistive measurements, Kirchhoff's laws, network theorems, conservation of power and maximum power transfer, inductance and capacitance, and first and second-order transients, operational amplifiers. MATLAB will be utilized throughout the course.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "Co-Req: EECE.2010 Circuit Theory I.",
        "requirements": {
            "prerequisites": [],
            "corequisites": [
                [
                    "EECE.2010"
                ]
            ]
        }
    },
    "EECE.2080": {
        "name": "EECE.2080 Basic Electrical Engineering Lab II (Formerly 16.208)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2080/",
        "id": "003162",
        "description": "Presents experimental work designed to emphasize electrical measurement techniques of linear systems with time-varying signals. Waveform measurements with DC and AC meters as well as advanced use of the oscilloscope are also discussed. Experiments are integrated with Circuit Theory II. Experiments cover: Kirchhoff's laws for phasors,  magnitude and phase measurements of impedance, network theorems, frequency response, resonance, inductance, maximum power transfer, and MATLAB techniques.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "Pre-Req: EECE 2070 Basic EE Lab I; Co-Req: EECE 2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2070"
                ]
            ],
            "corequisites": [
                [
                    "EECE.2020"
                ]
            ]
        }
    },
    "EECE.2110": {
        "name": "EECE.2110 Fundamentals of Electricity I (Formerly 16.211/213)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2110/",
        "id": "001269",
        "description": "This course serves as an introduction to direct current (DC) and alternating current (AC) analysis of electric circuits, with emphasis on energy and power. Covers the explanation of basic components (resistor, capacitor and inductor) and their use in electronics. Cover also the design and use of multi-range voltmeters, ammeters, and ohmmeters, series, parallel and series parallel circuits, the use of bridges, phasor analysis of AC circuits, transformers, relays, solenoids, etc. Different techniques like Superposition theorem, Thevenin equivalent circuit or Maximum Power will be presented. Students will also be introduced to DC and AC motors and generators, first and second order filters as well as basic sensors. Not for ECE students.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: MATH 1320 Calculus II.",
        "requirements": {
            "prerequisites": [
                [
                    "MATH.1320"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.2140": {
        "name": "EECE.2140 Fundamentals of Sound Recording (Formerly 16.214)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2140/",
        "id": "003164",
        "description": "This course serves to instruct sound recording technology through the concepts of voltage, current, power, resistance and Ohm's law; series, parallel and resonant circuits, Kirchhoff's voltage and current laws; the Wheatstone bridge, Thevenin equivalent circuits and maximum power transfer theorem; magnetism, electromagnetism, electromagnetic devices, and transformers; a.c. current, \nRF signals, capacitors, and inductors; RC, RL, and RLC circuits; d.c. power sources; diodes, transistors, tubes (thermionic emission), and amplifiers. Use of voltmeters, ammeters, ohmmeters, and oscilloscopes are discussed and used in lab throughout the course. Not for ECE students.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Sound Recording Technology majors;  Pre-Req: MATH 1320 Calculus II.",
        "requirements": {
            "prerequisites": [
                [
                    "MATH.1320"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.2160": {
        "name": "EECE.2160 ECE Application Programming (Formerly 16.216)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2160/",
        "id": "003165",
        "description": "Introduces C programming for engineers.  Covers fundamentals of procedural programming with applications in electrical and Computer engineering and embedded systems.  Topics include variables, expressions and statements, console input/output, modularization and functions, arrays, pointers and strings algorithms, structures, and file input/output.  Introduces working with C at the bit manipulation level.  Laboratories include designing and programming engineering applications.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.2330": {
        "name": "EECE.2330 History of Radio (Formerly 16.233)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2330/",
        "id": "003171",
        "description": "Intended primarily for students majoring in the liberal arts. The course develops the theory of electricity from an historical perspective. Sufficient background in circuit theory, resonance, field theory and radio waves is given to provide an understanding of the principles of radio from its antecedents in the nineteenth century through the invention of the transistor in the mid twentieth century. The fundamental contributions of, for example Volta, Oersted, Morse, Maxwell, Faraday, Hertz, Lodge, and Marconi are considered. In the present century the technical advances of such figures as de Forest, Fleming, Fessenden, Armstrong and Shockley are studied. The growth, regulation and culture of American broadcasting are also central to the course. Laboratory work is required and students may use this course toward fulfilling the General Education (science/experimental component) requirement of the University. Not open to students in the College of Engineering.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.2460": {
        "name": "EECE.2460 Introduction to Data Communication Networks",
        "url": "https://www.uml.edu/catalog/courses/EECE/2460/",
        "id": "039823",
        "description": "This course is designed to convey the essentials of data communication and networking. This includes an understanding of the Open Systems Interconnection (OSI), TCP/IP and Internet models. It covers various protocols and architectures of interconnection technologies. Several concepts will be discussed that will enable students to apply the basic concepts of data communication and networking technology in many practical situations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.1070 Introduction to Electrical and Computer Engineering, and MATH.1310 Calculus I, and PHYS.1410 Physics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.1070"
                ],
                [
                    "MATH.1310"
                ],
                [
                    "PHYS.1410"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.2650": {
        "name": "EECE.2650 Logic Design (Formerly 16.265)",
        "url": "https://www.uml.edu/catalog/courses/EECE/2650/",
        "id": "003172",
        "description": "Number systems and binary codes. Boolean algebra. Canonical and fundamental forms of Boolean functions. Function expansion and its applications to digital circuit design. Minimization of Boolean functions by Boolean algebra and Karnaugh maps. Two-level and multi-level digital circuits. Decoder, encoders, multiplexers, and de-multiplexers. Latches and flip-flops. Registers and counters. Analysis and synthesis of synchronous sequential circuits. Design of more complex circuits: data-path and control circuits. Use of software tools to implement a design on modern hardware.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "MECH.1070 intro to Mechanical Eng, or COMP.1020 Computing II, or EECE.1070 Intro to Elec. & Comp. Engin, or EECE.2160 ECE Application Programming.",
        "requirements": {
            "prerequisites": [
                [
                    "MECH.1070",
                    "COMP.1020",
                    "EECE.1070",
                    "EECE.2160"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3110": {
        "name": "EECE.3110 Electronics I Lab (Formerly 16.311)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3110/",
        "id": "003175",
        "description": "Laboratory experiments coordinated with the subject matter of Electronics I. This lab explores the characteristics and use of electronic instrumentation for making measurements on electronic circuits. Labs will utilize the methods of designing and characterizing diode and transistor circuits. They will analyze the performance characteristics of digital and linear semiconductor circuits, including logic elements and amplifiers. The design and construction of circuits using monolithic op amps will also be explored.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "EECE.2080 Basic EE Lab II, and Co-req: EECE.3650 Electronics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2080"
                ]
            ],
            "corequisites": [
                [
                    "EECE.3650"
                ]
            ]
        }
    },
    "EECE.3120": {
        "name": "EECE.3120 Electronics II Laboratory (Formerly 16.312)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3120/",
        "id": "003176",
        "description": "This course covers laboratory experiments coordinated with the subject matter of Electronics II, Study of high-frequency characteristics of transistors and transistor amplifiers. Covers feedback in electronic circuits, electronic oscillators and differential amplifier. Covers also the properties of linear IC operational amplifiers and their application in amplifier circuits and waveform generation circuits. Design and analysis of linear circuits.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "EECE.3110 Electronics I Lab, and Co-req: EECE.3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3110"
                ]
            ],
            "corequisites": [
                [
                    "EECE.3660"
                ]
            ]
        }
    },
    "EECE.3170": {
        "name": "EECE.3170 Microprocessors Systems Design I (Formerly 16.317)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3170/",
        "id": "003178",
        "description": "Introduction to microprocessors, Uses assembly language to develop a foundation on the hardware which executes a program. Memory and I/O interface design and programming. Design and operation of computer systems. Study of microprocessor and its basic support components, including detailed schematics, timing and functional analysis of their interactions. Laboratories directly related to microprocessor functions and its interfaces (e.g. memory subsystem, I/O devices and coprocessors).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2160 ECE Application Programming, and EECE 2650 Logic Design.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.2650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3220": {
        "name": "EECE.3220 Data Structures (Formerly 16.322)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3220/",
        "id": "003179",
        "description": "Covers algorithms and their performance analysis, data structures, abstraction, and encapsulation. Introduces stacks, queues, linked lists, trees, heaps, priority queues, and hash tables, and their physical representation. Discusses efficient sorting (quicksort and heapsort) and experimental algorithm analysis. Examines several design issues, including selection of data structures based on operations to be optimized, algorithm encapsulation using classes and templates, and how and when to use recursion. Assignments include programming of data structures in an object-oriented language.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2160 ECE Application Programming",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3550": {
        "name": "EECE.3550 Electromechanics (Formerly 16.355)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3550/",
        "id": "003183",
        "description": "Alternating current circuits, three phase circuits, basics of electromagnetic field theory, magnetic circuits, inductance, electromechanical energy conversion. Ideal transformer, iron-core transformer, voltage regulation, efficiency equivalent circuits, and three phase transformers. Induction machine construction, equivalent circuit, torque speed characteristics, and single phase motors. Synchronous machine construction, equivalent circuits, power relationships phasor diagrams, and synchronous motors. Direct current machines construction, types, efficiency, power flow diagram, and external characteristics.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3600": {
        "name": "EECE.3600 Engineering Electromagnetics I (Formerly 16.360)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3600/",
        "id": "003184",
        "description": "Electromagnetics I is the study of fundamental electrostatic and magnetostatic equations building up to the foundation of electrodynamics, Maxwell's Equations. This course is put into an engineering perspective by describing transmission line properties using circuit models and deriving these model parameters directly from Maxwell's Equations. To accomplish these tasks, Engineering Electromagnetics I implements: Transmission lines as Distributed Circuits, Smith Charts, impedance Matching, Electrostatics and Capacitance, steady current flow and Resistance, and Magnetostatics and Inductance.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE 2020 Circuit Theory II and PHYS 1440 Physics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ],
                [
                    "PHYS.1440"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3620": {
        "name": "EECE.3620 Signals and Systems I (Formerly 16.362)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3620/",
        "id": "003185",
        "description": "This course covers various continuous voltage/current time functions and their applications to linear time-invariant (LTI) electrical systems. It reviews pertinent topics from previous courses on circuit theory, such as system functions, S-plane concepts and complete responses. It introduces step and impulse functions and their responses in LTI circuits. It covers the solving of convolution integrals and differential equations, the transformation of signals to Fourier series, the Fourier and Laplace transforms, with their application, in continuous and discrete time, and Parseval's theorem. It also describes analog filter responses and design. A computing project is proposed in this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE 2020 Circuit Theory II and MATH 2360 Eng Differential Equations or MATH.2340 Differential Equations.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ],
                [
                    "MATH.2360",
                    "MATH.2340"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3630": {
        "name": "EECE.3630 Introduction to Probability and Random Processes  (Formerly 16.363)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3630/",
        "id": "003186",
        "description": "Introduction to probability, random processes and basic statistical methods to address the random nature of signals and systems that engineers analyze, characterize and apply in their designs. It includes discrete and continuous random variables, their probability distributions and analytical and statistical methods for determining the mean, variance and higher order moments that characterize the random variable. Descriptive and inferential statistics, as well as time-varying random processes and their spectral analysis are introduced. The course provides the skills required to address modeling uncertainty in manufacturing and reliability analysis, noise characterization, and data analysis.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3640": {
        "name": "EECE.3640 Engineering Mathematics (Formerly 16.364)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3640/",
        "id": "003187",
        "description": "Complex number, Argand plane, derivatives of complex numbers, limits and continuity, derivative and Cauchy Riemann conditions, analytic functions, integration in the complex plane, Cauchy's integral formula, infinite series for complex variables. Taylor series, Laurent series, residue theory, evaluation of integrals around indented contours. Linear vector spaces, matrices and determinants, eigenvalues and eigenvectors.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: MATH 2360 Eng Differential Equations or MATH.2340 Differential Equations.",
        "requirements": {
            "prerequisites": [
                [
                    "MATH.2360",
                    "MATH.2340"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.3650": {
        "name": "EECE.3650 Electronics I (Formerly 16.365)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3650/",
        "id": "003188",
        "description": "A brief introduction to solid-state physics, leading to discussion of physical characteristics of p-n junction diodes, bipolar junction transistors, and field-effect transistors: active, saturated, and cutoff models of bipolar transistors and triode, constant current, and cutoff models of MOSFETs. Circuit models for diodes, and diode applications. Circuit models for transistors, and transistor applications in bipolar and MOS digital circuits and low-frequency amplifier circuits. Analysis of digital circuits and linear circuits based on application of circuit models of devices and circuit theory.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE 2020 Circuit Theory ll, and PHYS 1440 Physics ll, and Co-req: EECE 3110 Electronics l Lab.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ],
                [
                    "PHYS.1440"
                ]
            ],
            "corequisites": [
                [
                    "EECE.3110"
                ]
            ]
        }
    },
    "EECE.3660": {
        "name": "EECE.3660 Electronics II (Formerly 16.366)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3660/",
        "id": "003189",
        "description": "A continuation of 16.365 with discussion of differential amplifiers, operation amplifiers and op amp applications, transistor amplifiers at very high frequencies; direct-coupled and band pass amplifiers; small and large signal amplifiers; feedback amplifiers and oscillators. Active filters, wave form generation circuits including Schmitt trigger, multiplexers, and A/D and D/A converters. Circuit design employing integrated circuit operational amplifiers and discrete devices. Circuit analysis using SPICE. An electronic design project constitutes a major part of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: C- or better in EECE 3650 Electronics I,or Spring 2020 grade of \"P\",  Co-Req: EECE 3120 Electronics Lab II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3650"
                ]
            ],
            "corequisites": [
                [
                    "EECE.3120"
                ]
            ]
        }
    },
    "EECE.3991": {
        "name": "EECE.3991 Capstone Proposal (Formerly 16.399)",
        "url": "https://www.uml.edu/catalog/courses/EECE/3991/",
        "id": "003195",
        "description": "This course is the first in a two semester capstone sequence. In a group, students will work with a client to define their project, by identifying the problem, objective and requirements, and engage in design, analysis, test and fabrication tasks as appropriate to meet the project goals. Project management tools are discussed and applied in this process.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3110 Electronics I Lab, and EECE 3170 Microprocessor Sys Desgn I, and EECE 3650 Electronics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3110"
                ],
                [
                    "EECE.3170"
                ],
                [
                    "EECE.3650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4030": {
        "name": "EECE.4030 Microwave Engineering (Formerly 16.403)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4030/",
        "id": "003198",
        "description": "An introductory course in the analysis and design of passive microwave circuits beginning with a review of time-varying electromagnetic field concepts and transmission lines. Smith Chart problems; single and double stub matching; impedance transformer design; maximally flat and Chebyshev transformers; microstrip transmission lines, slot lines, coplanar lines; rectangular and circular waveguides; waveguide windows and their use in impedance matching; design of directional couplers; features of weak and strong couplings; microwave filter design; characteristics of low-pass, high-pass, band-pass, band-stop filter designs; two-port network representation of junctions; Z and Y parameters, ABCD parameters, scattering matrix; microwave measurements; measurement of VSWR, complex impedance, dielectric constant, attenuation, and power. A design project constitutes a major part of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.4610 Emag Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4610"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4040": {
        "name": "EECE.4040 VLSI Fabrication (Formerly 16.470/EECE.4700)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4040/",
        "id": "003239",
        "description": "Fabrication of resistors, capacitors, p-n junction and Schottky barrier diodes, BJT's and MOS devices and integrated circuits. Topics include: silicon structure, wafer preparation, sequential techniques in microelectronic processing, testing and packaging, yield and clean room environments. MOS structures, crystal defects, Fick's laws of diffusion; oxidation of silicon, photolithography including photoresist, development and stripping. Metallization for conductors, Ion implantation for depletion mode and CMOS transistors for better yield speed, low power dissipation and reliability. Students will fabricate circuits using the DSIPL Laboratory.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3650 Electronics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4060": {
        "name": "EECE.4060 Antenna Theory and Design (Formerly 16.462/EECE.4620)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4060/",
        "id": "003233",
        "description": "An introduction to properties of individual antennas and arrays of antennas. Retarded potentials, dipoles of arbitrary length, radiation pattern, gain, directivity, radiation resistance. The loop antenna. Effects of the earth. Reciprocity, receiving antennas, effective length and area. Moment methods. Arrays: collinear, broadside, endfire. Array synthesis. Mutual coupling. Log-periodic and Yagi arrays. Radiation from apertures: the waveguide horn antenna, parabolic dish. Antenna noise temperature. Numerical software packages. A design project is required in the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.4610 Emag Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4610"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4090": {
        "name": "EECE.4090 Directed Studies (Formerly 16.409)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4090/",
        "id": "003199",
        "description": "Provides an opportunity for qualified Electrical Engineering students to investigate specific areas of interest. The actual project undertaken may be software or hardware oriented. The most important characteristics of the projects are that the end results represent independent study, that they are research and development oriented, and that they are accomplished in an engineering environment. Design reviews and progress reports are expected for each project. A final formal report to be permanently filed in the EE Department is required for each project. Engineering Design (100%).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3550 Electromechanics,EECE 3600 Emag Theory I, EECE 3620 Signals & Systems I, EECE 3650 Electronics I,and EECE 3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3550"
                ],
                [
                    "EECE.3600"
                ],
                [
                    "EECE.3620"
                ],
                [
                    "EECE.3650"
                ],
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4100": {
        "name": "EECE.4100 Directed Studies (Formerly 16.410)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4100/",
        "id": "003200",
        "description": "The purpose of this course is to provide an opportunity for qualified Electrical Engineering students to investigate specific areas of interest. The actual project undertaken may be software or hardware oriented. The most important characteristics of the projects are that the end results represent independent study and that they are research and development oriented, and that they are accomplished in an engineering environment. Design reviews and progress reports are expected for each project. A final formal report to be permanently filed in the EE Department is required for each project.",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3550 Electromechanics,EECE 3600 Emag Theory I,EECE 3620 Signals & Systems I,EECE 3650 Electronics I, and EECE 3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3550"
                ],
                [
                    "EECE.3600"
                ],
                [
                    "EECE.3620"
                ],
                [
                    "EECE.3650"
                ],
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4120": {
        "name": "EECE.4120 Directed Studies (Formerly 16.412)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4120/",
        "id": "003202",
        "description": "The purpose of this course is to provide an opportunity for qualified Electrical Engineering students to investigate specific areas of interest. The actual project undertaken may be software or hardware oriented. The most important characteristics of the projects are that the end results represent independent study and that they are research and development oriented, and that they are accomplished in an engineering environment. Design reviews and progress reports are expected for each project. A final formal report to be permanently filed in the EE Department is required for each project.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3550 Electromechanics,EECE 3600 Emag Theory I, EECE 3620 Signals & Systems I, EECE 3650 Electronics I,and EECE 3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3550"
                ],
                [
                    "EECE.3600"
                ],
                [
                    "EECE.3620"
                ],
                [
                    "EECE.3650"
                ],
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4130": {
        "name": "EECE.4130 Linear Feedback System (Formerly 16.413)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4130/",
        "id": "003203",
        "description": "Concepts of feedback; open loop and closed loop systems. Feedback in electrical and mechanical systems. Mathematical models of systems and linear approximations. Transfer functions of linear systems, block diagrams and signal flow graphs. Sensitivity, control of transient response, disturbance signals. Time domain performance: steady state errors, performance indices. Stability related to s-plane location of the roots of the characteristic equation. Routh-Hurwitz criterion. Graphical analysis techniques: root locus, frequency response as polar plot and Bode diagrams. Closed loop frequency response. A control system design project is included in the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE 3620 Signals & Systems I and EECE 3640 Engineering Math.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3620"
                ],
                [
                    "EECE.3640"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4140": {
        "name": "EECE.4140 Integrated Power Systems (Formerly 16.414/514)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4140/",
        "id": "003227",
        "description": "Power System Operations and Electricity Markets provide a comprehensive overview to understand and meet the challenges of the new competitive highly deregulated power industry.  The course presents new methods for power systems operations in a unified integrated framework combining the business and technical aspects of the restructured power industry.  An outlook on power policy models, regulation, reliability, and economics is attentively reviewed.  The course lay the groundwork for the coming era of unbundling, open access,, power marketing, self-generation, and regional transmission operations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4150": {
        "name": "EECE.4150 Power Electronics (Formerly 16.473/515 & EECE.4730/5150)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4150/",
        "id": "001267",
        "description": "A one-semester course with emphasis on the engineering design and performance analysis of power electronics converters. Topics include: power electronics devices (power MOSFETs, power transistors, diodes, silicon controlled rectifiers SCRs, TRIACs, DIACs and Power Darlington Transistors), rectifiers, inverters, ac voltage controllers, dc choppers, cycloconverters, and power supplies. The course includes a project, which requires that the student design and build one of the power electronics converters. A demonstrative laboratory to expose the students to all kinds of projects is part of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3550 Electromechanics and EECE 3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3550"
                ],
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4180": {
        "name": "EECE.4180 Wireless Communication  (Formerly 16.418)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4180/",
        "id": "003206",
        "description": "Cellular systems and design principles, co-channel and adjacent channel interference, mobile radio propagation and determination of large scale path loss, propagation mechanisms like reflection, diffraction and scattering, outdoor propagation models, Okumura and Hata models, small scale fading and multipath, Doppler shift and effects, statistical models for multipath, digital modulation techniques QPSK, DPSK, GMSK, multiple access techniques, TDMA, FDMA, CDMA, spread spectrum techniques, frequency hopped systems, wireless systems and worldwide standards.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3630 Introduction to Probability and Random Process.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3630"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4210": {
        "name": "EECE.4210 Real Time Digital Signal Processing (Formerly 16.421)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4210/",
        "id": "003209",
        "description": "This course provides an introduction to real-time digital signal processing techniques using floating point and fixed point processors. The architecture, instruction set and software development tools for these processors will be studied via a series of C and assembly language computer projects where real-time adaptive filters, modems, digital control systems and speech recognition systems are implemented.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3620 Signals and Systems I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4230": {
        "name": "EECE.4230 Semiconductor Physics for Solid-State Electronics (Formerly 16.423)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4230/",
        "id": "003211",
        "description": "The course covers fundamental solid-state and semiconductor physics relevant for understanding electronic devices. Topics include quantum mechanics of electrons in solids, crystalline structures, ban theory of semiconductors, electron statistics and dynamics in energy bands, lattice dynamics and phonons, carrier transport, and optical processes in semiconductors.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3650 Electronics I, and EECE.3640 Engineering Mathematics, and EECE.3600 Engineering Electromagnetics I, or permission of instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3650"
                ],
                [
                    "EECE.3640"
                ],
                [
                    "EECE.3600"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4240": {
        "name": "EECE.4240 Computational Methods for Power System Analysis (Formerly 16.424/524)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4240/",
        "id": "003278",
        "description": "The course explores some of the mathematical and simulation tools used for the design, analysis and operation of electric power systems. Computational methods based on linear and nonlinear optimization algorithms are used to solve load flow problems, to analyze and characterize system faults and contingencies, and to complete economic dispatch of electric power systems. Real case studies and theoretical projects are assigned to implement the techniques learned and to propose recommendations. Different software applications will be used concurrently including ATP, PowerWorld Simulator, Aspen, MatLab with Simulink and Power System Toolbox, PSCAD, etc.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4250": {
        "name": "EECE.4250 Power Distribution System (Formerly 16.4440/EECE.4440)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4250/",
        "id": "003228",
        "description": "An intermediate course in analysis and operation of electrical power distribution systems using applied calculus and matrix algebra. Topics include electrical loads characteristics, modeling , metering, customer billing, voltage regulation, voltage levels, and power factor correction. The design and operation of the power distribution system components will be introduced: distribution transformers, distribution substation, distribution networks, and distribution equipment.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2020 Circuit Theory II, and EECE.2080 Basic EE Lab II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ],
                [
                    "EECE.2080"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4260": {
        "name": "EECE.4260 Power Systems Stability and Control (Formerly 16.426/526)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4260/",
        "id": "003213",
        "description": "Stability definition and cases in power systems. System model for machine angle stability. Small signal and transient stability. Voltage stability phenomenon, its characterization. Small and large signal models for voltage stability analysis. Frequency stability and control. Compensation methods for system voltage regulation including classical and modem methods. Stability of multi-machine system.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4270": {
        "name": "EECE.4270 Advanced VLSI Design Techniques (Formerly 16.427/527)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4270/",
        "id": "033544",
        "description": "This course builds on the previous experience with Cadence design tools and covers advanced VLSI design techniques for low power circuits.  Topics covered include aspects of the design of low voltage and low power circuits including process technology, device modeling, CMOS circuit design, memory circuits and subsystem design.  This will be a research-oriented course based on team projects.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.4690 VLSI Design, or EECE.5690 VLSI Design, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4690",
                    "EECE.5690"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4280": {
        "name": "EECE.4280 Alternative Energy Sources (Formerly 16.428)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4280/",
        "id": "003214",
        "description": "PV conversion, cell efficiency, cell response, systems and applications. Wind Energy conversion systems: Wind and its characteristics; aerodynamic theory of windmills; wind turbines and generators; wind farms; siting of windmills. Other alternative energy sources: Tidal energy, wave energy, ocean thermal energy conversion, geothermal energy, solar thermal power, satellite power, biofuels. Energy storage: Batteries, fuel cells, hydro pump storage, flywheels, compressed air.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4290": {
        "name": "EECE.4290 Electric Vehicle Technology (Formerly 16.429)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4290/",
        "id": "003215",
        "description": "Electric vehicle VS internal combustion engine vehicle. Electric vehicle (EV) saves the environment. EV design, EV motors, EV batteries, EV battery chargers and charging algorithms, EV instrumentation and EV wiring diagram. Hybrid electric vehicles. Fuel cells. Fuel cell electric vehicles. The course includes independent work.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4300": {
        "name": "EECE.4300 Introduction to Medical Image Reconstruction",
        "url": "https://www.uml.edu/catalog/courses/EECE/4300/",
        "id": "042180",
        "description": "This course provides both traditional and state-of-the-art tomographic reconstruction algorithms in a unified way. It includes analytic reconstruction, iterative reconstruction, and deep reconstruction based on the state-of-the-art deep learning techniques. This course provides fundamental knowledge for careers in medical image reconstruction.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3620 Signals and Systems I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4310": {
        "name": "EECE.4310 RF Design (Formerly 16.431)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4310/",
        "id": "003217",
        "description": "Two-port network parameters, Smith chart applications for impedance matching, transmission line structures like stripline, microstrip line and coaxial line, filter designs for low-pass, high-pass and band-pass characteristics, amplifier design based on s-parameters, bias network designs, one port and two port oscillator circuits, noise in RF systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3600 Emag Theory I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3600"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4330": {
        "name": "EECE.4330 Electronic Materials (Formerly 16.333/EECE.3330)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4330/",
        "id": "003180",
        "description": "The production and processing of materials into finished products constitute a large part of the present economy. To prepare students for the use of a variety of traditional and new materials, this course will cover: atomic structure and chemical bonding, crystal geometry and defects, mechanical properties and phase diagrams of metals and alloys, electrical and optical properties of semiconductors, ceramics, and polymers; brief description of electronic, quantum electronic and photonic devices; benefits and difficulties of materials design with decreasing dimensions from millimeters to micrometers and to nanometers.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "MATH.1320 Calculus II and PHYS.1440 Physics II.",
        "requirements": {
            "prerequisites": [
                [
                    "MATH.1320"
                ],
                [
                    "PHYS.1440"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4410": {
        "name": "EECE.4410 Introduction to Biosensors (Formerly 16.441/541)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4410/",
        "id": "033545",
        "description": "This course introduces the theory and design of biosensors and their applications for pathology, pharmacogenetics, public health, food safety civil defense, and environmental monitoring.  Optical, electrochemical and mechanical sensing techniques will be discussed.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4450": {
        "name": "EECE.4450 Analog Devices and Techniques (Formerly 16.445/565 & EECE.4450/5650)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4450/",
        "id": "001266",
        "description": "A survey of analog devices and techniques, concentrating on operational amplifier design and applications. Operational amplifier design is studied to reveal the limitations of real opamps, and to develop a basis for interpreting their specifications. Representative applications are covered, including: simple amplifiers, differential and instrumentation amplifiers, summers, integrators, active filters, nonlinear circuits, and waveform generation circuits. A design project is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4500": {
        "name": "EECE.4500 Advanced Digital System Hardware Design (Formerly  16.450)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4500/",
        "id": "030319",
        "description": "Design of logic machines. Finite state machines, gate array designs, ALU and 4 bit CPU unit designs, micro-programmed systems. Hardware design of advanced digital circuits using XILINX. Application of probability and statistics for hardware performance, and upgrading hardware systems. Laboratories incorporate specification, top-down design, modeling, implementation and testing of actual advanced digital design systems hardware. Laboratories also include simulation of circuits using VHDL before actual hardware implementation and PLDs programming.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2650 Logic Design, and EECE.3650 Electronics I, and EECE.3110 Electronics I Lab, and EECE.3170 Microprocessor Systems Design I, or permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2650"
                ],
                [
                    "EECE.3650"
                ],
                [
                    "EECE.3110"
                ],
                [
                    "EECE.3170"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4510": {
        "name": "EECE.4510 Heterogeneous Computing",
        "url": "https://www.uml.edu/catalog/courses/EECE/4510/",
        "id": "042181",
        "description": "This course introduces heterogeneous computing architecture and the design and optimization of applications that best utilize the resources on such platforms. The course topics include heterogeneous computer architecture, offloading architecture/API, platform, memory and execution models, GPU/FPGA acceleration, OpenCL programming framework, Data Parallel C++ programming framework, performance analysis and optimization. Labs are included to practice design methodology and development tools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3170 Microprocessors Systems Design I, or EECE.4821 Computer Architecture and Design, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3170",
                    "EECE.4821"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4520": {
        "name": "EECE.4520 Microprocessor Systems II & Embedded Systems (Formerly 16.480/EECE.4800)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4520/",
        "id": "031985",
        "description": "CPU architecture, memory interfaces and management, coprocessor interfaces, bus concepts, bus arbitration techniques, serial I/O devices, DMA, interrupt control devices. Including Design, construction, and testing of dedicated microprocessor systems (static and real-time). Hardware limitations of the single-chip system. Includes micro-controllers, programming for small systems, interfacing, communications, validating hardware and software, microprogramming of controller chips, design methods and testing of embedded systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3110 Electronics I Lab, and EECE 3170 Microprocessor Sys Desgn I, and EECE 3650 Electronics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3110"
                ],
                [
                    "EECE.3170"
                ],
                [
                    "EECE.3650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4530": {
        "name": "EECE.4530 Software Engineering (Formerly 16.453)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4530/",
        "id": "003230",
        "description": "Introduces software life cycle models, and engineering methods for software design and development. Design and implementation, testing, and maintenance of large software packages in a dynamic environment, and systematic approach to software design with emphasis on portability and ease of modification. Laboratories include a project where some of the software engineering methods (from modeling to testing) are applied in an engineering example.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE 2160 ECE Application Programming and EECE 3220 Data Structures. or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4550": {
        "name": "EECE.4550 Computer System Security",
        "url": "https://www.uml.edu/catalog/courses/EECE/4550/",
        "id": "042182",
        "description": "An introduction to computer system security. This course introduces the threats and vulnerabilities in computer systems. This course covers the elementary cryptography, program security, security in operating system, database security, network, web, and e-commerce. It also covers some aspects of hardware security, legal, ethical and privacy issues in computer system security.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3220 Data Structures.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4560": {
        "name": "EECE.4560 Fundamentals of Robotics",
        "url": "https://www.uml.edu/catalog/courses/EECE/4560/",
        "id": "041756",
        "description": "The material in this course is a combination of essential topics, techniques, algorithms, and tools that will be used in future robotics courses. Fundamental topics relevant to robots (linear algebra, numerical methods, programming) will be reinforced throughout the course using introductions to other robotics topics that are each worthy of a full semester of study (dynamics, kinematics, controls, planning, sensing). Students will program real robots to further refine their skills and experience the material fully.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req:  COMP.1010 Computing 1 or  EECE.2160 ECE Computing Application.",
        "requirements": {
            "prerequisites": [
                [
                    "COMP.1010",
                    "EECE.2160"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4590": {
        "name": "EECE.4590 Introduction to Nanoelectronics (Formerly 16.459/559)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4590/",
        "id": "037745",
        "description": "This course introduces the use of nanomaterials for electronic devices such as sensors and transistors.  Synthesis methods for nanoparticles, nanotubes, nanowires, and 2-D materials such as graphene will be covered.  The challenges in incorporating nanomaterials into devices will also be discussed.  These methods will be compared to techniques used in the semiconductor industry and what challenges, technically and financially, exist for their widespread adoption will be addressed.  Finally, examples of devices that use nanomaterials will be reviewed.  The course will have some hands on demonstrations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4600": {
        "name": "EECE.4600 Biomedical Instrumentation (Formerly 16.460/560)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4600/",
        "id": "003231",
        "description": "A survey of biomedical instrumentation that leads to the analysis of various medical system designs and the related factors involved in medical device innovation. In addition to the technical aspects of system integration of biosensors and physiological transducers there will be coverage of a biodesign innovation process that can translate clinical needs into designs. A significant course component will be project-based prototyping of mobile heath applications. The overall goals of the course are to provide the theoretical background as well as specific requirements for medical device development along with some practical project experience that would thereby enable students to design electrical and computer based medical systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "ECE senior/grad or BMEBT student",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4610": {
        "name": "EECE.4610 Engineering Electromagnetics II (Formerly 16.461)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4610/",
        "id": "003232",
        "description": "Continuation of Magnetostatics, Maxwell's Equations for Time-varying Fields, plane waves: time-harmonic fields, polarization, current flow in good conductors and skin effect, power density and Poynting vector, wave reflection and transmission; Snell's Law, fiber optics, Brewster angle, radiation and simple antennas, electromagnetic concepts involved in a topical technology in development.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3600 Emag Theory I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3600"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4670": {
        "name": "EECE.4670 Special Topics (Formerly 16.467)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4670/",
        "id": "003237",
        "description": "Topics of current interest in Electrical and Computer Engineering. Subject matter to be announced in advance.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4680": {
        "name": "EECE.4680 Electro-optics & Integrated Optics (Formerly 16.468)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4680/",
        "id": "003238",
        "description": "An introduction to physical optics, electro-optics and integrated optics.  Topics include: Waves and polarization, optical resonators, optical waveguides, coupling between waveguides, electro-optical properties of crystals, electro-optic modulators, Micro-Optical-Electro-Mechanical (MEMS) Devices and photonic and microwave wireless systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3600 Emag Theory I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3600"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4690": {
        "name": "EECE.4690 VLSI Design (Formerly 16.469/502 & EECE.4690/5020)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4690/",
        "id": "001268",
        "description": "Introduction to CMOS circuits including transmission gate, inverter, NAND, NOR gates, MUXEs, latches and registers. MOS transistor theory including threshold voltage and design equations. CMOS inverter's DC and AC characteristics along with noise margins. Circuit characterization and performance estimation including resistance, capacitance, routing capacitance, multiple conductor capacitance, distributed RC capacitance, multiple conductor capacitance, distributed RC capacitance, switching characteristics incorporating analytic delay models, transistor sizing and power dissipation. CMOS circuit and logic design including fan-in, fan-out, gate delays, logic gate layout incorporating standard cell design, gate array layout, and single as well as two-phase clocking. CMOS test methodologies including stuck-at-0, stuck-at-1, fault models, fault coverage, ATPG, fault grading and simulation including scan-based and self test techniques with signature analysis. A project of modest complexity would be designed to be fabricated at MOSIS.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.4720": {
        "name": "EECE.4720 Embedded Real Time Systems (Formerly 16.472)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4720/",
        "id": "003241",
        "description": "Designing embedded real-time computer systems. Types of real-time systems, including foreground/background, non-preemptive multitasking, and priority-based pre-emptive multitasking systems. Soft vs. hard real time systems. Task scheduling algorithms and deterministic behavior. Ask synchronization: semaphores, mailboxes and message queues. Robust memory management schemes. Application and design of a real-time kernel. A project is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE.2160 ECE Application Programming,EECE.3170 Microprocessor Sys Desgn I, EECE.3220 Data Structures.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.3170"
                ],
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4760": {
        "name": "EECE.4760 Principles Of Solid State Devices (Formerly 16.474/EECE.4740)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4760/",
        "id": "003242",
        "description": "This course introduces the operating principles of Solid State Devices. Basic semiconductor science is covered including crystalline properties, quantum mechanics principles, energy bands and the behavior of atoms and electrons in solids. The transport of electrons and holes (drift and diffusion) and the concepts of carrier lifetime and mobility are covered. The course describes the physics of operation of several semiconductor devices including p-n junction diodes (forward/reverse bias, avalanche breakdown), MOSFETs (including the calculation of MOSFET threshold voltages), Bipolar transistor operation, and optoelectronic devices (LEDs, lasers, photodiodes).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3650 Electronics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4811": {
        "name": "EECE.4811 Operating Systems (Formerly 16.481/EECE.4810)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4811/",
        "id": "003246",
        "description": "Covers the components, design, implementation, and internal operations of computer operating systems. Topics include basic structure of operating systems, Kernel, user interface, I/O device management, device drivers, process environment, concurrent processes and synchronization, inter-process communication, process scheduling, memory management, deadlock management and resolution, and file system structures. laboratories include examples of components design of a real operating systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2160 ECE Application Programming, and EECE.3170 Microprocessor System Design I, and EECE.3220 Data Structures, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.3170"
                ],
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4821": {
        "name": "EECE.4821 Computer Architecture and Design (Formerly 16.482/EECE.4820)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4821/",
        "id": "003247",
        "description": "Structure of computers, past and present: first, second, third and fourth generation. Combinatorial and sequential circuits. Programmable logic arrays. Processor design: information formats, instruction formats, arithmetic operations and parallel processing. Hardwired and microprogrammed control units. Virtual, sequential and cache memories. Input-output systems, communication and bus control. Multiple CPU systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3170 Microprocessor Sys Desgn I,EECE 2650 Intro Logic Design.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3170"
                ],
                [
                    "EECE.2650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4830": {
        "name": "EECE.4830 Network Design: Principles, Protocols & Applications (Formerly 16.483)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4830/",
        "id": "003248",
        "description": "Covers design and implementation of network software that transforms raw hardware into a richly functional communication system. Real networks (such as the Internet, ATM, Ethernet, Token Ring) will be used as examples. Presents the different harmonizing functions needed for the interconnection of many heterogeneous computer networks. Internet protocols, such as UDP, TCP, IP, ARP, BGP and IGMP, are used as examples to demonstrate how internetworking is realized. Applications such as electronic mail and the WWW are studied.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3220 Data Structures.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4841": {
        "name": "EECE.4841 Computer Vision and Digital Image Processing (Formerly 16.484/EECE.4840)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4841/",
        "id": "003249",
        "description": "Introduces the principles and the fundamental techniques for Image Processing and Computer Vision. Topics include programming aspects of vision, image formation and representation, multi-scale analysis, boundary detection, texture analysis, shape from shading, object modeling, stereo-vision, motion and optical flow, shape description and objects recognition (classification), and hardware design of video cards. AI techniques for Computer Vision are also covered. Laboratories include real applications from industry and the latest research areas.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-req; EECE 2160 ECE Application Programming, and EECE 3620 Signals and Systems or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4850": {
        "name": "EECE.4850 Fundamentals of Network and Cyber Security",
        "url": "https://www.uml.edu/catalog/courses/EECE/4850/",
        "id": "003250",
        "description": "This course will cover two categories of topics: One part is the fundamental principles of cryptography and its applications to cyber & network security in general. This part focuses on cryptography algorithms and the fundamental cyber & network security enabling mechanisms. Topics include cyber-attack analysis and classifications, public key cryptography (RSA, Diffie-Hellman), secret key cryptography (DES, IDEA), Hash (MD2, MD5, SHA-1) algorithms, key distribution and management, security handshake pitfalls and authentications, and well-known cyber & network security protocols such as Kerberos, IPSec, SSL/SET, PGP & PKI, WEP, etc. The second part surveys unique challenges and the general security & Privacy solutions for the emerging data/communication/information/computing networks (e.g., Ad Hoc & sensor network, IoTs, cloud and edge computing, big data, social networks, cyber-physical systems, critical infrastructures such as smart grids and smart transportation systems, etc.).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2460 Intro to Data Communication Networks, or EECE.4830 Network Design: Principles, Protocols and Applications, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2460",
                    "EECE.4830"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4900": {
        "name": "EECE.4900 Fiber Optic Communication (Formerly 16.490)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4900/",
        "id": "003252",
        "description": "Optical fiber; waveguide modes, multimode vs single mode; bandwidth and data rates; fiber losses; splices, couplers, connectors, taps and gratings; optical transmitters; optical receivers; high speed optoelectronic devices; optical link design; broadband switching; single wavelength systems (FDDI, SONET, ATM); coherent transmission; wavelength division multiplexing and CDMA; fiber amplifiers.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3600 Emag Theory I, EECE 3620 Signals & Systems I or Instructor permission.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3600"
                ],
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.4991": {
        "name": "EECE.4991 Capstone Project (Formerly 16.499)",
        "url": "https://www.uml.edu/catalog/courses/EECE/4991/",
        "id": "003256",
        "description": "The objective of this course is to execute the project defined in Capstone Proposal. The design of the project will be completed, prototyped, tested, refined, constructed and delivered to the client. Practical experience will be gained in solving engineering problems, designing a system to meet technical requirements, using modern design elements and following accepted engineering practices. Students will work in a team environment and deliver the completed system to the project client. Proper documentation of activities is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3991 Capstone Proposal.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3991"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5010": {
        "name": "EECE.5010 Introduction to Phased Arrays",
        "url": "https://www.uml.edu/catalog/courses/EECE/5010/",
        "id": "042080",
        "description": "This course covers the fundamentals of phased array systems, including contemporary and advanced methods. The principles apply to both high capability sensors and low-cost systems. Applications range from advanced and commercial radar to remote sensing, and multiple channel communications. The subject matter includes: fields and waves analysis, domain analysis, fundamentals of array theory, far field synthesis, Floquet theory, aperture weighting functions, impedance and mutual coupling theory, aperture design, beamforming methods, feed networks, array error analysis, system requirements and sizing, and system design",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.4610 Eng. Electromagnetics II, or equivalent.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4610"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5015": {
        "name": "EECE.5015 Solar PV Performance Analysis and Characterization",
        "url": "https://www.uml.edu/catalog/courses/EECE/5015/",
        "id": "042214",
        "description": "In this course, students will learn about characterization methods during: 1. Silicon ingot production/Wafering (inductively coupled plasma mass spectroscopy); 2. Solar cell manufacturing(series resistance, double diode model, ideality factor, dark-IV, light-IV, efficiency, suns Voc, contact resistance, reflectance, spectral response/quantum efficiency, light beam induced current, carrier lifetime measurement, thermography); 3. PV module manufacturing (L&P) (electroluminescence, dark-IV, light-IV, efficiency, certification-, reliability-, bankability-testing, PAN file generation, Forensic Evaluation); 4. PV System Deployment (L) (photoluminescence, infrared imaging, pyranometers, simulation tools for system forecast, energy production and cost of energy of grid-connected PV, PV Watts®, SAM (System Advisor Model), PV system performance ratio & performance index).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5040": {
        "name": "EECE.5040 VLSI Fabrication (Formerly 16.504)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5040/",
        "id": "003260",
        "description": "Fabrication of resistors, capacitors, p-n junction and Schottky Barrier diodes, BJT's and MOS devices and Integrated circuits. Topics include: silicon structure, wafer preparation, sequential techniques in micro-electronic processing, testing and packaging, yield and clean room environments. MOS structures, crystal defects, Fick's laws of diffusion; oxidation of silicon, photolithography including photoresist, development and stripping. Metallization for conductors, Ion implantation for depletion mode and CMOS transistors for better yield speed, low power dissipation and reliability. Students will fabricate circuits using the DSIPL Laboratory.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5050": {
        "name": "EECE.5050 Microwave Electronics (Formerly 16.505)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5050/",
        "id": "003261",
        "description": "Review of p-n junction theory, depletion layer width and junction capacitance, Schottky barrier diodes, pin diodes and applications in switches and phase shifters, varactors and step recovery diodes, tunnel diodes and circuits, Gunn devices and circuits, avalanche diodes, IMPATT, TRAPATT and BARRITT diodes, microwave bipolar junction transistors (BJT) and field effect transistors (FET), small signal amplifier design, new devices like HEMT and Si-Ge devices, traveling wave tubes and klystrons.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5060": {
        "name": "EECE.5060 Antenna Theory and Design (Formerly 16.506)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5060/",
        "id": "003262",
        "description": "An introduction to properties of individual antennas and arrays of antennas. Retarded potentials, dipoles of arbitrary length, radiation pattern, gain, directivity, radiation resistance. The loop antenna. Effects of the earth. Reciprocity, receiving antennas, effective length and area. Moment methods. Arrays: collinear, broadside, endfire. Array synthesis. Mutual coupling. Log-periodic and Yagi arrays. Radiation from apertures: the waveguide horn antenna, parabolic dish. Antenna noise temperature. Numerical software packages. A design project is required in the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.4610 Emag Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4610"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5070": {
        "name": "EECE.5070 Electromagnetic Materials and Waves (Formerly 16.507)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5070/",
        "id": "003263",
        "description": "This is a graduate core course, which serves the needs of students who study electromagnetics as a basis for a number of electromagnetic technologies including photonic technologies. Study of Electromagnetic Wave Interactions with Bounded Simple Media: transmission lines, Green's function, fibers, conducting waveguides and cavity resonators, Plane waves in Complex Electromagnetic Materials: plasmas, dispersive dielectrics, mixing formulas, optical waves in metals, super conductors, chiral media, crystals, magnetized plasma and time-varying media, layered and periodic media.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5080": {
        "name": "EECE.5080 Quantum Electronics for Engineers (Formerly 16.508)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5080/",
        "id": "003264",
        "description": "Introduction to the fundamental postulates of quantum theory: Planck's quantization hypothesis; wave-particle duality; time-dependent & time-independent Schrodinger's Equation; simple quantum mechanical systems. Radiation and quanta; quantization of the radiation field and cavity modes; absorption and emission of radiation; coherence functions; coherent states; importance of quantum fluctuations and quantum nature of light; laser amplifiers and amplifier nonlinearity; electromagnetics and quantum theory of laser oscillators; photons in semiconductors; semiconductor photon sources and detectors.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5090": {
        "name": "EECE.5090 Linear Systems Analysis (Formerly 16.509)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5090/",
        "id": "003265",
        "description": "Correlation and Circular convolutions. Concepts of orthogonality and Gramm-Schmidt orthogonalization procedure. Fourier series and Fourier transforms (FT): convergence properties; applications to linear systems including modulation, sampling and filtering. Hilbert transforms (HT) and analytic signals. Bilateral Laplace transforms (LT): convergence properties. Contour integration methods applied to FT, HT and LT. Discrete-time Fourier series and Fourier transforms including complex convolution: applications to linear systems. Discrete Fourier transforms and Fast Fourier algorithm. Ztransforms: convergence properties, solution of difference equations, application to linear systems. Correlation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5100": {
        "name": "EECE.5100 Digital Signal Processing (Formerly 16.510)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5100/",
        "id": "003266",
        "description": "Review of Z-Transforms and solutions of linear difference equations. Digital filter structures, parameter quantization effects and design techniques. FFT and Chirp Z-Transform methods. Discrete Hilbert Transforms, minimum-phase sequences and their application to Homomorphic Signal Processing and calculation of Complex Cepstrum.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5110": {
        "name": "EECE.5110 Medical Diagnostic Imaging (Formerly 16.511 & IB.511)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5110/",
        "id": "003267",
        "description": "This course covers the physics and electrical engineering aspects of how signals are acquired from which images will be formed, and the principal methods by which the signals are processed to form useful medical diagnostic images. Modalities studied include: x-rays, ultra-sound, computed tomography, and magnetic resonance imaging. The principles of signal processing via Fourier transform will be reviewed.  Noise and other artifacts that degrade the medical diagnostic of images are considered. MATLAB is heavily used in simulation and verification.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5120": {
        "name": "EECE.5120 Mixed-Signal VLSI Design (Formerly 16.512)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5120/",
        "id": "036394",
        "description": "The course covers a wide spectrum of topics related to challenges in modern VLSI design.  Students will learn the skills of overcoming these problems when two opposing signal domains are integrated onto a single chip.  Understanding physical layout representation and the effects of alternative layout solutions on circuit and system specifications is critical in modern designs.  Students will learn to use the CAD tools widely used by the  semiconductor industry for layout, schematic capture, advanced simulation, parasitic extraction,  floorplanning and place and route.  specifically, the course provides a review of fundamentals of  semiconductor components.  In the next step, basic building blocks of digital and analog design are described.  The course concludes with challenges of large scale integration under varying operation conditions.  An individual project involving a layout design from specification to implementation is included.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5130": {
        "name": "EECE.5130 Control Systems (Formerly 16.513)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5130/",
        "id": "003268",
        "description": "System representations, state variables, transfer functions, controllability and observability, phase variables, canonical variables, representation of nonlinear systems, Lagrange's equations, generalized co-ordinates, time response of linear systems, state transition matrix, Sylvester's expansion theorem, stability and state function of Liapunov, transient behavior estimation, optimal control, state function of Pontryagin, variational calculus, Hamilton Jacobi method, matrix Riccati equation, linear system synthesis.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.4130 Linear Feedback System.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4130"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5140": {
        "name": "EECE.5140 Integrated Power Systems (Formerly 16.414/514)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5140/",
        "id": "003227",
        "description": "Power System Operations and Electricity Markets provide a comprehensive overview to understand and meet the challenges of the new competitive highly deregulated power industry.  The course presents new methods for power systems operations in a unified integrated framework combining the business and technical aspects of the restructured power industry.  An outlook on power policy models, regulation, reliability, and economics is attentively reviewed.  The course lay the groundwork for the coming era of unbundling, open access,, power marketing, self-generation, and regional transmission operations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5150": {
        "name": "EECE.5150 Power Electronics (Formerly 16.473/515 & EECE.4730/5150)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5150/",
        "id": "001267",
        "description": "A one-semester course with emphasis on the engineering design and performance analysis of power electronics converters. Topics include: power electronics devices (power MOSFETs, power transistors, diodes, silicon controlled rectifiers SCRs, TRIACs, DIACs and Power Darlington Transistors), rectifiers, inverters, ac voltage controllers, dc choppers, cycloconverters, and power supplies. The course includes a project, which requires that the student design and build one of the power electronics converters. A demonstrative laboratory to expose the students to all kinds of projects is part of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 3550 Electromechanics and EECE 3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3550"
                ],
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5160": {
        "name": "EECE.5160 Biomedical Imaging and Data Science",
        "url": "https://www.uml.edu/catalog/courses/EECE/5160/",
        "id": "041116",
        "description": "An introduction to machine learning and signal processing for medical imaging and big data analytics. Overview of medical image reconstruction, registration, denoising, deblurring, and segmentation. Machine learning: supervised vs. unsupervised methods, training, testing, and cross-validation. Statistical estimation: least squares, maximum likelihood, and Bayesian methods. Regularization, overfitting and underfitting, and bias-variance trade-off. Numerical optimization: gradient descent, preconditioning, stochastic gradient descent. Clustering and classification. Deep learning: multilayer perceptrons, convolutional neural networks, recurrent nerural networks, autoencoders, and reinforcement learning. Deep learning software suites. Application of data science tools to medical datasets.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5170": {
        "name": "EECE.5170 MMIC Design and Fabrication (Formerly 16.517)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5170/",
        "id": "003271",
        "description": "The domain of microwave monolithic integrated circuits (MMIC) design and fabrication engineer stretches from realms of device physics and microwave circuit theory in the frequency range from 300MHz to 300 GHz. The main goal of the course is to embody most of the application of the spectrum that have been deployed during the past five decades due to advances of many microwave solid -state devices. The principles of semiconductors emphasizing 1) the properties which predominate at microwave frequencies, 2) the theories for circuit design techniques required to utilize them at microwave frequencies, and 3) practical engineering applications for controlling microwave signals in amplitude and phase using semiconductors, will be treated in great details. Special emphasis will be laid on correlation of S 'parameters with microwave device parameters and their usage in designing Low-noise amplifiers, High-power amplifiers and oscillators and their integration in MMIC design.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3600 Emag Theory I ; Electrical Engineering (BS) or Computer Engineering (BS) only.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3600"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5180": {
        "name": "EECE.5180 Wireless Communications (Formerly 16.582/EECE.5820)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5180/",
        "id": "003316",
        "description": "Cellular systems and design principles, co-channel and adjacent channel interference, mobile radio propagation and determination of large scale path loss, propagation mechanisms like reflection, diffraction and scattering, outdoor propagation models, Okumura and Hata models, small scale fading and multipath, Doppler shift and effects, statistical models for multipath, digital modulation techniques QPSK, DPSK, GMSK, multiple access techniques, TDMA, FDMA, CDMA, spread spectrum techniques, frequency hopped systems, wireless systems and worldwide standards.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3630 Introduction to Probability and Random Process.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3630"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5190": {
        "name": "EECE.5190 Engineering of Submicron Machines (Formerly 16.519)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5190/",
        "id": "003273",
        "description": "Recently fabrication of Very Large Scale Integrated circuits has spun-off a new technology of micro-machines (MEMS) and sensors on a semiconductor wafer. These new devices are ideally located next to a microprocessor on the same wafer or a separate chip. The data transfer to and from a miniature machine, sensor or transducer is processed and controlled on site. Topics include design of mechanical, electrical and biological transducers; properties of electronic materials; pattern generation on a semiconductor wafer; interface of a micromachine and processor; applications and markets for submicron machines.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5200": {
        "name": "EECE.5200 Computer Aided Engineering Analysis (Formerly 16.520)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5200/",
        "id": "003274",
        "description": "An advanced programming course, which considers the digital computer as a tool for solving significant engineering problems. The course is based on a specific area in engineering which will be selected from such topics as digital and image processing, spectral estimation, optimization techniques, etc. Typical algorithms related to the specific topic will be studied. User oriented programs or subroutine packages will be developed in a project.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5210": {
        "name": "EECE.5210 Real Time Digital Signal Processing (Formerly 16.521 & IB.511)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5210/",
        "id": "003275",
        "description": "This course provides an introduction to real-time digital signal processing techniques using the TMS320C3x floating point and TMS320C5x fixed point processors. The architecture, instruction set and software development tools for these processors are studied via a series of C and assembly language computer projects where real time adaptive filters, modems, digital control systems and speech recognition systems are implemented.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5230": {
        "name": "EECE.5230 Semiconductor Physics for Solid-State Electronics (Formerly 16.523)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5230/",
        "id": "003277",
        "description": "The course covers fundamental solid-state and semiconductor physics relevant for understanding electronic devices. Topics include quantum mechanics of electrons in solids, crystalline structures, band theory of semiconductors, electron statistics and dynamics in energy bands, lattice dynamics and phonons, carrier transport, and optical processes in semiconductors.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.5080 Quantum Electronics for Engineers, or equivalent (with permission of instructor).",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.5080"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5240": {
        "name": "EECE.5240 Computational Methods for Power System Analysis (Formerly 16.424/524)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5240/",
        "id": "003278",
        "description": "The course explores some of the mathematical and simulation tools used for the design, analysis and operation of electric power systems. Computational methods based on linear and nonlinear optimization algorithms are used to solve load flow problems, to analyze and characterize system faults and contingencies, and to complete economic dispatch of electric power systems. Real case studies and theoretical projects are assigned to implement the techniques learned and to propose recommendations. Different software applications will be used concurrently including ATP, PowerWorld Simulator, Aspen, MatLab with Simulink and Power System Toolbox, PSCAD, etc.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5250": {
        "name": "EECE.5250 Power Distribution Systems (Formerly 16.525)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5250/",
        "id": "003279",
        "description": "An intermediate course in analysis and operation of electrical power distribution systems using applied calculus and matrix algebra. Topics include electrical loads characteristics, modeling , metering, customer billing, voltage regulation, voltage levels, and power factor correction. The design and operation of the power distribution system components will be introduced: distribution transformers, distribution substation, distribution networks, and distribution equipment.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5260": {
        "name": "EECE.5260 Power Systems Stability and Control (Formerly 16.426/526)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5260/",
        "id": "003213",
        "description": "Stability definition and cases in power systems. System model for machine angle stability. Small signal and transient stability. Voltage stability phenomenon, its characterization. Small and large signal models for voltage stability analysis. Frequency stability and control. Compensation methods for system voltage regulation including classical and modem methods. Stability of multi-machine system.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.2020 Circuit Theory II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2020"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5270": {
        "name": "EECE.5270 Advanced VLSI Design Techniques (Formerly 16.427/527)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5270/",
        "id": "033544",
        "description": "This course builds on the previous experience with Cadence design tools and covers advanced VLSI design techniques for low power circuits.  Topics covered include aspects of the design of low voltage and low power circuits including process technology, device modeling, CMOS circuit design, memory circuits and subsystem design.  This will be a research-oriented course based on team projects.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.4690 VLSI Design, or EECE.5690 VLSI Design, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4690",
                    "EECE.5690"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5280": {
        "name": "EECE.5280 Alternative Energy Sources (Formerly 16.528)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5280/",
        "id": "003280",
        "description": "PV conversion, cell efficiency, cell response, systems and applications. Wind Energy conversion systems: Wind and its characteristics; aerodynamic theory of windmills; wind turbines and generators; wind farms; siting of windmills. Other alternative energy sources: Tidal energy, wave energy, ocean thermal energy conversion, geothermal energy, solar thermal power, satellite power, biofuels. Energy storage: Batteries, fuel cells, hydro pump storage, flywheels, compressed air.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5290": {
        "name": "EECE.5290 Electric Vehicle Technology (Formerly 16.529)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5290/",
        "id": "003281",
        "description": "Electric vehicle VS internal combustion engine vehicle. Electric vehicle (EV) saves the environment. EV design, EV motors, EV batteries, EV battery chargers and charging algorithms, EV instrumentation and EV wiring diagram. Hybrid electric vehicles. Fuel cells. Fuel cell electric vehicles. The course includes independent work.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5300": {
        "name": "EECE.5300 Introduction to Medical Image Reconstruction",
        "url": "https://www.uml.edu/catalog/courses/EECE/5300/",
        "id": "042151",
        "description": "This course provides both traditional and state-of-the-art tomographic reconstruction algorithms in a unified way. It includes analytic reconstruction, iterative reconstruction, and deep reconstruction based on the state-of-the-art deep learning techniques. This course provides fundamental knowledge for careers in medical image reconstruction.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3620 Signals and Systems I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5310": {
        "name": "EECE.5310 RF Design (Formerly 16.531)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5310/",
        "id": "003282",
        "description": "Two-port network parameters, Smith chart applications for impedance matching, transmission line structures like stripline, microstrip line and coaxial line, filter designs for low-pass, high-pass and band-pass characteristics, amplifier design based on s-parameters, bias network designs, one port and two port oscillator circuits, noise in RF systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5320": {
        "name": "EECE.5320 Computational Electromagnetics (Formerly 16.532)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5320/",
        "id": "003283",
        "description": "Formulation of electromagnetic problems for computer solution. Variational principles in electromagnetics. Method of moments. Applications in electrostatics, wire antennas, waveguides and cavities. Simple scattering problems. Finite difference methods. Finite element method.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5330": {
        "name": "EECE.5330 Microwave Engineering (Formerly 16.533)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5330/",
        "id": "003284",
        "description": "An introductory course in the analysis and design of passive microwave circuits beginning with review of time-varying electromagnetic field concepts and transmission lines. Smith Chart problems; single and double stub matching; impedance transformer design; maximally flat and Chebyshev transformers; microstrip transmission lines, slot lines, coplanar lines; rectangular and circular waveguides; waveguide windows and their use in impedance matching; design of directional couplers; features of weak and strong couplings; microwave filter design; characteristics of low-pass, high-pass, band-pass, band-stop filter designs; two-port network representation of junctions; Z and Y parameters, ABCD parameters, scattering matrix; microwave measurements; measurement of VSWR, complex impedance, dielectric constant, attenuation, and power. A design project constitutes a major part of the course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5340": {
        "name": "EECE.5340 Microwave Engineering Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5340/",
        "id": "040614",
        "description": "This lab course is offered as a practical supplement to the material taught in EECE.5330 Microwave Engineering. The students will develop skills in EM modeling (Ansys HFSS) and measurement of microwave transmission lines, waveguides and passive structures such as combiners and filters. Students will design basic microwave structures utilizing EM modeling tools, measure the resulting performance and provide justification of differences. Students will also perform basic antenna measurements of gain and patterns in an anechoic chamber. This course will consist of five three-hour labs, each requiring a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5350": {
        "name": "EECE.5350 Microwave Metrology",
        "url": "https://www.uml.edu/catalog/courses/EECE/5350/",
        "id": "040615",
        "description": "Laboratory measurement techniques that are typical of those used to characterize wireless devices and systems, including network analyzer calibration, measurements of noise in amplifiers, mixers and oscillators; measurements of distortion in amplifiers and mixers; and characterizing the dynamic range of a receiver.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5360": {
        "name": "EECE.5360 Microwave Metrology Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5360/",
        "id": "040616",
        "description": "This lab course is offered as a practical supplement to the material taught in EECE.5350 Microwave Metrology. Students will calibrate test equipment and perform measurements of the following parameters: phase noise, noise figure, intermodulation distortion, translated frequency, gain compression, and high-power characterization. Students will also perform probe measurements and demonstrate de-embedding techniques. This course will consist of five three-hour labs, each requiring a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5370": {
        "name": "EECE.5370 Microwave Systems Engineering",
        "url": "https://www.uml.edu/catalog/courses/EECE/5370/",
        "id": "040617",
        "description": "This course will explore concepts related to the design, analysis, and construction of systems and will examine the fundamental tradeoffs governing microwave system design:the hardware components and technologies that comprise working systems, the models used for characterizing the transmission and reception of signals, the physics of wave propagation and interaction, and estimation theory which seeks to separate signals from sources of error and guide algorithms for extracting information from received signals.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5380": {
        "name": "EECE.5380 Microwave Systems Engineering Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5380/",
        "id": "040618",
        "description": "This lab course is offered as a practical Supplement to the material taught in EECE.5370 Microwave Systems Engineering. The students will perform cascade analyses using measured data to compare with analysis computed from nominal values given in component specifications. Monte Carlo analyses will also be performed to predict performance variation. Students will configure test setups to illustrate signal generation, up/down conversion and signal detection. Additionally, the students will configure a radiated test setup in an anechoic chamber to measure and validate link budget calculations based on the Friis transmission equation. This course will consist of five three-hour labs, each requiring a detailed report of the results",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5410": {
        "name": "EECE.5410 Introduction to Biosensors (Formerly 16.441/541)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5410/",
        "id": "033545",
        "description": "This course introduces the theory and design of biosensors and their applications for pathology, pharmacogenetics, public health, food safety civil defense, and environmental monitoring.  Optical, electrochemical and mechanical sensing techniques will be discussed.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5430": {
        "name": "EECE.5430 Theory of Communication (Formerly 16.543)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5430/",
        "id": "003288",
        "description": "Information transmission and deterministic signals in time and frequency domains. Relationship between correlation and power or energy spectra. Statistical properties of noise. Spectral analysis and design of AM, FM and pulse modulation systems, continuous and discrete. AM, FM, and various pulse modulation methods, in the presence of noise. Digital modulation & demodulation technique.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE 3620 Signals & Systems I and EECE 3630 Introduction to Probability and Random Processes",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3620"
                ],
                [
                    "EECE.3630"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5440": {
        "name": "EECE.5440 Computational Data-Driven Modeling I",
        "url": "https://www.uml.edu/catalog/courses/EECE/5440/",
        "id": "040889",
        "description": "Computational Data-Driven Modeling (CDM) I is the first in a sequence of two courses designed to introduce the student to basics skills in exploratory data analysis and data-driven computational modeling using foundational concepts drawn from linear algebra, probability, statistics, random processes, time-series analysis and dynamical systems. In CDM-1 students will learn to apply regression and classification algorithms on multivariate data and assess performance of these models. An interactive project-driven approach is taken using the Python programming platform and its associated open-source libraries for statistical modeling, data analysis and machine-learning. A review of the tools and techniques from probability and statistics will be undertaken.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5450": {
        "name": "EECE.5450 Analog Devices and Techniques (Formerly 16.445/565 & EECE.4450/5650)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5450/",
        "id": "001266",
        "description": "A survey of analog devices and techniques, concentrating on operational amplifier design and applications. Operational amplifier design is studied to reveal the limitations of real opamps, and to develop a basis for interpreting their specifications. Representative applications are covered, including: simple amplifiers, differential and instrumentation amplifiers, summers, integrators, active filters, nonlinear circuits, and waveform generation circuits. A design project is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: EECE.3660 Electronics II.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3660"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5460": {
        "name": "EECE.5460 Communication Networks (Formerly 16.546)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5460/",
        "id": "003291",
        "description": "An in depth survey of the elements of the modern computer based telecommunications system. Discussion of media used to transport voice and data traffic including twisted pair, baseband and broadband coaxial cable, fiber optic systems and wireless systems. Techniques for sending data over the media are presented including modems, baseband encoding, modulation and specific cases such as DSL, cable modems, telephone modems. Architecture and functionality of telephone system that serves as backbone for moving data, including multiplexing, switching, ATM, ISDN, SONET. Layered software architectures are discussed including TCP/IP protocol stack and the ISO/OSI seven layer stacks are examined in depth from data link protocols to transport protocols. LAN and WAN architectures including media access control (MAC) techniques are discussed for Ethernet, token ring and wireless LAN applications. Internetworking protocols and the role of repeaters, routers, and bridges. Voice over IP and state of the art applications.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5470": {
        "name": "EECE.5470 Computational Data-Driven Modeling II",
        "url": "https://www.uml.edu/catalog/courses/EECE/5470/",
        "id": "040890",
        "description": "Computational Data-Driven Modeling (CDM) II is the second in a sequence of two courses designed to introduce the student to skills in exploratory data analysis and data-driven computational modeling. CDM-II extends the students' knowledge on application of regression and classification algorithms in CDM-1 to more complex structures such as Bayesian networks and Hidden-Markov models. The focus will be on time-varying data using time-series and stat-space models such as Kalman filters, Markov Processes and Particle filters for prediction and forecasting. The application of neural networks and deep-learning will be discussed. Students will undertake case-studies in data analytics with collaboration from professionals in industry.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.5440 Computational Data-Driven Modeling I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.5440"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5480": {
        "name": "EECE.5480 Coding and Information Theory (Formerly 16.548)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5480/",
        "id": "003293",
        "description": "Probabilistic measure of information. Introduction to compression algorithms including L-Z, MPEG, JPEG, and Huffman encoding. Determination of the information handling capacity of communication channels and fundamental coding theorems including Shannon's first and second channel coding theorems. Introduction to error correcting codes including block codes and convolutional coding and decoding using the Viterbi algorithm. Applications of information theory and coding to advanced coding modulation such as Trellis code Modulation (TCM) and turbo modulation.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5490": {
        "name": "EECE.5490 Optimization Models and Decision Analysis",
        "url": "https://www.uml.edu/catalog/courses/EECE/5490/",
        "id": "041552",
        "description": "This course addresses the prototypical theme o how a system or organization can improve its decision-making and develops approaches for both prescriptive and predictive analytics. Whether it is a service or manufacturing entity, a firm should promulgate a mission statement with three evolving parts: strategy, tactics, and operations. For example, a strategic focus is to maximize profit, a tactical plan minimizes cost, and an operations manifesto establishes feasibility. Towards this objective, this course will present introductory and applied concepts on decision-making, optimization and simulation modeling under uncertainty. Case studies will supplement the theoretical concepts and enforce student learning. Background in engineering mathematics and/or permission of instructor. Undergraduate introduction to Probability and Statistics.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5492": {
        "name": "EECE.5492 Systems, Modeling and Simulations for Digital Eng",
        "url": "https://www.uml.edu/catalog/courses/EECE/5492/",
        "id": "042152",
        "description": "This course provides a high-level view of systems thinking, systems engineering, physical system modeling and model-based systems engineering (MBSE) in the context of digital transformation initiatives taking place in government and industry. Examples of systems engineering practice are drawn from government acquisition processes. State-space models of system dynamics are introduced considering deterministic and random effects. Security primitives and threat modeling tools are reviewed and their integration during the design phased discussed. System dynamics will be simulated using MATLAB, Simulink and Python programming platforms Students will learn to implement MBSE using the systems modeling language (SySML) and supporting commercial or open-source software platforms In team-based project work, students will emulate a digital transformation of stakeholder requirements examine design trade-offs by integrating the MBSE representation with dynamic system simulations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Undergraduate Degree in Engineering, Science or Business with Calculus Knowledge.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5494": {
        "name": "EECE.5494 Model-Based Systems Engineering",
        "url": "https://www.uml.edu/catalog/courses/EECE/5494/",
        "id": "042153",
        "description": "This course provides experiential learning in implementing Model-Based Systems Engineering (MBSE) from an applications perspective. Principles of systems thinking and practices in design of engineered systems are discussed. The mapping of systems engineering stages to a model-based graphical representation in undertaken with the systems modeling (SysML) language and supporting programming platforms. Model-based representation of stakeholder requirement, use-cases and scenarios, system and interface architecture will be learnt through case studies drawn from mission operations. MBSE practitioners will present their best practices for integrating respective models for verification, validation, traceability and presentation to teams with differing backgrounds and expertise.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.5492 Systems, Modeling and Simulation for Digital Eng.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.5492"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5496": {
        "name": "EECE.5496 Cyber-Physical Systems Modeling and Simulation",
        "url": "https://www.uml.edu/catalog/courses/EECE/5496/",
        "id": "042154",
        "description": "Physical systems and their interactions with embedded digital sub-systems and communication networks are analyzed by representing them in the context of cyber-physical systems (CPS). Related concepts of system control, hybrid dynamical systems and state estimation are presented. The application of the CPS model as a digital twin and approaches for representing the model across it's lifecycle are explored. The specification of functional, behavioral and security requirements for CPS using a model-based systems engineering framework is undertaken. The performance verification with multiphysics models and simulation experiments are conducted. Particular focus will be on the verifying correctness of algorithms that control the CPS and challenges in bridging continuous and discrete event based systems that comprise a CPS.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.5492 Systems, Modeling and Simulation for Digital Eng.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.5492"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5498": {
        "name": "EECE.5498 Data-Driven Models, Decision Making, and Risk Mgmt",
        "url": "https://www.uml.edu/catalog/courses/EECE/5498/",
        "id": "042155",
        "description": "This course addresses the application of data recorded from models, simulation or measurements for prediction, inference of estimation of system behavior. Students are introduced to AI/machine learning algorithms, data visualization and data analytics. The focus will be on the analysis of decisions driven by data and models using concepts of decision trees, multi-objective models and game theory. Methods for estimating costs and managing risks across the lifecycle of the system will be discussed. Case studies will be drawn from the government and industry that highlight mission statements with proposed strategy, tactics and operations. Optimization methods that address these directives with associated uncertainty parameters will be explored in team-based projects.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.5492 Systems, Modeling and Simulation for Digital Eng.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.5492"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5500": {
        "name": "EECE.5500 Advanced Digital System Hardware Design (Formerly 16.550)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5500/",
        "id": "030320",
        "description": "Design of logic machines. Finite state machines, gate array designs, ALU and 4 bit CPU unit designs, micro-programmed systems. Hardware design of advanced digital circuits using XILINX. Application of probability and statistics for hardware performance, and upgrading hardware systems. Laboratories incorporate specification, top-down design, modeling, implementation and testing of actual advanced digital design systems hardware. Laboratories also include simulation of circuits using VHDL before actual hardware implementation and PLDs programming.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2650 Logic Design, and EECE.3650 Electronics I, and EECE.3110 Electronics I Lab, and EECE.3170 Microprocessor Systems Design I, or permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2650"
                ],
                [
                    "EECE.3650"
                ],
                [
                    "EECE.3110"
                ],
                [
                    "EECE.3170"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5510": {
        "name": "EECE.5510 Heterogeneous Computing (Formerly EECE.6540)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5510/",
        "id": "040099",
        "description": "This course introduces heterogeneous computing architecture and the design and optimization of applications that best utilize the resources on such platforms. The course topics include heterogeneous computer architecture, offloading architecture/API, platform memory and execution models, GPU/FPGA acceleration, OpenCL programming framework, Data Parallel C++ programming framework, performance analysis and optimization. Labs are included to practice design methodology and development tools.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2160 ECE Application Programming, or EECE.4821 Computer Architecture and Design, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160",
                    "EECE.4821"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5520": {
        "name": "EECE.5520 Microprocessor Systems II & Embedded Systems (Formerly 16.552)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5520/",
        "id": "003295",
        "description": "CPU architecture, memory interfaces and management, coprocessor interfaces, bus concepts, bus arbitration techniques, serial I/O devices, DMA, interrupt control devices. Including Design, construction, and testing of dedicated microprocessor systems (static and real-time). Hardware limitations of the single-chip system. Includes micro-controllers, programming for small systems, interfacing, communications, validating hardware and software, microprogramming of controller chips, design methods and testing of embedded systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5530": {
        "name": "EECE.5530 Software Engineering (Formerly 16.553)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5530/",
        "id": "003296",
        "description": "Introduces software life cycle models, and engineering methods for software design and development. Design and implementation, testing, and maintenance of large software packages in a dynamic environment, and systematic approach to software design with emphasis on portability and ease of modification. Laboratories include a project where some of the software engineering methods (from modeling to testing) are applied in an engineering example.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5540": {
        "name": "EECE.5540 Data Intensive Computing",
        "url": "https://www.uml.edu/catalog/courses/EECE/5540/",
        "id": "041900",
        "description": "This course deals with various topics in data-intensive computing to address challenges in managing large-scale data and methods for extracting values from big data. Specifically, we explore stat-of-the-art techniques to build parallel systems and applications for scalable data analysis on a massive and complex dataset, those from scientific and engineering problems. Topics include: 1) Storage requirements of big data; 2) parallel and distributed computing systems in both high-performance computing (HPC) and commercial domains; 3) Data-parallel frameworks such as MapReduce/Hadoop/Spark; 4) parallel file systems such as HDFS/Lustre; 5) NoSQL data models such as Dynamo/BigTable/Cassandra; and 6) time-series data models such as InfluxDB/Prometheus.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.4520 Microprocessor Systems II & Embedded Systems, or EECE.4811 Operating Systems, or EECE.4821 Computer Architecture & Design, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4520",
                    "EECE.4811",
                    "EECE.4821"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5550": {
        "name": "EECE.5550 Computer System Security",
        "url": "https://www.uml.edu/catalog/courses/EECE/5550/",
        "id": "042157",
        "description": "An introduction to computer system security. This course introduces the threats and vulnerabilities in computer systems. This course covers the elementary cryptography, program security, security in operating system, database security, legal, ethical and privacy issues in computer system security,",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3220 Data Structures.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5560": {
        "name": "EECE.5560 Fundamentals of Robotics (Formerly 16.556)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5560/",
        "id": "003298",
        "description": "The material in this course is a combination of essential topics, techniques, algorithms, and tools that will be used in future robotics courses. Fundamental topics relevant to robots (linear algebra, numerical methods, programming) will be reinforced throughout the course using introductions to other robotics topics that are each worthy of a full semester of study (dynamics, Kinematics, controls, planning, sensing). Students will program real robots to further refine their skills and experience the material fully.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5570": {
        "name": "EECE.5570 Fundamentals of the Internet of Things",
        "url": "https://www.uml.edu/catalog/courses/EECE/5570/",
        "id": "042245",
        "description": "Explores the foundations and technologies involved in Internet of Things (IoT) from an industry perspective. Topics include Machine to Machine (M2M) communication and Wireless Sensor Networks (WSNs) and their relationship with IoT as well as their evolution. This involves all three main elements: (1) devices, (2) communications/networks and (3) analytics/applications. Specifically, it introduces technologies and interfaces associated with sensing and actuation on embedded devices and presents the fundamentals of IoT analytics including machine learning and rule-based AI. The bulk of the content presented in the course is focused on the industry-led standardization of IoT communication and networking mechanisms.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5590": {
        "name": "EECE.5590 Introduction to Nanoelectronics (Formerly 16.459/559)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5590/",
        "id": "037745",
        "description": "This course introduces the use of nanomaterials for electronic devices such as sensors and transistors.  Synthesis methods for nanoparticles, nanotubes, nanowires, and 2-D materials such as graphene will be covered.  The challenges in incorporating nanomaterials into devices will also be discussed.  These methods will be compared to techniques used in the semiconductor industry and what challenges, technically and financially, exist for their widespread adoption will be addressed.  Finally, examples of devices that use nanomaterials will be reviewed.  The course will have some hands on demonstrations.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5600": {
        "name": "EECE.5600 Biomedical Instrumentation (Formerly 16.460/560)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5600/",
        "id": "003231",
        "description": "A survey of biomedical instrumentation that leads to the analysis of various medical system designs and the related factors involved in medical device innovation. In addition to the technical aspects of system integration of biosensors and physiological transducers there will be coverage of a biodesign innovation process that can translate clinical needs into designs. A significant course component will be project-based prototyping of mobile heath applications. The overall goals of the course are to provide the theoretical background as well as specific requirements for medical device development along with some practical project experience that would thereby enable students to design electrical and computer based medical systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "ECE senior/grad or BMEBT student",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5620": {
        "name": "EECE.5620 VHDL/Verilog Synthesis & Design (Formerly 16.562)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5620/",
        "id": "003302",
        "description": "This course covers digital chip design, synthesis, verification, and test using Hardware Description Languages (HDLs). This class will thoroughly cover important features of the following Hardware Description Languages (HDLs): Verilog, VHDL (VHSIC Hardware Description Language) and System Verilog. These HDLs will be presented with primary emphasis on the synthesizable design aspects of the languages. Therefore, these HDLs will be used for chip design. In addition to using HDLs for digital design, these HDLs will also be used for design verification. Hardware Description Languages (HDLs) will be utilized to design, synthesize and verify digital chip designs. The design and structure of HDL code for effective FPGA and ASIC synthesis will be explored. The design process and verification process for FPGAs and ASICs will be thoroughly reviewed. The Synthesis process for FPGAs and ASICs will thoroughly reviewed, including the following: step by step synthesis process flows, the impact of synthesis constraints, and synthesis scripts for FPGA and ASIC design. Key concepts in functional design verification for ASICs & FPGAs will be explored. Other topics may include the following: High speed digital design, interface to SDRAM devices, embedded processors (hardware, software, test implications), HDL design techniques for effective logic synthesis, chip partitioning, ASIC and FPGA top-down design structure, pipelining, resource/speed trade offs, high speed DSP structures, high speed cache design, resources sharing and design of arbiters. Additional topics to be covered include the following: Design for Test (DFT), Memory Built in Self Test, Logic Built in Self Test, scan chain design, shadow scan design, JTAG, observability bus design, test vector generation & fault coverage.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Reqs: EECE 2650 Intro Logic Design and EECE 3650 Electronics I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2650"
                ],
                [
                    "EECE.3650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5625L": {
        "name": "EECE.5625L VHDL/Verilog Synthesis & Design Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5625L/",
        "id": "041760",
        "description": "This lab course is offered to provide the student practical applications of advanced FPGA topics. The lab will focus on advanced language constructs and effective coding for synthesis. Timing closure techniques and synthesis optimization for speed vs power will be explored. Features of synthesis tools including partial reconfiguration, tool reports and clock domain crossing will be evaluated. This course will consist of seven 2-hour labs, each requiring either completion of a worksheet or a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5680": {
        "name": "EECE.5680 Electro Optic Systems (Formerly 16.568)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5680/",
        "id": "003305",
        "description": "Introduction to optoelectronics and laser safety; geometrical optics; waves and polarization; Fourier optics; coherence of light and holography; properties of optical fibers; acousto-optic and electro-optic modulation; elementary quantum concepts and photon emission processes; optical resonators; Fabry Perot etalon; laser theory and types; review of semiconductor lasers and detectors; nonlinear optics.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5690": {
        "name": "EECE.5690 VLSI Design (Formerly 16.469/502 & EECE.4690/5020)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5690/",
        "id": "001268",
        "description": "Introduction to CMOS circuits including transmission gate, inverter, NAND, NOR gates, MUXEs, latches and registers. MOS transistor theory including threshold voltage and design equations. CMOS inverter's DC and AC characteristics along with noise margins. Circuit characterization and performance estimation including resistance, capacitance, routing capacitance, multiple conductor capacitance, distributed RC capacitance, multiple conductor capacitance, distributed RC capacitance, switching characteristics incorporating analytic delay models, transistor sizing and power dissipation. CMOS circuit and logic design including fan-in, fan-out, gate delays, logic gate layout incorporating standard cell design, gate array layout, and single as well as two-phase clocking. CMOS test methodologies including stuck-at-0, stuck-at-1, fault models, fault coverage, ATPG, fault grading and simulation including scan-based and self test techniques with signature analysis. A project of modest complexity would be designed to be fabricated at MOSIS.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5700": {
        "name": "EECE.5700 Radar Systems Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5700/",
        "id": "040619",
        "description": "This lab course is offered as a practical supplement to the material taught in EECE.5710 Radar Systems. Students will build functional radar using a COTS-based radio system to demonstrate the detection of canonical targets (plates, spheres, corner reflectors) of known radar cross sections. This course will consist of five three-hour labs, each requiring a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5710": {
        "name": "EECE.5710 Radar Systems (Formerly 16.571)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5710/",
        "id": "003307",
        "description": "Introduction to both pulsed and C. W. radar systems. Detection of radar echoes in noise. The radar equation and its use in estimating performance of a radar system. Estimation of range, direction and velocity of targets. Moving target indicators (MTI). Pulse compression and other advanced techniques. Discussion of elements of practical radar systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5720": {
        "name": "EECE.5720 Embedded Real Time Systems (Formerly 16.572)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5720/",
        "id": "003308",
        "description": "Designing embedded real-time computer systems. Types of real-time systems, including foreground/background, non-preemptive multitasking, and priority-based pre-emptive multitasking systems. Soft vs. hard real time systems. Task scheduling algorithms and deterministic behavior. Ask synchronization: semaphores, mailboxes and message queues. Robust memory management schemes.  Application and design of a real-time kernel. A project is required.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5740": {
        "name": "EECE.5740 Advanced Logic Design (Formerly 16.574)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5740/",
        "id": "003310",
        "description": "Error detection and correction codes. Minimization of switching functions by Quine-McCluskey (tabular) methods. Minimization of multiple-output circuits. Reed-Muller polynomials and exclusive-OR circuits. Transient analysis of hazards. Hazard-free design. Special properties of switching algebra. Programmable logic devices. Analysis and synthesis of fundamental-mode and pulsed-mode sequential circuits. Test sets and design for testability.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5750": {
        "name": "EECE.5750 Field Programmable Gate Arrays Logic Design Techniques (Formerly 16.575)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5750/",
        "id": "003311",
        "description": "Advanced logic design techniques using field programmable gate arrays (FPGAs), programmable logic devices, programmable array logic devices, and other forms of reconfigurable logic. Architectural descriptions and design flow will be covered as well as rapid prototyping techniques, ASIC conversions, in-system programmability, high level language design techniques, and case studies highlighting the tradeoffs involved in designing digital systems with programmable devices. This course is generally offered summers only.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5755": {
        "name": "EECE.5755 FPGA Logic Design Techniques Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5755/",
        "id": "041503",
        "description": "This lab course is offered to provide the student with the practical skills required to design and implement an FPGA. The student will design commonly used FPGA structures such as state machines and data processing elements and learn how to include library components such as FIFOs, memory interfaces and computer/debug interfaces. The student will work through all phases of development: coding, simulation, building and testing the FPGA on hardware. This course will consist of seven 2-hour labs, each requiring either completion of a worksheet or a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "Co-req: EECE.5750 FPGA Logic Design Techniques.",
        "requirements": {
            "prerequisites": [],
            "corequisites": [
                [
                    "EECE.5750"
                ]
            ]
        }
    },
    "EECE.5760": {
        "name": "EECE.5760 Principles of Solid State Devices (Formerly 16.576)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5760/",
        "id": "003312",
        "description": "This course introduces the operating principles of Solid State Devices. Basic semiconductor science is covered including crystalline properties, quantum mechanics principles, energy bands and the behavior of atoms and electrons in solids. The transport of electrons and holes (drift and diffusion) and the concepts of carrier lifetime and mobility are covered. The course describes the physics of operation of several semiconductor devices including p-n junction diodes (forward/reverse bias, avalanche breakdown), MOSFETs (including the calculation of MOSFFET threshold voltages), bipolar transistor operation, and optoelectronic devices (LED;, lasers, photodiodes).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5770": {
        "name": "EECE.5770 Verification of Digital Systems (Formerly 16.577)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5770/",
        "id": "003313",
        "description": "The increasing complexity of digital designs coupled with the requirement for first pass success creates a need for an engineered approach to verification. This course defines the goals for verification, presents techniques and applications, and develops a framework for managing the verification process from concept to reality.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Graduate Level.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5775L": {
        "name": "EECE.5775L Verification of Digital Systems Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/5775L/",
        "id": "041758",
        "description": "This lab course is offered to provide the student with the practical skills to verify an FPGA design in simulation environment. The student will build various components of a test environment beginning with a basic testbench using manual verification and progressing to a more robust self-checking test environment. This includes generating constrained random stimulus and predicting, monitoring, and checking responses. The students will also create a regression test suite and evaluate coverage. This course will consist of seven 2-hour labs, each requiring either completion of a worksheet or a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5780": {
        "name": "EECE.5780 Modeling and Implementation of Digital Systems using MATLAB",
        "url": "https://www.uml.edu/catalog/courses/EECE/5780/",
        "id": "040100",
        "description": "The course covers the methodology and tools to design digital systems with MATLAB. Topics include algorithm design and analysis with MATLAB, MATLAB Simulink development, conversion from algorithm to VHDL implementation, synthesis to FPGA and performance evaluation. Labs are included to practice design methodology and tools with FPGA or other platforms.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2160 ECE Application Programming, and EECE 2650 Logic Design.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.2650"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5800": {
        "name": "EECE.5800 Robotics, Automation and Machine Intelligence (Formerly 16.580)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5800/",
        "id": "035618",
        "description": "Covers advanced foundations and principles of robotic manipulation; includes the study of advanced robot motion planning, task level programming and architectures for building perception and systems for intelligent robots.  Autonomous robot navigation and obstacle avoidance are addressed.  Topics include computational models of objects and motion, the mechanics of robotic manipulators, the structure of manipulator control systems, planning and programming of robot actions.  Components of mobile robots, perception, mechanism, planning and architecture; detailed case studies of existing systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5811": {
        "name": "EECE.5811 Operating Systems (Formerly 16.573/EECE.5730)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5811/",
        "id": "003309",
        "description": "Covers the components, design, implementation, and internal operations of computer operating systems. Topics include basic structure of operating systems, Kernel, user interface, I/O device management, device drivers, process environment, concurrent processes and synchronization, inter-process communication, process scheduling, memory management, deadlock management and resolution, and file system structures. laboratories include examples of components design of a real operating systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2160 ECE Application Programming, and EECE.3170 Microprocessor System Design I, and EECE.3220 Data Structures, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.3170"
                ],
                [
                    "EECE.3220"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5821": {
        "name": "EECE.5821 Computer Architecture and Design (Formerly 16.561/EECE.5610)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5821/",
        "id": "003301",
        "description": "Structure of computers, past and present: first, second, third and fourth generation. Combinatorial and sequential circuits. Programmable logic arrays. Processor design: information formats, instruction formats, arithmetic operations and parallel processing. Hardwired and microprogrammed control units. Virtual, sequential and cache memories. Input-output systems, communication and bus control. Multiple CPU systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5830": {
        "name": "EECE.5830 Network Design: Principles, Protocols and Applications (Formerly 16.583)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5830/",
        "id": "003317",
        "description": "Covers design and implementation of network software that transforms raw hardware into a richly functional communication system. Real networks (such as the Internet, ATM, Ethernet, Token Ring) will be used as examples. Presents the different harmonizing functions needed for the interconnection of many heterogeneous computer networks. Internet protocols, such as UDP, TCP, IP, ARP, BGP and IGMP, are used as examples to demonstrate how internetworking is realized. Applications such as electronic mail and the WWW are studied.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5840": {
        "name": "EECE.5840 Probability and Random Processes (Formerly 16.584)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5840/",
        "id": "003318",
        "description": "Sample space, Field and Probability Measure. Axiomatic definition of Probability. Bayes' theorem. Repeated trials. Continuous and discrete random variables and their probability distribution and density functions. Functions of random variables and their distribution and density functions. Expectation, variance and higher order moments. Characteristic and generating functions. Vector formulation of random variables and their parameters. Mean square estimation and orthogonality principle. Criteria for estimators. Introduction to random processes: distribution and density functions; Ensemble and time averages; correlation functions and spectral densities. Classification of random processes. Random processes through linear systems. Weiner filters and Kalman filters.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5841": {
        "name": "EECE.5841 Computer Vision and Digital Image Processing (Formerly 16.581/EECE.5810)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5841/",
        "id": "003315",
        "description": "Introduces the principles and the fundamental techniques for Image Processing and  Computer Vision. Topics include programming aspects of vision, image formation and representation, multi-scale analysis, boundary detection, texture analysis, shape from shading, object modeling, stereo-vision, motion and optical flow, shape description and objects recognition (classification), and hardware design of video cards. AI techniques for Computer Vision are also covered. Laboratories include real applications from industry and the latest research areas.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-req; EECE 2160 ECE Application Programming, and EECE 3620 Signals and Systems or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2160"
                ],
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5850": {
        "name": "EECE.5850 Fundamentals of Network and Cyber Security (Formerly 16.658 and EECE.6580)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5850/",
        "id": "003351",
        "description": "This course will cover two categories of topics: One part is the fundamental principles of cryptography and its applications to network and communication security in general. This part focuses on cryptography algorithms and the fundamental network security enabling mechanisms. Topics include attack analysis and classifications, public key cryptography (RSA, Diffie-Hellman), secret key cryptography (DES, IDEA), Hash (MD5, SHA-1) algorithms, key distribution and management, security handshake pitfalls and authentications, and well known network security protocols such as Kerberos, IPSec, SSL/SET, PGP & PKI, WEP. The second part reviews unique challenges and the security & privacy solutions for the emerging data/communication/information/computing networks (e.g., Ad Hoc & sensor network, IoT, cloud and edge computing, big data, social networks, cyber-physical systems, critical infrastructures such as smart grids and smart transportation systems, etc.).",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.2460 Intro to Data Communication Networks, or EECE.4830 Network Design: Principles, Protocols and Applications, or Permission of Instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.2460",
                    "EECE.4830"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5900": {
        "name": "EECE.5900 Fiber Optic Communication (Formerly 16.590)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5900/",
        "id": "003322",
        "description": "Optical fiber; waveguide modes, multimode vs single mode; bandwidth and data rates; fiber losses; splices, couplers, connectors, taps and gratings; optical transmitters; optical receivers; high speed optoelectronic devices; optical link design; broadband switching; single wavelength systems (FDDI, SONET, ATM); coherent transmission; wavelength division multiplexing and CDMA; fiber amplifiers.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5930": {
        "name": "EECE.5930 Industrial Experience (Formerly 16.593)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5930/",
        "id": "003324",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5950": {
        "name": "EECE.5950 Solid State RF Electronics (Formerly 16.595)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5950/",
        "id": "032955",
        "description": "This course provides a physical understanding of advanced solid-state devices with an emphasis on high-speed designs for RF applications.  Topics include semiconductor heterostructures, heterojunction bipolar transistors, field-effect transistors, high-electron-mobility transistors, hot-electron devices, charge transport, quantum confinement effects, and small-signal analysis.  Technologies to be discussed draw from group IV elemental semiconductors (silicon, germanium), group III-V compound semiconductor families (arsenides, phosphides, nitrides), and emerging oxide materials.  Case studies of state-of-the-art examples taken from the literature will be used to motivate more in-depth discussions.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req EECE.4740 Principles of Solid State Devices and & EECE.5230 Introduction of Solid State Electronics, and undergraduate-level courses in solid-state physics and quantum mechanics, or permission of instructor.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4740"
                ],
                [
                    "EECE.5230"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.5980": {
        "name": "EECE.5980 Seminar for Teaching Assistants (Formerly 16.598)",
        "url": "https://www.uml.edu/catalog/courses/EECE/5980/",
        "id": "037927",
        "description": "This course will meet once per week and attendance in mandatory for all TAs.  The course will cover an overview of laboratories for the following week.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.5990": {
        "name": "EECE.5990 Thesis Review",
        "url": "https://www.uml.edu/catalog/courses/EECE/5990/",
        "id": "040548",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6010": {
        "name": "EECE.6010 Graduate Seminar (Formerly 16.601)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6010/",
        "id": "003326",
        "description": "There will be a series of seminars by distinguished researchers form academia and industry in addition to UML faculty. Moreover, there will be seminars dedicated to instructional sessions in library services, introduction to Department and Faculty research, and information on thesis requirements and professional ethics.  Attendance is mandatory for doctoral and MS students with thesis option. The students are required to write short reports summarizing the talk after each seminar.  This course is offered in the fall semester.",
        "credits": {
            "min": "0",
            "max": "0"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6120": {
        "name": "EECE.6120 Converged Voice and Data Network (Formerly 16.612)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6120/",
        "id": "033547",
        "description": "Covers the tecxhnologies and protocols used to transport voice and data traffic over a common communication network, with emphasis on voice over IP (VoIP).  The specific topics covered include voice communication network fundamentals, data networking fundamentals, voice packet processing, voice over packet networking, ITU-T VoIP arcxhitecture, IETF VoIP architecture, VoIP over WLAN,m access networks for converged services: xDSL and HFC networks, and IP TV service.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Pre-Req: 16.546 Computer Telecomm, or Instructor permission.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6150": {
        "name": "EECE.6150 Medical Image Reconstruction",
        "url": "https://www.uml.edu/catalog/courses/EECE/6150/",
        "id": "040203",
        "description": "This course will deliver the students both traditional and state-of -the-art algorithms in a unified way, which can make the students qualify for a medical image reconstruction engineer. The topics includes central slice theorem, 2D parallel-beam, 2D fan-beam and 3D cone-beam reconstruction algorithms in terms of analytic and iterative methods. It will cover the state-of-the-art Katsevich algorithm, interior tomography, compressive sensing, and spectral CT.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.3620 Signals and Systems I.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.3620"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.6160": {
        "name": "EECE.6160 Computational Power Systems Analysis (Formerly 16.616)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6160/",
        "id": "003339",
        "description": "Power system matrics, power flow studies, fault studies, state estimation, optimal power dispatch, and stability studies.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6170": {
        "name": "EECE.6170 Modelling Of Communication Networks (Formerly 16.617)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6170/",
        "id": "003340",
        "description": "Overview of general architectures for B-ISDN and Internet, network layering, signaling, performance requirements, traffic management strategies, usage parameter control, connection admission control, congestion control, stochastic processes, Markov chains and processes, stochastic models for voice, video and data traffic, Poisson processes, Markov-modulated processes, traffic analysis, queuing systems, M/M/1, M/M/m, M/G/1 queues, fluid buffer models, effective band-width approaches, simulation modeling, discrete event simulation of transport and multiplexing protocols using OPNET software, statistical techniques for validation and sensitivity analysis.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6500": {
        "name": "EECE.6500 Advanced Computing Systems Hardware Architecture (Formerly 16.650)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6500/",
        "id": "033546",
        "description": "Covers the latest advanced techniques in CPU design, floating point unit design, vector processors, branch prediction, shared memory versus networks, scalable shared memory systems, Asynchronous shared memory algorithms, systems performance issues, advanced prototype hardware structures, and future trends including TeraDash systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6510": {
        "name": "EECE.6510 Advanced Embedded System Design with FPGA",
        "url": "https://www.uml.edu/catalog/courses/EECE/6510/",
        "id": "003345",
        "description": "This course covers the topics related to FPGA based embedded systems, including microprocessor architectures, embedded system architecture, firmware, bootloader, JTAG etc., bare metal processor vs embedded OS, ard core and soft core IP's, interconnects between processor and FPGA, buses and interfaces, and external devices such as sensors and cameras. Labs are included for practice the design of FPGA based embedded systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "EECE.4820 or EECE.5610 Computer Architecture & Design, and EECE.4800 or EECE.5520 Microprocessor Systems II & Embedded Systems.",
        "requirements": {
            "prerequisites": [
                [
                    "EECE.4820",
                    "EECE.5610"
                ],
                [
                    "EECE.4800",
                    "EECE.5520"
                ]
            ],
            "corequisites": []
        }
    },
    "EECE.6515L": {
        "name": "EECE.6515L Advanced Embedded System Design with FPGA Lab",
        "url": "https://www.uml.edu/catalog/courses/EECE/6515L/",
        "id": "041759",
        "description": "This lab course is offered to provide the student with the practical skills required to use embedded processors in FPGAs. The student will design, implement, test, debug, and configure embedded systems in FPGAs using both soft and hard cores. Students will connect various memories, bus interfaces and external devices to build a system in an FPGA. Basic programming of the embedded processor will also be performed. This course will consist of seven 2- hour labs, each requiring either completion of a worksheet or a detailed report of the results.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6520": {
        "name": "EECE.6520 Parallel & Mp Architect (Formerly 16.652)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6520/",
        "id": "003346",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6530": {
        "name": "EECE.6530 AI and Machine Learning (Formerly 16.653)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6530/",
        "id": "003347",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6570": {
        "name": "EECE.6570 High Speed Integrated Network (Last Term 2004 Fall)(Formerly 16.657)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6570/",
        "id": "003350",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6600": {
        "name": "EECE.6600 Mobile Communication Networks (Formerly 16.660)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6600/",
        "id": "003353",
        "description": "The goal of this course is to enable students to understand communication systems that permit a user to be either continuously or intermittently connected to a communication network as he/she moves from one place to another. The key issue in these communications systems, which are referred to as mobile communication systems, is that there is provision for handling a device, service or user, over from on network to another. That is, mobility management is an essential aspect of mobile communication networks. The learning objectives of the course include enabling the student to understand mobile radio propagation, antenna and communications systems; the so-called 2G, 2.5G, 3G and 4G networks; mobile IP and mobile TCP; mobile ad hoc networks; WiMAX networks; and cognitive radio networks.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6660": {
        "name": "EECE.6660 Storage Area Networks (Formerly 16.666)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6660/",
        "id": "003359",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6690": {
        "name": "EECE.6690 Opto Electronic Devices (Formerly 16.669)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6690/",
        "id": "030326",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6870": {
        "name": "EECE.6870 Applied Stochastic Estimation (Formerly 16.687)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6870/",
        "id": "003368",
        "description": "Review of random processes and key elements of probability theory. State space description of systems and random processes, relation to frequency domain techniques. Numerical methods of continuous and discrete time random system modeling. Optimal Kalman filtering for discrete and continuous random systems. Sensitivity analysis. Design considerations in the face of model uncertainty, numerical instabilities, bad data. Optimal smoothing. Nonlinear filtering. Parameter identification. Applications throughout.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6880": {
        "name": "EECE.6880 Theoretical Acoustics (Formerly  16.688)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6880/",
        "id": "003369",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.6920": {
        "name": "EECE.6920 Directed Studies/Electrical Engineering (Formerly  16.692)",
        "url": "https://www.uml.edu/catalog/courses/EECE/6920/",
        "id": "003371",
        "description": "Provides opportunity for students to get a specialized or customized course in consultation with a faculty member.",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7100": {
        "name": "EECE.7100 Selected Topics (Formerly  16.710)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7100/",
        "id": "003376",
        "description": "Topics of current interest in electrical Engineering.  Subject matter to be announced in advance.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7110": {
        "name": "EECE.7110 Special Topics (Formerly 16.711)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7110/",
        "id": "003377",
        "description": "Topics of current interest in  Electrical Engineering.   Subject matter to be announced in advance.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7120": {
        "name": "EECE.7120 Special Topics in Electrical Engineering (Formerly 16.712)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7120/",
        "id": "003378",
        "description": "Topics of current interest in  Electrical Engineering.   Subject matter to be announced in advance.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7150": {
        "name": "EECE.7150 Special Topics (Formerly 16.715)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7150/",
        "id": "003381",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7290": {
        "name": "EECE.7290 Selected Topics in Electrical Engineering (Formerly 16.729)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7290/",
        "id": "003394",
        "description": "Advanced topics in various areas of Electrical Engineering and related fields.  Prerequisite: specified a the time of offering.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7300": {
        "name": "EECE.7300 Thesis - Electrical Engineering (Formerly 16.730)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7300/",
        "id": "003395",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7310": {
        "name": "EECE.7310 Thesis - Computing Engineering (Formerly 16.731)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7310/",
        "id": "030818",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "Students with a CSCE  or UGRD career need permission to take Graduate Level Courses.",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7320": {
        "name": "EECE.7320 Systems Engineering Thesis (Formerly 16.732)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7320/",
        "id": "030819",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7330": {
        "name": "EECE.7330 Advance Graduate Project (Formerly 16.733)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7330/",
        "id": "003396",
        "description": "The Advanced Project is a substantial investigation of a research topic under the supervision of a faculty member. A written proposal must be on file in the Electrical & Engineering Graduate Office before enrollment. A written report is required upon completion of the project. This course can be taken only once, and may evolve into a master's thesis. However, credit for this course will not be given if thesis credit is received.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7360": {
        "name": "EECE.7360 Graduate Project - Electrical Engineering (Formerly 16.736)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7360/",
        "id": "003397",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7390": {
        "name": "EECE.7390 Graduate Project - Electrical Engineering (Formerly 16.739)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7390/",
        "id": "003398",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7400": {
        "name": "EECE.7400 Advanced Project In Electrical Engineering (Formerly 16.740)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7400/",
        "id": "003399",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7430": {
        "name": "EECE.7430 Master's Thesis  in Electrical Engineering (Formerly 16.743)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7430/",
        "id": "003400",
        "description": "Master's Thesis Research",
        "credits": {
            "min": "1",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7460": {
        "name": "EECE.7460 Master's Thesis in Electrical Engineering (Formerly 16.746)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7460/",
        "id": "003401",
        "description": "Co-requisites: Minimum of 6 credit-hours of graduate courses at an acceptable level when registering for first three credits and 12 credit hours when registering for subsequent credits; matriculated status in the M.S. Eng. Program in Electrical, Computer or Systems Engineering; approval of a written proposal outlining the extent and nature of proposed research work. The report on the research work, performed under the supervision of a faculty member, must be published in appropriate form and presented to a committee of three faculty members appointed at the time of acceptance of the thesis proposal. The student is required to give an oral defense of the thesis before the committee and other faculty members.",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7490": {
        "name": "EECE.7490 Master's Thesis - Electrical Engineering (Formerly 16.749)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7490/",
        "id": "003402",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7510": {
        "name": "EECE.7510 Doctoral Thesis (Formerly 16.751)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7510/",
        "id": "030327",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7520": {
        "name": "EECE.7520 PhD Thesis (Formerly 16.752)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7520/",
        "id": "030328",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "2",
            "max": "2"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7530": {
        "name": "EECE.7530 Doctoral Dissertation/EE (Formerly 16.753)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7530/",
        "id": "003403",
        "description": "Doctoral Dissertation Research",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7540": {
        "name": "EECE.7540 Doctoral Thesis - Electrical Engineering (Formerly 16.754)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7540/",
        "id": "030329",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "4",
            "max": "4"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7550": {
        "name": "EECE.7550 Doctoral Dissertation (Formerly 16.755)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7550/",
        "id": "029831",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "5",
            "max": "5"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7560": {
        "name": "EECE.7560 Doctoral Dissertation/Electrical Engineering (Formerly 16.756)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7560/",
        "id": "003404",
        "description": "Doctoral Dissertation Research",
        "credits": {
            "min": "6",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7570": {
        "name": "EECE.7570 Doctoral Dissertation (Formerly 16.757)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7570/",
        "id": "029830",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "7",
            "max": "7"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7590": {
        "name": "EECE.7590 Doctoral Dissertation/Electrical Engineering (Formerly 16.759)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7590/",
        "id": "003405",
        "description": "No more than 9 credits of doctoral dissertation research may be taken before passing the doctoral qualifying examination. No more than 15 credits of doctoral dissertation research may be taken before passing the defense of the thesis proposal examination.",
        "credits": {
            "min": "9",
            "max": "9"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7660": {
        "name": "EECE.7660 Continued Grad Research (Formerly 16.766)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7660/",
        "id": "003407",
        "description": "There is currently no description available for this course.",
        "credits": {
            "min": "1",
            "max": "6"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7710": {
        "name": "EECE.7710 Eng Sys Analysis I (Formerly 16.771)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7710/",
        "id": "003409",
        "description": "Study of the key areas in multiple engineering disciplines including Mechanical, Electrical, Software, Systems and Optical. Students are introduced to weekly topics and then work in multidiscipline teams to solve technical assignments.  Topics covered include: Concept of Operations and Requirements development, integration, test and verification, vibration/shock analysis, thermal analysis, power supply design, digital electronics & FPGA, intro to optical engineering, SCRUM planning, continuous integration and UML/SW design. Content may vary year to year. This course is part of the Engineering Leadership Development Program (ELDP) and team taught by industry experts at BAE Systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7720": {
        "name": "EECE.7720 Eng Sys Analysis II (Formerly 16.772)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7720/",
        "id": "003410",
        "description": "Introduction and analysis of complex systems aligned with the key product lines of BAE Systems.  Students are introduced to multiple types of systems and then work in multidiscipline teams to solve technical assignments.  The systems covered include but are limited to: Electronic Warfare (EW), Communications Electronic Attack (Comms EA), Wide Area Airborne Surveillance (WAAS), Signal Intelligence (SIGINT), RADAR Navigation, Radio Communications, and Infrared Countermeasures (IRCM).   Content may vary year to year. This course is part of the Engineering Leadership Development Program (ELDP) and team taught by industry experts at BAE Systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7730": {
        "name": "EECE.7730 Eng Sys Analysis III (Formerly 16.773)",
        "url": "https://www.uml.edu/catalog/courses/EECE/7730/",
        "id": "003411",
        "description": "Study of project management concepts, product development methods, transition to operations and new business capture. Topics covered include but are not limited to risks and opportunities management, earned value management, lean product development, business strategy, design for manufacturability/maintainability (DFM^2), and request for  information (RFI) response. Content may vary year to year. This course is part of the Engineering Leadership Development Program (ELDP) and team taught by industry experts at BAE Systems.",
        "credits": {
            "min": "3",
            "max": "3"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    },
    "EECE.7CPT": {
        "name": "EECE.7CPT Curricular Practical Training for Engineering Doctoral Candidates",
        "url": "https://www.uml.edu/catalog/courses/EECE/7CPT/",
        "id": "041754",
        "description": "Curricular Practical Training (CPT) is a training program for doctoral students in Engineering. Participation in CPT acknowledges that this an integral part of an established curriculum and directly related to the major area of study or thesis.",
        "credits": {
            "min": "1",
            "max": "1"
        },
        "requirements-text": "",
        "requirements": {
            "prerequisites": [],
            "corequisites": []
        }
    }
}